{
  "ipa_smp": {
    "topics": {
      "Biologi": {
        "subtopics": {
          "Struktur dan Fungsi Sel": {
            "QnA": [
              {
                "patterns": [
                  "apa itu sel",
                  "jelaskan pengertian sel",
                  "definisi sel"
                ],
                "keywords": [
                  "sel",
                  "organel",
                  "membran",
                  "sitoplasma",
                  "nukleus"
                ],
                "responses": [
                  "Sel adalah unit terkecil penyusun makhluk hidup. Setiap sel terdiri dari membran sel, sitoplasma, dan inti sel (nukleus).",
                  "Sel dapat dibedakan menjadi sel prokariotik (tidak memiliki membran inti) dan eukariotik (memiliki membran inti)."
                ],
                "diagram": "images/sel.png",
                "intent": "pengertian sel"
              },
              {
                "patterns": [
                  "organel sel apa saja",
                  "sebutkan bagian-bagian sel",
                  "struktur sel"
                ],
                "keywords": [
                  "organel",
                  "mitokondria",
                  "ribosom",
                  "retikulum",
                  "badan golgi"
                ],
                "responses": [
                  "Organel-organel utama sel meliputi:",
                  "1. Nukleus: pusat kendali sel",
                  "2. Mitokondria: penghasil energi",
                  "3. Ribosom: tempat sintesis protein",
                  "4. Retikulum endoplasma: sistem transport sel",
                  "5. Badan Golgi: alat sekresi sel"
                ],
                "diagram": "images/organel-sel.png",
                "intent": "organel sel"
              }
            ]
          },
          "Fotosintesis": {
            "QnA": [
              {
                "patterns": [
                  "proses fotosintesis",
                  "bagaimana tumbuhan membuat makanan",
                  "apa itu fotosintesis"
                ],
                "keywords": [
                  "fotosintesis",
                  "klorofil",
                  "kloroplas",
                  "glukosa",
                  "karbondioksida",
                  "oksigen"
                ],
                "responses": [
                  "Fotosintesis adalah proses pembuatan makanan oleh tumbuhan hijau menggunakan energi cahaya.",
                  "Reaksi fotosintesis: 6CO₂ + 6H₂O + cahaya → C₆H₁₂O₆ + 6O₂",
                  "Proses ini terjadi di kloroplas yang mengandung klorofil."
                ],
                "diagram": "img/fotosintesis.png",
                "intent": "pengertian fotosintesis"
              },
              {
                "patterns": [
                  "apa hasil fotosintesis",
                  "produk dari fotosintesis"
                ],
                "keywords": [
                  "glukosa",
                  "oksigen",
                  "makanan tumbuhan"
                ],
                "responses": [
                  "Hasil utama fotosintesis adalah glukosa (gula) yang digunakan sebagai sumber energi bagi tumbuhan dan oksigen yang dilepaskan ke atmosfer.",
                  "Glukosa kemudian dapat diubah menjadi bentuk karbohidrat lain seperti pati."
                ],
                "intent": "hasil fotosintesis"
              }
            ]
          },
          "Sistem Pernapasan Manusia": {
            "QnA": [
              {
                "patterns": [
                  "organ pernapasan manusia",
                  "sebutkan alat pernapasan"
                ],
                "keywords": [
                  "organ",
                  "pernapasan",
                  "hidung",
                  "faring",
                  "laring",
                  "trakea",
                  "bronkus",
                  "bronkiolus",
                  "alveolus",
                  "paru-paru"
                ],
                "responses": [
                  "Organ pernapasan manusia terdiri dari hidung, faring, laring, trakea, bronkus, bronkiolus, dan alveolus yang terdapat di dalam paru-paru.",
                  "Setiap organ memiliki peran penting dalam proses pertukaran gas."
                ],
                "diagram": "images/sistem-pernapasan.png",
                "intent": "organ pernapasan"
              },
              {
                "patterns": [
                  "bagaimana proses pernapasan",
                  "jelaskan mekanisme pernapasan"
                ],
                "keywords": [
                  "proses",
                  "mekanisme",
                  "inspirasi",
                  "ekspirasi",
                  "diafragma",
                  "rongga dada",
                  "udara"
                ],
                "responses": [
                  "Proses pernapasan melibatkan dua mekanisme utama: inspirasi (menghirup udara) dan ekspirasi (menghembuskan udara).",
                  "Inspirasi terjadi saat diafragma berkontraksi, dan ekspirasi terjadi saat diafragma relaksasi."
                ],
                "intent": "proses pernapasan"
              }
            ]
          },
          "Sistem Pencernaan Manusia": {
            "QnA": [
              {
                "patterns": [
                  "organ pencernaan manusia",
                  "bagian-bagian sistem pencernaan",
                  "fungsi organ pencernaan"
                ],
                "keywords": [
                  "mulut",
                  "kerongkongan",
                  "lambung",
                  "usus",
                  "enzim"
                ],
                "responses": [
                  "Sistem pencernaan manusia terdiri dari mulut, kerongkongan, lambung, usus halus, usus besar, dan anus.",
                  "Setiap bagian memiliki fungsi spesifik dalam mencerna makanan."
                ],
                "diagram": "images/sistem-pencernaan.png",
                "intent": "organ pencernaan"
              },
              {
                "patterns": [
                  "apa itu enzim pencernaan",
                  "jenis-jenis enzim pencernaan"
                ],
                "keywords": [
                  "enzim",
                  "amilase",
                  "pepsin",
                  "lipase"
                ],
                "responses": [
                  "Enzim pencernaan adalah protein yang membantu memecah molekul makanan menjadi bentuk yang lebih kecil.",
                  "Contoh enzim pencernaan adalah amilase (memecah karbohidrat), pepsin (memecah protein), dan lipase (memecah lemak)."
                ],
                "intent": "enzim pencernaan"
              }
            ]
          },
          "Sistem Peredaran Darah Manusia": {
            "QnA": [
              {
                "patterns": [
                  "organ peredaran darah",
                  "bagian-bagian sistem peredaran darah"
                ],
                "keywords": [
                  "jantung",
                  "pembuluh darah",
                  "darah",
                  "arteri",
                  "vena",
                  "kapiler"
                ],
                "responses": [
                  "Sistem peredaran darah terdiri dari jantung, pembuluh darah (arteri, vena, kapiler), dan darah.",
                  "Sistem ini berfungsi mengangkut oksigen, nutrisi, dan zat sisa ke seluruh tubuh."
                ],
                "diagram": "images/sistem-peredaran-darah.png",
                "intent": "organ peredaran darah"
              },
              {
                "patterns": [
                  "fungsi darah",
                  "peran darah bagi tubuh"
                ],
                "keywords": [
                  "darah",
                  "oksigen",
                  "nutrisi",
                  "karbondioksida",
                  "antibodi"
                ],
                "responses": [
                  "Darah memiliki beberapa fungsi penting, termasuk mengangkut oksigen dan nutrisi, mengangkut karbondioksida, melindungi tubuh dari infeksi melalui antibodi, dan mengatur suhu tubuh.",
                  "Darah terdiri dari plasma dan sel-sel darah (sel darah merah, sel darah putih, dan trombosit)."
                ],
                "intent": "fungsi darah"
              }
            ]
          },
          "Sistem Ekskresi Manusia": {
            "QnA": [
              {
                "patterns": [
                  "organ ekskresi manusia",
                  "alat pengeluaran zat sisa"
                ],
                "keywords": [
                  "ginjal",
                  "hati",
                  "paru-paru",
                  "kulit",
                  "urin",
                  "keringat"
                ],
                "responses": [
                  "Organ ekskresi manusia meliputi ginjal (mengeluarkan urin), hati (mengeluarkan empedu dan urea), paru-paru (mengeluarkan karbon dioksida), dan kulit (mengeluarkan keringat).",
                  "Sistem ekskresi berfungsi untuk membuang zat sisa metabolisme dari tubuh."
                ],
                "diagram": "images/sistem-ekskresi.png",
                "intent": "organ ekskresi"
              },
              {
                "patterns": [
                  "apa itu urin",
                  "proses pembentukan urin"
                ],
                "keywords": [
                  "urin",
                  "ginjal",
                  "filtrasi",
                  "reabsorpsi",
                  "sekresi"
                ],
                "responses": [
                  "Urin adalah cairan sisa metabolisme yang dikeluarkan oleh ginjal.",
                  "Proses pembentukan urin melibatkan filtrasi darah, reabsorpsi zat yang masih dibutuhkan, dan sekresi zat sisa ke dalam tubulus ginjal."
                ],
                "intent": "pembentukan urin"
              }
            ]
          },
          "Ekologi dan Tingkatan Organisasi Kehidupan": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi ekosistem secara lengkap",
                  "uraikan pengertian ekosistem"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "ekosistem",
                  "interaksi",
                  "organisme",
                  "lingkungan",
                  "hidup",
                  "tak hidup",
                  "kesatuan fungsional"
                ],
                "responses": [
                  "Ekosistem secara lengkap didefinisikan sebagai suatu kesatuan fungsional yang dinamis antara komunitas organisme hidup (biotik) dengan lingkungan fisik (abiotik) di mana terjadi interaksi yang saling mempengaruhi dalam aliran energi dan siklus materi. Ini mencakup semua organisme dalam suatu area tertentu, bersama dengan semua komponen fisik dan kimia dari lingkungan mereka, yang saling berhubungan melalui rantai makanan dan proses biogeokimia lainnya."
                ],
                "intent": "definisi_ekosistem"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi populasi dalam biologi",
                  "jelaskan apa yang dimaksud dengan populasi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "populasi",
                  "kelompok individu",
                  "spesies sama",
                  "tempat sama",
                  "waktu sama",
                  "interaksi"
                ],
                "responses": [
                  "Dalam biologi, populasi secara rinci didefinisikan sebagai kelompok individu dari spesies yang sama yang hidup dan berinteraksi di area geografis yang sama pada waktu tertentu. Anggota populasi berbagi sumber daya, dipengaruhi oleh faktor lingkungan yang serupa, dan memiliki potensi untuk berinteraksi satu sama lain, termasuk perkawinan dan kompetisi."
                ],
                "intent": "definisi_populasi"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi komunitas dalam konteks ekologi",
                  "uraikan pengertian komunitas"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "komunitas",
                  "kumpulan populasi",
                  "spesies berbeda",
                  "area sama",
                  "interaksi antar spesies",
                  "struktur"
                ],
                "responses": [
                  "Dalam konteks ekologi, komunitas secara komprehensif didefinisikan sebagai kumpulan dari berbagai populasi spesies yang berbeda yang hidup dan berinteraksi dalam area geografis yang sama. Komunitas dicirikan oleh keanekaragaman spesies, kelimpahan relatif setiap spesies, dan jenis interaksi yang terjadi antar spesies, seperti predasi, kompetisi, mutualisme, dan parasitisme, yang membentuk struktur dan fungsi ekologis dari area tersebut."
                ],
                "intent": "definisi_komunitas"
              }
            ]
          },
          "Sel dan Organel Sel": {
            "QnA": [
              {
                "patterns": [
                  "uraikan definisi sel secara mendalam dalam biologi",
                  "jelaskan apa yang dimaksud dengan sel"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "sel",
                  "unit struktural",
                  "unit fungsional",
                  "unit hereditas",
                  "kehidupan",
                  "membran",
                  "sitoplasma",
                  "organel"
                ],
                "responses": [
                  "Dalam biologi, sel secara mendalam didefinisikan sebagai unit struktural, fungsional, dan hereditas terkecil dari kehidupan. Sel mampu melakukan semua proses yang terkait dengan kehidupan, seperti metabolisme, pertumbuhan, respons terhadap rangsangan, dan reproduksi. Secara umum, sel dibatasi oleh membran plasma, mengandung sitoplasma, dan berbagai organel yang menjalankan fungsi-fungsi spesifik."
                ],
                "intent": "definisi_sel"
              },
              {
                "patterns": [
                  "jelaskan definisi mitokondria secara rinci dan fungsinya sebagai 'pembangkit tenaga' sel",
                  "uraikan pengertian mitokondria"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "mitokondria",
                  "organel",
                  "membran ganda",
                  "krista",
                  "matrix",
                  "respirasi seluler",
                  "ATP",
                  "pembangkit tenaga"
                ],
                "responses": [
                  "Mitokondria secara rinci didefinisikan sebagai organel sel bermembran ganda yang berperan utama dalam respirasi seluler dan produksi sebagian besar energi sel dalam bentuk adenosin trifosfat (ATP). Membran dalamnya berlipat-lipat membentuk krista, yang meningkatkan luas permukaan untuk reaksi respirasi. Matrix mitokondria mengandung enzim dan molekul lain yang terlibat dalam siklus Krebs dan fosforilasi oksidatif, menjadikannya 'pembangkit tenaga' sel."
                ],
                "intent": "definisi_mitokondria"
              },
              {
                "patterns": [
                  "uraikan secara komprehensif definisi kloroplas dan perannya dalam fotosintesis",
                  "jelaskan apa yang dimaksud dengan kloroplas"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "kloroplas",
                  "organel",
                  "plastida",
                  "membran tilakoid",
                  "stroma",
                  "klorofil",
                  "fotosintesis",
                  "energi cahaya",
                  "glukosa"
                ],
                "responses": [
                  "Kloroplas secara komprehensif didefinisikan sebagai organel unik yang ditemukan dalam sel tumbuhan dan alga, termasuk dalam kelompok plastida, yang merupakan tempat terjadinya fotosintesis. Kloroplas mengandung pigmen klorofil yang menyerap energi cahaya, serta membran tilakoid yang tersusun dalam grana dan stroma (cairan di dalam kloroplas) yang merupakan tempat berlangsungnya reaksi terang dan gelap fotosintesis, menghasilkan glukosa dari karbon dioksida dan air."
                ],
                "intent": "definisi_kloroplas"
              }
            ]
          },
          "Metabolisme Sel": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi metabolisme sel secara menyeluruh",
                  "uraikan pengertian metabolisme"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "metabolisme sel",
                  "keseluruhan reaksi kimia",
                  "dalam sel",
                  "anabolisme",
                  "katabolisme",
                  "energi"
                ],
                "responses": [
                  "Metabolisme sel secara menyeluruh didefinisikan sebagai keseluruhan rangkaian reaksi kimia yang terjadi di dalam sel organisme untuk mempertahankan kehidupan. Metabolisme terdiri dari dua jenis utama proses: anabolisme (reaksi yang membangun molekul kompleks dari molekul yang lebih sederhana, membutuhkan energi) dan katabolisme (reaksi yang memecah molekul kompleks menjadi molekul yang lebih sederhana, melepaskan energi). Keseimbangan antara anabolisme dan katabolisme penting untuk pertumbuhan, perbaikan, dan fungsi seluler."
                ],
                "intent": "definisi_metabolisme_sel"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi respirasi seluler dan tahapan utamanya",
                  "jelaskan apa yang dimaksud dengan respirasi seluler"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "respirasi seluler",
                  "pemecahan glukosa",
                  "energi",
                  "ATP",
                  "aerob",
                  "anaerob",
                  "glikolisis",
                  "siklus krebs",
                  "rantai transpor elektron"
                ],
                "responses": [
                  "Respirasi seluler secara rinci didefinisikan sebagai serangkaian proses metabolisme yang kompleks di mana sel memperoleh energi kimia dalam bentuk ATP (adenosin trifosfat) dengan memecah molekul organik, terutama glukosa. Respirasi seluler dapat terjadi secara aerob (membutuhkan oksigen) atau anaerob (tidak membutuhkan oksigen). Tahapan utama respirasi aerob meliputi glikolisis, siklus Krebs (siklus asam sitrat), dan rantai transpor elektron dengan fosforilasi oksidatif."
                ],
                "intent": "definisi_respirasi_seluler"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi fotosintesis dan dua tahap utamanya",
                  "uraikan pengertian fotosintesis"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "fotosintesis",
                  "energi cahaya",
                  "energi kimia",
                  "glukosa",
                  "tumbuhan",
                  "alga",
                  "bakteri fotosintetik",
                  "reaksi terang",
                  "reaksi gelap"
                ],
                "responses": [
                  "Fotosintesis secara komprehensif didefinisikan sebagai proses biokimia di mana energi cahaya matahari diubah menjadi energi kimia dalam bentuk glukosa (gula) oleh tumbuhan, alga, dan beberapa jenis bakteri. Proses ini umumnya melibatkan dua tahap utama: reaksi terang (terjadi pada membran tilakoid, mengubah energi cahaya menjadi energi kimia sementara dalam bentuk ATP dan NADPH) dan reaksi gelap (siklus Calvin, terjadi di stroma, menggunakan ATP dan NADPH untuk mengubah karbon dioksida menjadi glukosa)."
                ],
                "intent": "definisi_fotosintesis"
              }
            ]
          },
          "Genetika dan Pewarisan Sifat (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "uraikan definisi gen secara mendalam dalam konteks genetika molekuler",
                  "jelaskan apa yang dimaksud dengan gen"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "gen",
                  "unit informasi genetik",
                  "DNA",
                  "kromosom",
                  "urutan nukleotida",
                  "protein",
                  "RNA",
                  "ekspresi gen"
                ],
                "responses": [
                  "Dalam konteks genetika molekuler, gen secara mendalam didefinisikan sebagai unit informasi genetik yang terdapat dalam molekul DNA (asam deoksiribonukleat) dan tersusun dalam kromosom. Gen merupakan urutan spesifik nukleotida yang mengkode sintesis produk fungsional, baik berupa protein (melalui proses transkripsi menjadi RNA dan translasi) maupun molekul RNA fungsional itu sendiri. Gen bertanggung jawab atas pewarisan sifat dari generasi ke generasi melalui replikasi dan ekspresinya."
                ],
                "intent": "definisi_gen"
              },
              {
                "patterns": [
                  "jelaskan definisi alel secara rinci dan perannya dalam variasi genetik",
                  "uraikan pengertian alel"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "alel",
                  "varian gen",
                  "lokus sama",
                  "kromosom homolog",
                  "dominan",
                  "resesif",
                  "variasi genetik"
                ],
                "responses": [
                  "Alel secara rinci didefinisikan sebagai salah satu dari dua atau lebih bentuk alternatif dari suatu gen yang terletak pada lokus (posisi) yang sama pada kromosom homolog. Setiap individu diploid biasanya memiliki dua alel untuk setiap gen, satu diwariskan dari masing-masing orang tua. Kombinasi alel yang berbeda (genotip) menghasilkan variasi genetik dalam populasi dan berkontribusi pada perbedaan fenotipik antar individu."
                ],
                "intent": "definisi_alel"
              },
              {
                "patterns": [
                  "uraikan secara komprehensif definisi kromosom dan strukturnya",
                  "jelaskan apa yang dimaksud dengan kromosom"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "kromosom",
                  "struktur DNA",
                  "protein histon",
                  "kromatin",
                  "sentromer",
                  "telomer",
                  "pembawa genetik"
                ],
                "responses": [
                  "Kromosom secara komprehensif didefinisikan sebagai struktur terorganisir dari DNA dan protein yang ditemukan dalam inti sel eukariotik. Selama pembelahan sel, kromosom menjadi lebih padat dan terlihat jelas. Kromosom terdiri dari molekul DNA panjang yang melilit protein histon, membentuk kompleks yang disebut kromatin. Setiap kromosom memiliki sentromer (tempat melekatnya benang spindel) dan telomer (ujung pelindung). Kromosom berfungsi sebagai pembawa utama informasi genetik."
                ],
                "intent": "definisi_kromosom"
              }
            ]
          },
          "Evolusi dan Mekanisme Evolusi (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi seleksi alam secara mendalam sebagai mekanisme utama evolusi",
                  "uraikan pengertian seleksi alam"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "seleksi alam",
                  "mekanisme evolusi",
                  "variasi genetik",
                  "keberhasilan reproduksi",
                  "adaptasi",
                  "lingkungan"
                ],
                "responses": [
                  "Seleksi alam secara mendalam didefinisikan sebagai proses di mana individu-individu dalam suatu populasi yang memiliki variasi sifat genetik yang lebih sesuai dengan lingkungannya cenderung memiliki tingkat kelangsungan hidup dan keberhasilan reproduksi yang lebih tinggi dibandingkan individu dengan sifat yang kurang menguntungkan. Akibatnya, frekuensi alel yang menguntungkan cenderung meningkat dalam populasi dari generasi ke generasi, yang mengarah pada adaptasi evolusioner."
                ],
                "intent": "definisi_seleksi_alam"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi adaptasi dalam konteks evolusi",
                  "jelaskan apa yang dimaksud dengan adaptasi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "adaptasi",
                  "sifat warisan",
                  "meningkatkan kelangsungan hidup",
                  "keberhasilan reproduksi",
                  "lingkungan spesifik",
                  "evolusi"
                ],
                "responses": [
                  "Adaptasi secara rinci didefinisikan sebagai sifat warisan yang memungkinkan suatu organisme untuk bertahan hidup dan bereproduksi lebih baik dalam lingkungan spesifiknya. Adaptasi dapat berupa sifat struktural, fisiologis, atau perilaku yang telah berevolusi melalui proses seleksi alam selama periode waktu yang panjang, meningkatkan kesesuaian organisme dengan lingkungannya."
                ],
                "intent": "definisi_adaptasi"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi spesiasi sebagai pembentukan spesies baru",
                  "uraikan pengertian spesiasi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "spesiasi",
                  "pembentukan spesies baru",
                  "isolasi reproduksi",
                  "divergensi genetik",
                  "mekanisme spesiasi",
                  "alopatri",
                  "simpatri"
                ],
                "responses": [
                  "Spesiasi secara komprehensif didefinisikan sebagai proses evolusioner di mana populasi leluhur tunggal terpecah dan berkembang menjadi dua atau lebih spesies yang berbeda. Proses ini seringkali melibatkan isolasi reproduksi antara populasi yang terpisah, yang mencegah aliran gen dan memungkinkan divergensi genetik secara bertahap akibat seleksi alam, hanyutan genetik, dan mutasi. Mekanisme spesiasi utama meliputi spesiasi alopatri (pemisahan geografis) dan spesiasi simpatri (terjadi dalam area geografis yang sama)."
                ],
                "intent": "definisi_spesiasi"
              }
            ]
          },
          "Klasifikasi Makhluk Hidup (Taksonomi)": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi taksonomi secara mendalam dalam biologi",
                  "uraikan pengertian taksonomi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "taksonomi",
                  "ilmu klasifikasi",
                  "prinsip penamaan",
                  "pengelompokan",
                  "hierarki taksonomi",
                  "hubungan evolusioner"
                ],
                "responses": [
                  "Taksonomi secara mendalam didefinisikan sebagai cabang ilmu biologi yang berkaitan dengan prinsip dan prosedur klasifikasi serta penamaan organisme hidup (dan fosil). Taksonomi bertujuan untuk mengelompokkan organisme berdasarkan kesamaan karakteristik dan hubungan evolusioner mereka, menggunakan sistem hierarki yang mencakup domain, kingdom, filum (atau divisi), kelas, ordo, famili, genus, dan spesies."
                ],
                "intent": "definisi_taksonomi"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi spesies sebagai unit dasar klasifikasi",
                  "jelaskan apa yang dimaksud dengan spesies"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "spesies",
                  "unit dasar klasifikasi",
                  "kelompok populasi",
                  "kemampuan kawin",
                  "menghasilkan keturunan fertil",
                  "isolasi reproduksi"
                ],
                "responses": [
                  "Spesies secara rinci didefinisikan sebagai kelompok populasi organisme yang secara alami mampu melakukan perkawinan silang dan menghasilkan keturunan yang fertil (mampu bereproduksi). Konsep spesies seringkali melibatkan isolasi reproduksi dari kelompok lain, meskipun definisi ini dapat menjadi kompleks untuk beberapa organisme seperti bakteri dan tumbuhan yang melakukan hibridisasi."
                ],
                "intent": "definisi_spesies"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi filogeni dan hubungannya dengan taksonomi",
                  "uraikan pengertian filogeni"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "filogeni",
                  "sejarah evolusioner",
                  "hubungan antar organisme",
                  "pohon filogenetik",
                  "data genetik",
                  "data morfologi",
                  "taksonomi evolusioner"
                ],
                "responses": [
                  "Filogeni secara komprehensif didefinisikan sebagai studi tentang sejarah evolusioner dan hubungan kekerabatan antar kelompok organisme (misalnya, spesies, populasi, gen). Filogeni direkonstruksi menggunakan berbagai sumber data, termasuk data genetik (urutan DNA dan RNA) dan data morfologi (karakteristik fisik). Pohon filogenetik (cladogram) menggambarkan hubungan evolusioner ini. Filogeni memberikan dasar ilmiah untuk sistem klasifikasi taksonomi yang mencerminkan sejarah evolusi kehidupan."
                ],
                "intent": "definisi_filogeni"
              }
            ]
          },
          "Anatomi dan Fisiologi Tumbuhan (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi jaringan meristem secara mendalam dan peranannya dalam pertumbuhan tumbuhan",
                  "uraikan pengertian jaringan meristem"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "jaringan meristem",
                  "sel aktif membelah",
                  "pertumbuhan primer",
                  "pertumbuhan sekunder",
                  "meristem apikal",
                  "meristem lateral"
                ],
                "responses": [
                  "Jaringan meristem secara mendalam didefinisikan sebagai jaringan tumbuhan yang terdiri dari sel-sel yang aktif membelah (meristematik) dan belum terdiferensiasi, yang bertanggung jawab atas pertumbuhan tumbuhan. Meristem apikal terletak di ujung akar dan batang, menyebabkan pertumbuhan primer (pemanjangan). Meristem lateral (kambium vaskular dan kambium gabus) menyebabkan pertumbuhan sekunder (pelebaran batang dan akar)."
                ],
                "intent": "definisi_jaringan_meristem"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi jaringan vaskular (xilem dan floem) dan fungsinya dalam transportasi",
                  "jelaskan apa yang dimaksud dengan jaringan vaskular"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "jaringan vaskular",
                  "xilem",
                  "floem",
                  "transportasi air",
                  "nutrisi",
                  "fotosintat",
                  "pembuluh kayu",
                  "pembuluh tapis"
                ],
                "responses": [
                  "Jaringan vaskular secara rinci didefinisikan sebagai sistem transportasi utama dalam tumbuhan, terdiri dari dua jenis jaringan utama: xilem dan floem. Xilem mengangkut air dan mineral terlarut dari akar ke seluruh bagian tumbuhan melalui pembuluh kayu (trakea dan trakeid). Floem mengangkut gula (fotosintat) yang dihasilkan selama fotosintesis dari daun ke bagian lain tumbuhan yang membutuhkan melalui pembuluh tapis (sel tapis dan sel pengiring)."
                ],
                "intent": "definisi_jaringan_vaskular"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi stomata dan peranannya dalam pertukaran gas dan transpirasi",
                  "uraikan pengertian stomata"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "stomata",
                  "pori-pori kecil",
                  "epidermis daun",
                  "sel penjaga",
                  "pertukaran gas",
                  "CO2",
                  "O2",
                  "transpirasi",
                  "penguapan air"
                ],
                "responses": [
                  "Stomata secara komprehensif didefinisikan sebagai pori-pori kecil yang terdapat di epidermis daun dan batang tumbuhan, yang dikelilingi oleh sepasang sel penjaga yang dapat mengatur ukuran lubang stomata. Stomata berperan penting dalam pertukaran gas antara tumbuhan dan atmosfer (masuknya karbon dioksida untuk fotosintesis dan keluarnya oksigen) serta dalam proses transpirasi (penguapan air dari permukaan daun)."
                ],
                "intent": "definisi_stomata"
              }
            ]
          },
          "Anatomi dan Fisiologi Hewan (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi sistem peredaran darah secara mendalam dan komponen utamanya",
                  "uraikan pengertian sistem peredaran darah"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "sistem peredaran darah",
                  "transportasi",
                  "darah",
                  "jantung",
                  "pembuluh darah",
                  "oksigen",
                  "nutrisi",
                  "limbah"
                ],
                "responses": [
                  "Sistem peredaran darah secara mendalam didefinisikan sebagai sistem organ kompleks pada hewan yang bertanggung jawab untuk transportasi zat-zat penting seperti oksigen, nutrisi, hormon, dan produk limbah ke seluruh tubuh. Komponen utama sistem peredaran darah meliputi darah (sebagai medium transportasi), jantung (sebagai pompa), dan pembuluh darah (arteri, vena, dan kapiler) yang membentuk jaringan saluran."
                ],
                "intent": "definisi_sistem_peredaran_darah"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi sistem saraf dan unit fungsionalnya (neuron)",
                  "jelaskan apa yang dimaksud dengan sistem saraf"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "sistem saraf",
                  "komunikasi",
                  "koordinasi",
                  "neuron",
                  "impuls saraf",
                  "otak",
                  "sumsum tulang belakang"
                ],
                "responses": [
                  "Sistem saraf secara rinci didefinisikan sebagai sistem organ yang kompleks dan penting untuk komunikasi dan koordinasi di dalam tubuh hewan. Unit fungsional dasar sistem saraf adalah neuron (sel saraf) yang mampu menghasilkan dan menghantarkan impuls saraf (sinyal listrik dan kimia) untuk menerima, memproses, dan merespons informasi dari lingkungan internal dan eksternal. Sistem saraf pusat (otak dan sumsum tulang belakang) dan sistem saraf tepi bekerja sama dalam fungsi ini."
                ],
                "intent": "definisi_sistem_saraf"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi sistem pencernaan dan proses utamanya",
                  "uraikan pengertian sistem pencernaan"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "sistem pencernaan",
                  "pencernaan mekanik",
                  "pencernaan kimiawi",
                  "absorpsi",
                  "eliminasi",
                  "mulut",
                  "lambung",
                  "usus"
                ],
                "responses": [
                  "Sistem pencernaan secara komprehensif didefinisikan sebagai sistem organ yang bertanggung jawab untuk memecah makanan menjadi molekul-molekul kecil yang dapat diserap oleh tubuh untuk energi, pertumbuhan, dan perbaikan. Proses utama dalam sistem pencernaan meliputi pencernaan mekanik (pemecahan fisik makanan), pencernaan kimiawi (pemecahan molekul makanan oleh enzim), absorpsi (penyerapan nutrisi ke dalam aliran darah), dan eliminasi (pembuangan sisa-sisa makanan yang tidak tercerna). Organ-organ utama sistem pencernaan meliputi mulut, kerongkongan, lambung, usus halus, dan usus besar."
                ],
                "intent": "definisi_sistem_pencernaan"
              }
            ]
          },
          "Mikroorganisme dan Peranannya": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi mikroorganisme secara mendalam dan kelompok utamanya",
                  "uraikan pengertian mikroorganisme"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "mikroorganisme",
                  "organisme mikroskopis",
                  "bakteri",
                  "virus",
                  "fungi",
                  "protozoa",
                  "alga mikroskopis"
                ],
                "responses": [
                  "Mikroorganisme secara mendalam didefinisikan sebagai organisme hidup yang berukuran sangat kecil sehingga tidak dapat dilihat dengan mata telanjang dan memerlukan mikroskop untuk pengamatan. Kelompok utama mikroorganisme meliputi bakteri (prokariotik), virus (entitas aseluler), fungi (eukariotik), protozoa (eukariotik uniseluler), dan alga mikroskopis (eukariotik fotosintetik)."
                ],
                "intent": "definisi_mikroorganisme"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi bakteri dan peran pentingnya dalam ekosistem",
                  "jelaskan apa yang dimaksud dengan bakteri"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "bakteri",
                  "prokariotik",
                  "uniseluler",
                  "dinding sel",
                  "DNA sirkuler",
                  "dekomposer",
                  "nitrogen",
                  "patogen"
                ],
                "responses": [
                  "Bakteri secara rinci didefinisikan sebagai mikroorganisme prokariotik uniseluler yang memiliki dinding sel dan materi genetik berupa DNA sirkuler yang tidak terbungkus membran inti. Bakteri memainkan peran yang sangat penting dalam ekosistem sebagai dekomposer (menguraikan materi organik), dalam siklus biogeokimia (misalnya siklus nitrogen), dan beberapa jenis bakteri juga berperan sebagai patogen penyebab penyakit."
                ],
                "intent": "definisi_bakteri"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi virus dan karakteristik uniknya sebagai agen infeksi",
                  "uraikan pengertian virus"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "virus",
                  "agen infeksi",
                  "aseluler",
                  "asam nukleat",
                  "kapsid",
                  "parasit obligat",
                  "replikasi",
                  "inang sel"
                ],
                "responses": [
                  "Virus secara komprehensif didefinisikan sebagai agen infeksi aseluler (tidak memiliki struktur seluler) yang terdiri dari materi genetik (DNA atau RNA) yang dikelilingi oleh lapisan protein pelindung yang disebut kapsid. Virus merupakan parasit obligat intraseluler, yang berarti mereka hanya dapat bereplikasi di dalam sel inang hidup dengan memanfaatkan mekanisme replikasi sel inang."
                ],
                "intent": "definisi_virus"
              }
            ]
          },
          "Bioteknologi Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi bioteknologi secara mendalam dan cakupan bidangnya",
                  "uraikan pengertian bioteknologi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "bioteknologi",
                  "pemanfaatan organisme",
                  "sistem biologis",
                  "proses biologis",
                  "teknologi",
                  "pertanian",
                  "kedokteran",
                  "industri"
                ],
                "responses": [
                  "Bioteknologi secara mendalam didefinisikan sebagai pemanfaatan organisme hidup, sistem biologis, atau proses biologis untuk menghasilkan atau memodifikasi produk atau proses untuk kegunaan tertentu. Bidang bioteknologi memiliki cakupan yang luas dan mencakup aplikasi dalam berbagai sektor, termasuk pertanian (misalnya tanaman transgenik), kedokteran (misalnya produksi insulin), dan industri (misalnya produksi enzim)."
                ],
                "intent": "definisi_bioteknologi"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi fermentasi dan contoh penerapannya dalam bioteknologi pangan",
                  "jelaskan apa yang dimaksud dengan fermentasi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "fermentasi",
                  "metabolisme anaerob",
                  "mikroorganisme",
                  "produk pangan",
                  "yogurt",
                  "tempe",
                  "alkohol"
                ],
                "responses": [
                  "Fermentasi secara rinci didefinisikan sebagai proses metabolisme anaerob (tidak memerlukan oksigen) di mana mikroorganisme seperti bakteri dan fungi mengubah senyawa organik menjadi produk yang lebih sederhana, seringkali menghasilkan energi. Dalam bioteknologi pangan, fermentasi dimanfaatkan untuk menghasilkan berbagai produk seperti yogurt (oleh bakteri asam laktat), tempe (oleh jamur *Rhizopus*), dan minuman beralkohol (oleh ragi)."
                ],
                "intent": "definisi_fermentasi"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi rekayasa genetika dan tujuannya",
                  "uraikan pengertian rekayasa genetika"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "rekayasa genetika",
                  "manipulasi gen",
                  "DNA rekombinan",
                  "organisme transgenik",
                  "perbaikan genetik",
                  "produksi protein"
                ],
                "responses": [
                  "Rekayasa genetika secara komprehensif didefinisikan sebagai sekumpulan teknologi yang digunakan untuk memanipulasi materi genetik (DNA) organisme, termasuk gen, untuk menghasilkan perubahan yang diinginkan. Tujuannya meliputi perbaikan genetik, produksi protein terapeutik, pengembangan tanaman dan hewan transgenik dengan sifat unggul, dan penelitian ilmiah tentang fungsi gen."
                ],
                "intent": "definisi_rekayasa_genetika"
              }
            ]
          },
          "Konservasi Keanekaragaman Hayati": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi keanekaragaman hayati secara mendalam dan tingkatannya",
                  "uraikan pengertian keanekaragaman hayati"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "keanekaragaman hayati",
                  "biodiversitas",
                  "variasi kehidupan",
                  "genetik",
                  "spesies",
                  "ekosistem"
                ],
                "responses": [
                  "Keanekaragaman hayati (biodiversitas) secara mendalam didefinisikan sebagai keseluruhan variasi kehidupan di Bumi pada semua tingkat organisasi biologis, mulai dari variasi genetik dalam spesies, keanekaragaman spesies yang ada, hingga keanekaragaman ekosistem. Tingkatan keanekaragaman hayati meliputi keanekaragaman genetik (variasi gen dalam suatu spesies), keanekaragaman spesies (jumlah dan kelimpahan spesies), dan keanekaragaman ekosistem (variasi habitat dan komunitas ekologis)."
                ],
                "intent": "definisi_keanekaragaman_hayati"
              },
              {
                "patterns": [
                  "uraikan secara rinci definisi konservasi in situ dan contoh penerapannya",
                  "jelaskan apa yang dimaksud dengan konservasi in situ"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "konservasi in situ",
                  "habitat asli",
                  "perlindungan ekosistem",
                  "cagar alam",
                  "taman nasional"
                ],
                "responses": [
                  "Konservasi in situ secara rinci didefinisikan sebagai upaya konservasi keanekaragaman hayati yang dilakukan di dalam habitat alami spesies atau ekosistem. Tujuannya adalah untuk mempertahankan populasi yang layak secara ekologis dan evolusioner di lingkungan aslinya. Contoh penerapannya adalah pembentukan cagar alam, taman nasional, dan suaka margasatwa."
                ],
                "intent": "definisi_konservasi_in_situ"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif definisi konservasi ex situ dan contoh penerapannya",
                  "uraikan pengertian konservasi ex situ"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "konservasi ex situ",
                  "luar habitat asli",
                  "kebun binatang",
                  "kebun raya",
                  "bank gen"
                ],
                "responses": [
                  "Konservasi ex situ secara komprehensif didefinisikan sebagai upaya konservasi keanekaragaman hayati yang dilakukan di luar habitat alami spesies, seperti di kebun binatang, kebun raya, bank gen (penyimpanan benih, sperma, ovum, atau DNA), dan akuarium. Metode ini sering digunakan untuk melindungi spesies yang terancam punah atau habitatnya telah rusak parah."
                ],
                "intent": "definisi_konservasi_ex_situ"
              }
            ]
          },
          "Organ Tubuh Manusia dan Fungsinya": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan secara mendalam struktur dan fungsi jantung dalam sistem peredaran darah manusia",
                  "uraikan peran jantung"
                ],
                "keywords": [
                  "struktur jantung",
                  "fungsi jantung",
                  "bilik jantung",
                  "katup jantung",
                  "peredaran darah besar",
                  "peredaran darah kecil",
                  "denyut jantung"
                ],
                "responses": [
                  "Jantung adalah organ muskular berongga yang terletak di rongga dada dan merupakan pusat dari sistem peredaran darah manusia. Secara struktural, jantung terdiri dari empat bilik utama: dua atrium (serambi) yang menerima darah dan dua ventrikel (bilik) yang memompa darah keluar dari jantung. Atrium kanan menerima darah deoksigenasi dari seluruh tubuh, yang kemudian dialirkan ke ventrikel kanan. Ventrikel kanan memompa darah ini ke paru-paru melalui arteri pulmonalis untuk pertukaran gas (melepaskan karbon dioksida dan mengikat oksigen) dalam peredaran darah kecil. Sementara itu, atrium kiri menerima darah beroksigen dari paru-paru melalui vena pulmonalis, yang kemudian dialirkan ke ventrikel kiri. Ventrikel kiri adalah bilik yang paling berotot dan memompa darah beroksigen ke seluruh tubuh melalui aorta dalam peredaran darah besar. Fungsi utama jantung adalah untuk memompa darah secara terus menerus melalui pembuluh darah, memastikan pasokan oksigen dan nutrisi yang memadai ke seluruh jaringan dan organ tubuh, serta mengangkut produk limbah metabolisme untuk dikeluarkan dari tubuh. Kerja jantung diatur oleh impuls listrik yang menghasilkan siklus kontraksi dan relaksasi yang terkoordinasi, yang dikenal sebagai siklus jantung, dan menghasilkan denyut jantung yang dapat dirasakan."
                ],
                "intent": "fungsi_jantung"
              },
              {
                "patterns": [
                  "uraikan secara rinci struktur dan fungsi paru-paru dalam sistem pernapasan manusia",
                  "jelaskan peran paru-paru"
                ],
                "keywords": [
                  "struktur paru-paru",
                  "fungsi paru-paru",
                  "alveolus",
                  "bronkiolus",
                  "pertukaran gas",
                  "oksigen",
                  "karbon dioksida",
                  "inspirasi",
                  "ekspirasi"
                ],
                "responses": [
                  "Paru-paru adalah sepasang organ spons yang terletak di rongga dada dan merupakan komponen utama dari sistem pernapasan manusia. Secara struktural, paru-paru terdiri dari jutaan kantung udara kecil yang disebut alveolus, yang dikelilingi oleh jaringan kapiler darah. Udara masuk ke paru-paru melalui trakea (batang tenggorokan) yang bercabang menjadi bronkus utama, kemudian terus bercabang menjadi bronkiolus yang semakin kecil, berakhir di alveolus. Dinding alveolus sangat tipis dan lembap, memungkinkan terjadinya pertukaran gas yang efisien antara udara dalam alveveolus dan darah dalam kapiler. Fungsi utama paru-paru adalah untuk memfasilitasi pertukaran gas: mengambil oksigen dari udara yang dihirup dan memasukkannya ke dalam darah, serta mengeluarkan karbon dioksida dari darah ke udara yang dihembuskan. Proses pernapasan melibatkan dua fase utama: inspirasi (menghirup udara) yang terjadi ketika otot diafragma berkontraksi dan rongga dada membesar, menciptakan tekanan negatif yang menarik udara masuk ke paru-paru; dan ekspirasi (menghembuskan udara) yang terjadi ketika diafragma relaksasi dan rongga dada mengecil, mendorong udara keluar dari paru-paru. Volume udara yang masuk dan keluar paru-paru diatur oleh kebutuhan tubuh akan oksigen dan pembuangan karbon dioksida."
                ],
                "intent": "fungsi_paru_paru"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif struktur dan fungsi ginjal dalam sistem ekskresi manusia",
                  "uraikan peran ginjal"
                ],
                "keywords": [
                  "struktur ginjal",
                  "fungsi ginjal",
                  "nefron",
                  "glomerulus",
                  "tubulus",
                  "filtrasi darah",
                  "reabsorpsi",
                  "sekresi",
                  "pembentukan urin",
                  "pengaturan cairan tubuh"
                ],
                "responses": [
                  "Ginjal adalah sepasang organ berbentuk kacang yang terletak di kedua sisi tulang belakang di bagian belakang rongga perut dan merupakan organ utama dalam sistem ekskresi manusia. Secara struktural, setiap ginjal terdiri dari jutaan unit fungsional yang disebut nefron. Setiap nefron memiliki glomerulus (jaringan kapiler tempat filtrasi darah terjadi) dan tubulus (serangkaian saluran tempat reabsorpsi dan sekresi zat terjadi). Fungsi utama ginjal adalah untuk menyaring darah, menghilangkan produk limbah metabolisme (seperti urea dan kreatinin), kelebihan garam, dan air, serta menghasilkan urin. Proses pembentukan urin melibatkan tiga tahap utama: filtrasi (darah disaring di glomerulus, menghasilkan filtrat glomerular), reabsorpsi (zat-zat penting seperti air, glukosa, dan asam amino diserap kembali dari tubulus ke dalam darah), dan sekresi (zat-zat tambahan, termasuk beberapa obat dan ion, dikeluarkan dari darah ke dalam tubulus). Selain pembentukan urin dan pembuangan limbah, ginjal juga berperan penting dalam pengaturan keseimbangan cairan dan elektrolit tubuh, pengaturan tekanan darah (melalui produksi renin), dan produksi hormon (seperti eritropoietin yang merangsang produksi sel darah merah)."
                ],
                "intent": "fungsi_ginjal"
              }
            ]
          },
          "Ekologi Perilaku": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi ekologi perilaku secara mendalam dan fokus studinya",
                  "uraikan pengertian ekologi perilaku"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "ekologi perilaku",
                  "evolusi perilaku",
                  "adaptasi perilaku",
                  "lingkungan",
                  "kelangsungan hidup",
                  "reproduksi"
                ],
                "responses": [
                  "Ekologi perilaku secara mendalam didefinisikan sebagai studi tentang dasar ekologis dan evolusioner dari perilaku hewan dalam kaitannya dengan lingkungan mereka. Fokus utama studi ini adalah untuk memahami bagaimana perilaku tertentu berkontribusi pada kelangsungan hidup dan keberhasilan reproduksi individu dalam konteks ekologis tertentu. Ekolog perilaku mempelajari bagaimana faktor-faktor lingkungan, seperti ketersediaan sumber daya, risiko predasi, dan interaksi sosial, membentuk evolusi dan ekspresi perilaku adaptif."
                ],
                "intent": "definisi_ekologi_perilaku"
              },
              {
                "patterns": [
                  "uraikan secara rinci konsep perilaku altruistik dan bagaimana evolusinya dapat dijelaskan",
                  "jelaskan perilaku altruistik"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "perilaku altruistik",
                  "menguntungkan orang lain",
                  "merugikan diri sendiri",
                  "seleksi kekerabatan",
                  "kebugaran inklusif",
                  "altruisme timbal balik"
                ],
                "responses": [
                  "Perilaku altruistik secara rinci didefinisikan sebagai tindakan yang mengurangi kebugaran (kemampuan bertahan hidup dan bereproduksi) individu yang melakukannya sambil meningkatkan kebugaran individu lain. Evolusi perilaku altruistik tampaknya paradoks dengan prinsip seleksi alam yang berfokus pada keuntungan individu. Namun, evolusi altruisme dapat dijelaskan melalui beberapa mekanisme, termasuk seleksi kekerabatan (di mana individu membantu kerabat dekat yang berbagi gen, sehingga meningkatkan kebugaran inklusif mereka), dan altruisme timbal balik (di mana individu membantu orang lain dengan harapan akan dibalas di masa depan)."
                ],
                "intent": "definisi_altruisme"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif berbagai jenis sistem perkawinan pada hewan dan faktor-faktor yang mempengaruhinya",
                  "uraikan sistem perkawinan hewan"
                ],
                "keywords": [
                  "sistem perkawinan",
                  "monogami",
                  "poligami",
                  "poligini",
                  "poliandri",
                  "promiskuitas",
                  "ketersediaan sumber daya",
                  "perawatan anak",
                  "rasio jenis kelamin"
                ],
                "responses": [
                  "Sistem perkawinan pada hewan merujuk pada pola hubungan perkawinan antara jantan dan betina dalam suatu spesies. Ada beberapa jenis utama sistem perkawinan, termasuk monogami (satu jantan berpasangan dengan satu betina), poligami (satu individu berpasangan dengan beberapa individu dari jenis kelamin lain, yang dapat berupa poligini - satu jantan dengan banyak betina, atau poliandri - satu betina dengan banyak jantan), dan promiskuitas (banyak jantan berpasangan dengan banyak betina tanpa ikatan yang tahan lama). Faktor-faktor yang mempengaruhi evolusi sistem perkawinan meliputi ketersediaan sumber daya, kebutuhan dan tingkat perawatan anak, rasio jenis kelamin dalam populasi, dan risiko predasi."
                ],
                "intent": "sistem_perkawinan_hewan"
              }
            ]
          },
          "Dasar-Dasar Neurobiologi": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi neurobiologi secara mendalam dan cakupan studinya",
                  "uraikan pengertian neurobiologi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "neurobiologi",
                  "ilmu saraf",
                  "sistem saraf",
                  "struktur",
                  "fungsi",
                  "perkembangan",
                  "evolusi",
                  "patologi"
                ],
                "responses": [
                  "Neurobiologi, atau ilmu saraf, secara mendalam didefinisikan sebagai studi ilmiah tentang sistem saraf. Ini adalah bidang interdisipliner yang menggabungkan biologi, fisiologi, farmakologi, biokimia, dan ilmu komputer untuk memahami struktur, fungsi, perkembangan, evolusi, dan patologi sistem saraf. Neurobiolog mempelajari neuron (sel saraf), sinapsis (hubungan antar neuron), jaringan saraf, dan bagaimana sistem ini memproses informasi, menghasilkan perilaku, dan mendasari kesadaran."
                ],
                "intent": "definisi_neurobiologi"
              },
              {
                "patterns": [
                  "uraikan secara rinci struktur neuron dan bagaimana impuls saraf dihantarkan",
                  "jelaskan struktur dan fungsi neuron"
                ],
                "keywords": [
                  "struktur neuron",
                  "badan sel",
                  "dendrit",
                  "akson",
                  "selubung mielin",
                  "nodus ranvier",
                  "terminal akson",
                  "potensial aksi",
                  "sinyal listrik",
                  "neurotransmiter"
                ],
                "responses": [
                  "Neuron adalah unit fungsional dasar sistem saraf, yang terspesialisasi untuk menghantarkan informasi dalam bentuk impuls saraf. Secara struktural, neuron terdiri dari badan sel (soma) yang mengandung inti dan organel sel lainnya, dendrit (cabang-cabang yang menerima sinyal dari neuron lain), dan akson (perpanjangan tunggal yang menghantarkan sinyal ke neuron lain atau sel efektor). Akson seringkali dilapisi oleh selubung mielin (insulator yang mempercepat penghantaran impuls) dengan celah-celah yang disebut nodus Ranvier. Impuls saraf (potensial aksi) adalah sinyal listrik yang bergerak sepanjang akson. Di terminal akson, sinyal listrik diubah menjadi sinyal kimia berupa pelepasan neurotransmiter ke sinapsis, yang kemudian berikatan dengan reseptor di neuron target, melanjutkan atau menghambat sinyal."
                ],
                "intent": "struktur_fungsi_neuron"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif peran neurotransmiter dalam komunikasi antar neuron",
                  "uraikan fungsi neurotransmiter"
                ],
                "keywords": [
                  "neurotransmiter",
                  "sinapsis",
                  "vesikel sinaptik",
                  "reseptor",
                  "eksitatori",
                  "inhibitori",
                  "asetilkolin",
                  "dopamin",
                  "serotonin"
                ],
                "responses": [
                  "Neurotransmiter adalah molekul kimia yang dilepaskan dari terminal akson neuron presinaptik ke dalam celah sinaptik (ruang antara dua neuron) dan berikatan dengan reseptor di membran neuron postsinaptik, sehingga mentransmisikan sinyal antar neuron. Neurotransmiter disimpan dalam vesikel sinaptik di terminal akson dan dilepaskan sebagai respons terhadap potensial aksi yang mencapai terminal. Ada berbagai jenis neurotransmiter, yang masing-masing memiliki efek spesifik pada neuron postsinaptik. Beberapa neurotransmiter bersifat eksitatori (meningkatkan kemungkinan neuron postsinaptik menghasilkan potensial aksi), sementara yang lain bersifat inhibitori (menurunkan kemungkinan tersebut). Contoh neurotransmiter penting termasuk asetilkolin (terlibat dalam kontraksi otot dan memori), dopamin (terkait dengan penghargaan dan gerakan), dan serotonin (berperan dalam suasana hati dan tidur). Keseimbangan dan fungsi neurotransmiter yang tepat sangat penting untuk fungsi normal sistem saraf."
                ],
                "intent": "fungsi_neurotransmiter"
              }
            ]
          },
          "Imunologi Dasar": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi imunologi secara mendalam dan cakupan studinya",
                  "uraikan pengertian imunologi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "imunologi",
                  "sistem kekebalan",
                  "perlindungan",
                  "patogen",
                  "respon imun",
                  "kekebalan bawaan",
                  "kekebalan adaptif"
                ],
                "responses": [
                  "Imunologi secara mendalam didefinisikan sebagai studi tentang sistem kekebalan tubuh, yang merupakan jaringan kompleks sel, jaringan, dan organ yang bekerja sama untuk melindungi tubuh dari serangan patogen (seperti bakteri, virus, fungi, dan parasit) serta zat asing berbahaya lainnya. Imunolog mempelajari bagaimana sistem kekebalan mengenali dan merespons ancaman ini, serta bagaimana kegagalan atau disregulasi sistem kekebalan dapat menyebabkan penyakit. Cakupan studi imunologi meliputi mekanisme kekebalan bawaan (respon cepat dan non-spesifik) dan kekebalan adaptif (respon lambat dan spesifik yang menghasilkan memori imunologis)."
                ],
                "intent": "definisi_imunologi"
              },
              {
                "patterns": [
                  "uraikan secara rinci perbedaan antara kekebalan bawaan dan kekebalan adaptif",
                  "jelaskan jenis-jenis kekebalan"
                ],
                "keywords": [
                  "kekebalan bawaan",
                  "kekebalan adaptif",
                  "non-spesifik",
                  "spesifik",
                  "respon cepat",
                  "respon lambat",
                  "memori imunologis",
                  "fagosit",
                  "sel NK",
                  "limfosit T",
                  "limfosit B",
                  "antibodi"
                ],
                "responses": [
                  "Kekebalan bawaan (innate immunity) adalah garis pertahanan pertama tubuh terhadap infeksi. Responnya cepat dan non-spesifik, artinya ia menyerang berbagai jenis patogen tanpa memandang identitas spesifiknya. Komponen utama kekebalan bawaan meliputi penghalang fisik (kulit, mukosa), sel-sel fagosit (seperti makrofag dan neutrofil yang menelan dan menghancurkan patogen), sel NK (natural killer cells) yang membunuh sel yang terinfeksi virus atau sel kanker, dan protein antimikroba. Kekebalan adaptif (adaptive immunity), atau kekebalan yang didapat, berkembang sebagai respons terhadap paparan patogen spesifik dan menghasilkan memori imunologis, yang memungkinkan respon yang lebih cepat dan lebih kuat pada paparan berikutnya dengan patogen yang sama. Komponen utama kekebalan adaptif adalah limfosit T (yang membunuh sel yang terinfeksi atau membantu mengaktifkan sel imun lain) dan limfosit B (yang menghasilkan antibodi, protein yang secara spesifik menargetkan dan menetralkan patogen)."
                ],
                "intent": "perbedaan_kekebalan_bawaan_adaptif"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif peran antibodi dalam respon imun adaptif",
                  "uraikan fungsi antibodi"
                ],
                "keywords": [
                  "antibodi",
                  "imunoglobulin",
                  "limfosit B",
                  "antigen",
                  "netralisasi",
                  "opsonisasi",
                  "aktivasi komplemen",
                  "struktur antibodi"
                ],
                "responses": [
                  "Antibodi, juga dikenal sebagai imunoglobulin (Ig), adalah protein yang dihasilkan oleh limfosit B sebagai bagian dari respon imun adaptif. Antibodi secara spesifik mengenali dan berikatan dengan antigen, yaitu molekul yang dianggap asing oleh tubuh (seringkali bagian dari patogen). Peran utama antibodi dalam respon imun meliputi: netralisasi (antibodi mengikat patogen atau toksin, mencegahnya menginfeksi sel atau menyebabkan kerusakan); opsonisasi (antibodi melapisi patogen, meningkatkan fagositosis oleh sel-sel fagosit); dan aktivasi komplemen (antibodi yang berikatan dengan antigen dapat mengaktifkan sistem komplemen, serangkaian protein yang dapat melisis patogen atau meningkatkan inflamasi). Struktur dasar antibodi berbentuk Y, terdiri dari dua rantai berat dan dua rantai ringan, dengan wilayah variabel di ujung lengan Y yang bertanggung jawab atas pengikatan antigen yang spesifik. Ada beberapa kelas antibodi (IgG, IgM, IgA, IgD, IgE) yang masing-masing memiliki fungsi yang berbeda dalam respon imun."
                ],
                "intent": "fungsi_antibodi"
              }
            ]
          },
          "Genetika Populasi": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi genetika populasi secara mendalam dan fokus studinya",
                  "uraikan pengertian genetika populasi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "genetika populasi",
                  "variasi genetik",
                  "populasi",
                  "frekuensi alel",
                  "frekuensi genotip",
                  "evolusi mikro",
                  "hukum hardy-weinberg"
                ],
                "responses": [
                  "Genetika populasi secara mendalam didefinisikan sebagai cabang genetika yang mempelajari variasi genetik dalam populasi organisme dan bagaimana frekuensi gen dan genotip berubah dari generasi ke generasi. Fokus utama studi ini adalah untuk memahami mekanisme evolusi mikro, yaitu perubahan evolusioner dalam skala kecil dalam suatu populasi. Genetika populasi menganalisis faktor-faktor seperti seleksi alam, hanyutan genetik (genetic drift), aliran gen (gene flow), dan mutasi yang dapat mempengaruhi komposisi genetik suatu populasi."
                ],
                "intent": "definisi_genetika_populasi"
              },
              {
                "patterns": [
                  "uraikan secara rinci prinsip Hukum Hardy-Weinberg dan kondisi yang harus dipenuhi",
                  "jelaskan Hukum Hardy-Weinberg"
                ],
                "keywords": [
                  "Hukum Hardy-Weinberg",
                  "kesetimbangan genetik",
                  "frekuensi alel",
                  "frekuensi genotip",
                  "tidak ada seleksi",
                  "tidak ada mutasi",
                  "tidak ada migrasi",
                  "perkawinan acak",
                  "populasi besar"
                ],
                "responses": [
                  "Hukum Hardy-Weinberg adalah prinsip dasar dalam genetika populasi yang menyatakan bahwa frekuensi alel dan genotip dalam suatu populasi akan tetap konstan dari generasi ke generasi jika tidak ada pengaruh evolusioner yang bekerja pada populasi tersebut. Kesetimbangan Hardy-Weinberg menyediakan model dasar untuk membandingkan populasi nyata dan mendeteksi perubahan genetik. Hukum ini berlaku jika lima kondisi berikut dipenuhi: tidak ada seleksi alam (semua genotip memiliki tingkat kelangsungan hidup dan reproduksi yang sama), tidak ada mutasi (tidak ada alel baru yang muncul atau berubah), tidak ada migrasi (tidak ada aliran gen masuk atau keluar dari populasi), perkawinan acak (individu berpasangan tanpa preferensi genotipik), dan ukuran populasi yang besar (untuk meminimalkan efek hanyutan genetik). Jika salah satu dari kondisi ini dilanggar, maka frekuensi alel dan genotip dalam populasi dapat berubah, yang mengindikasikan terjadinya evolusi."
                ],
                "intent": "hukum_hardy_weinberg"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif konsep hanyutan genetik (genetic drift) dan faktor-faktor yang mempengaruhinya",
                  "uraikan pengertian hanyutan genetik"
                ],
                "keywords": [
                  "hanyutan genetik",
                  "genetic drift",
                  "perubahan acak",
                  "frekuensi alel",
                  "populasi kecil",
                  "efek pendiri",
                  "bottleneck genetik"
                ],
                "responses": [
                  "Hanyutan genetik (genetic drift) adalah perubahan acak dalam frekuensi alel dari generasi ke generasi dalam suatu populasi, yang terutama signifikan dalam populasi kecil. Tidak seperti seleksi alam yang arah perubahannya dapat diprediksi berdasarkan keuntungan adaptif, hanyutan genetik adalah proses stokastik (acak). Efek hanyutan genetik lebih kuat dalam populasi kecil karena fluktuasi acak dalam keberhasilan reproduksi individu dapat menyebabkan perubahan besar dalam frekuensi alel. Dua contoh penting dari hanyutan genetik adalah efek pendiri (founder effect), yang terjadi ketika sekelompok kecil individu memisahkan diri dari populasi yang lebih besar untuk membentuk koloni baru, dan frekuensi alel dalam populasi pendiri mungkin berbeda secara acak dari populasi asalnya; dan bottleneck genetik (genetic bottleneck), yang terjadi ketika populasi mengalami pengurangan ukuran yang drastis (misalnya akibat bencana alam), dan populasi yang pulih mungkin memiliki komposisi genetik yang berbeda dari populasi awal hanya karena kebetulan siapa yang selamat."
                ],
                "intent": "pengertian_hanyutan_genetik"
              }
            ]
          },
          "Paleontologi Dasar": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi paleontologi secara mendalam dan cakupan studinya",
                  "uraikan pengertian paleontologi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "paleontologi",
                  "studi fosil",
                  "sejarah kehidupan",
                  "evolusi",
                  "ekosistem purba",
                  "fosilisasi",
                  "usia bumi"
                ],
                "responses": [
                  "Paleontologi secara mendalam didefinisikan sebagai studi ilmiah tentang kehidupan purba di Bumi berdasarkan catatan fosil. Paleontolog mempelajari fosil tumbuhan, hewan, fungi, bakteri, dan mikroorganisme lainnya yang telah terawetkan dalam batuan dan media lainnya. Cakupan studi paleontologi sangat luas, meliputi rekonstruksi sejarah kehidupan di Bumi, pemahaman tentang proses evolusi dan kepunahan, analisis ekosistem purba dan perubahan lingkungan, serta penentuan usia batuan dan fosil."
                ],
                "intent": "definisi_paleontologi"
              },
              {
                "patterns": [
                  "uraikan secara rinci proses fosilisasi dan berbagai jenis fosil yang dapat ditemukan",
                  "jelaskan proses pembentukan fosil"
                ],
                "keywords": [
                  "fosilisasi",
                  "proses fosil",
                  "mineralisasi",
                  "cetakan",
                  "jejak",
                  "sisa tubuh utuh",
                  "resin",
                  "amber",
                  "permineralisasi"
                ],
                "responses": [
                  "Fosilisasi adalah proses di mana sisa-sisa atau jejak organisme purba terawetkan dalam catatan geologis. Proses ini jarang terjadi karena sebagian besar organisme mati akan terurai. Beberapa jenis fosilisasi meliputi: mineralisasi (di mana mineral dari air tanah mengisi ruang kosong dalam sisa-sisa organisme dan mengeras, membentuk replika batu); cetakan dan jejak (cetakan eksternal atau internal dari tubuh organisme atau jejak aktivitasnya, seperti jejak kaki); sisa tubuh utuh (organisme yang terawetkan dalam kondisi aslinya, misalnya dalam es atau resin); dan permineralisasi (di mana mineral mengendap dalam pori-pori dan rongga jaringan organisme). Jenis fosil yang dapat ditemukan sangat beragam, termasuk tulang, gigi, cangkang, daun, serangga yang terperangkap dalam amber, dan jejak kaki dinosaurus."
                ],
                "intent": "proses_fosilisasi"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif bagaimana paleontolog menentukan usia fosil dan signifikansinya dalam studi evolusi",
                  "uraikan penentuan usia fosil"
                ],
                "keywords": [
                  "penentuan usia fosil",
                  "penanggalan relatif",
                  "penanggalan absolut",
                  "stratigrafi",
                  "isotop radioaktif",
                  "karbon-14",
                  "kalium-argon",
                  "skala waktu geologi",
                  "bukti evolusi"
                ],
                "responses": [
                  "Paleontolog menggunakan berbagai metode untuk menentukan usia fosil. Penanggalan relatif melibatkan penentuan usia fosil berdasarkan posisinya dalam lapisan batuan (stratigrafi). Lapisan batuan yang lebih rendah umumnya lebih tua daripada lapisan di atasnya. Penanggalan absolut menggunakan metode radiometrik, yang mengukur peluruhan isotop radioaktif dalam batuan atau fosil itu sendiri. Metode umum termasuk penanggalan karbon-14 (untuk fosil yang lebih muda, hingga sekitar 50.000 tahun) dan penanggalan kalium-argon (untuk batuan yang lebih tua). Penentuan usia fosil sangat signifikan dalam studi evolusi karena memungkinkan para ilmuwan untuk menyusun urutan kemunculan dan kepunahan berbagai spesies sepanjang sejarah Bumi, memberikan bukti kuat untuk perubahan evolusioner dari waktu ke waktu dan membantu merekonstruksi garis keturunan evolusi."
                ],
                "intent": "usia_fosil"
              }
            ]
          },
          "Dasar-Dasar Virologi": {
            "QnA": [
              {
                "patterns": [
                  "jelaskan definisi virologi secara mendalam dan fokus studinya",
                  "uraikan pengertian virologi"
                ],
                "keywords": [
                  "definisi",
                  "pengertian",
                  "virologi",
                  "studi virus",
                  "struktur virus",
                  "klasifikasi virus",
                  "replikasi virus",
                  "interaksi inang-virus",
                  "penyakit virus"
                ],
                "responses": [
                  "Virologi secara mendalam didefinisikan sebagai cabang biologi yang mempelajari virus - partikel mikroskopis dan submikroskopis seperti agen infeksi yang hanya dapat bereplikasi di dalam sel hidup organisme lain. Fokus utama virologi meliputi struktur virus, klasifikasi dan evolusi virus, mekanisme replikasi virus di dalam sel inang, interaksi antara virus dan sel inang, penyakit yang disebabkan oleh virus, serta pengembangan vaksin dan terapi antivirus."
                ],
                "intent": "definisi_virologi"
              },
              {
                "patterns": [
                  "uraikan secara rinci struktur dasar virus dan komponen utamanya",
                  "jelaskan struktur virus"
                ],
                "keywords": [
                  "struktur virus",
                  "genom virus",
                  "DNA",
                  "RNA",
                  "kapsid",
                  "protein pelindung",
                  "amplop virus",
                  "glikoprotein",
                  "ukuran virus",
                  "bentuk virus"
                ],
                "responses": [
                  "Struktur dasar virus sangat sederhana dibandingkan dengan sel. Virus terdiri dari materi genetik (genom virus) yang dapat berupa DNA atau RNA, yang dikelilingi oleh lapisan protein pelindung yang disebut kapsid. Beberapa virus juga memiliki lapisan luar yang disebut amplop virus, yang berasal dari membran sel inang dan mengandung glikoprotein yang membantu dalam infeksi sel baru. Ukuran dan bentuk virus sangat bervariasi, mulai dari yang sangat kecil (beberapa puluh nanometer) hingga yang relatif besar (beberapa ratus nanometer). Bentuk virus juga beragam, termasuk heliks, ikosahedral, dan kompleks."
                ],
                "intent": "struktur_virus"
              },
              {
                "patterns": [
                  "jelaskan secara komprehensif siklus replikasi virus dalam sel inang",
                  "uraikan replikasi virus"
                ],
                "keywords": [
                  "replikasi virus",
                  "adsorpsi",
                  "penetrasi",
                  "pelepasan mantel",
                  "replikasi genom",
                  "sintesis protein virus",
                  "perakitan virus",
                  "pelepasan virus",
                  "siklus litik",
                  "siklus lisogenik"
                ],
                "responses": [
                  "Siklus replikasi virus adalah proses di mana virus memperbanyak diri di dalam sel inang. Proses ini umumnya melibatkan beberapa tahap: adsorpsi (virus melekat pada reseptor spesifik di permukaan sel inang); penetrasi (virus masuk ke dalam sel inang, baik dengan fusi membran atau endositosis); pelepasan mantel (jika ada, kapsid virus dipecah dan genom virus dilepaskan ke dalam sitoplasma); replikasi genom (virus menggunakan mesin replikasi sel inang untuk membuat salinan genom virusnya); sintesis protein virus (genom virus digunakan untuk membuat protein virus, seperti protein kapsid dan enzim yang dibutuhkan untuk replikasi); perakitan virus (komponen-komponen virus baru dirakit menjadi partikel virus yang matang); dan pelepasan virus (virus baru keluar dari sel inang, yang dapat terjadi melalui lisis sel (menyebabkan kematian sel) atau budding (virus keluar secara perlahan tanpa menghancurkan sel). Beberapa virus juga dapat menjalani siklus lisogenik, di mana genom virus berintegrasi ke dalam genom sel inang dan direplikasi bersama dengan DNA inang tanpa segera menghasilkan virus baru."
                ],
                "intent": "replikasi_virus"
              }
            ]
          },
          "Struktur Sel": {
            "QnA": [
              {
                "patterns": [
                  "apa pengertian sel?",
                  "definisi sel"
                ],
                "keywords": [
                  "pengertian",
                  "definisi"
                ],
                "context_keywords": [
                  "dasar",
                  "teori"
                ],
                "responses": [
                  "Sel adalah unit terkecil penyusun makhluk hidup."
                ],
                "intent": "pengertian_sel",
                "priority": 1
              },
              {
                "patterns": [
                  "organel sel apa saja?",
                  "bagian-bagian sel"
                ],
                "keywords": [
                  "organel",
                  "bagian",
                  "nukleus"
                ],
                "responses": [
                  "Organel sel: nukleus, mitokondria, ribosom, retikulum endoplasma, badan Golgi, lisosom, vakuola, dan kloroplas (pada sel tumbuhan)."
                ],
                "intent": "organel_sel"
              }
            ]
          },
          "Fungsi Sel": {
            "QnA": [
              {
                "patterns": [
                  "apa fungsi membran sel?",
                  "peran membran sel"
                ],
                "keywords": [
                  "fungsi",
                  "membran",
                  "peran",
                  "sel"
                ],
                "responses": [
                  "Membran sel berfungsi melindungi sel dan mengatur keluar masuknya zat."
                ],
                "intent": "fungsi_membran_sel"
              },
              {
                "patterns": [
                  "apa fungsi mitokondria?",
                  "mitokondria untuk apa"
                ],
                "keywords": [
                  "fungsi",
                  "mitokondria",
                  "energi"
                ],
                "responses": [
                  "Mitokondria berfungsi sebagai 'pembangkit tenaga' sel, menghasilkan energi melalui respirasi sel."
                ],
                "intent": "fungsi_mitokondria"
              }
            ]
          },
          "Adaptasi Makhluk Hidup": {
            "QnA": [
              {
                "patterns": [
                  "apa itu adaptasi?",
                  "pengertian adaptasi"
                ],
                "keywords": [
                  "pengertian",
                  "adaptasi",
                  "lingkungan",
                  "survival"
                ],
                "responses": [
                  "Adaptasi adalah kemampuan makhluk hidup untuk menyesuaikan diri dengan lingkungannya agar dapat bertahan hidup."
                ],
                "intent": "pengertian_adaptasi"
              },
              {
                "patterns": [
                  "sebutkan jenis-jenis adaptasi?",
                  "macam adaptasi"
                ],
                "keywords": [
                  "jenis",
                  "adaptasi",
                  "morfologi",
                  "fisiologi",
                  "tingkah laku"
                ],
                "responses": [
                  "Terdapat tiga jenis utama adaptasi: adaptasi morfologi (bentuk tubuh), adaptasi fisiologi (fungsi tubuh), dan adaptasi tingkah laku (perilaku)."
                ],
                "intent": "jenis_adaptasi"
              }
            ]
          },
          "Keanekaragaman Hayati": {
            "QnA": [
              {
                "patterns": [
                  "apa itu keanekaragaman hayati?",
                  "tingkat biodiversitas"
                ],
                "keywords": [
                  "pengertian",
                  "keanekaragaman hayati",
                  "biodiversitas",
                  "genetik",
                  "spesies",
                  "ekosistem"
                ],
                "responses": [
                  "Keanekaragaman hayati adalah keseluruhan variasi gen, spesies, dan ekosistem di suatu wilayah."
                ],
                "intent": "pengertian_keanekaragaman_hayati"
              },
              {
                "patterns": [
                  "mengapa keanekaragaman hayati penting?",
                  "manfaat biodiversitas"
                ],
                "keywords": [
                  "penting",
                  "manfaat",
                  "keanekaragaman hayati",
                  "keseimbangan",
                  "sumber daya"
                ],
                "responses": [
                  "Keanekaragaman hayati penting untuk menjaga keseimbangan ekosistem, menyediakan sumber daya alam, dan potensi obat-obatan."
                ],
                "intent": "pentingnya_keanekaragaman_hayati"
              }
            ]
          },
          "Pencemaran Lingkungan": {
            "QnA": [
              {
                "patterns": [
                  "apa itu pencemaran?",
                  "definisi polusi"
                ],
                "keywords": [
                  "pengertian",
                  "pencemaran",
                  "polusi",
                  "lingkungan",
                  "zat"
                ],
                "responses": [
                  "Pencemaran adalah masuknya atau dimasukkannya zat atau energi ke dalam lingkungan yang dapat menurunkan kualitasnya."
                ],
                "intent": "pengertian_pencemaran"
              },
              {
                "patterns": [
                  "sebutkan jenis-jenis pencemaran?",
                  "macam polusi"
                ],
                "keywords": [
                  "jenis",
                  "pencemaran",
                  "air",
                  "udara",
                  "tanah",
                  "suara"
                ],
                "responses": [
                  "Jenis-jenis pencemaran meliputi pencemaran air, pencemaran udara, pencemaran tanah, dan pencemaran suara."
                ],
                "intent": "jenis_pencemaran"
              }
            ]
          },
          "Daur Biogeokimia": {
            "QnA": [
              {
                "patterns": [
                  "apa itu daur biogeokimia?",
                  "siklus materi"
                ],
                "keywords": [
                  "pengertian",
                  "daur biogeokimia",
                  "siklus",
                  "materi",
                  "ekosistem"
                ],
                "responses": [
                  "Daur biogeokimia adalah siklus materi atau unsur kimia yang bergerak melalui komponen biotik dan abiotik dalam ekosistem."
                ],
                "intent": "pengertian_daur_biogeokimia"
              },
              {
                "patterns": [
                  "contoh daur biogeokimia?",
                  "siklus materi penting"
                ],
                "keywords": [
                  "contoh",
                  "daur",
                  "air",
                  "karbon",
                  "nitrogen",
                  "fosfor"
                ],
                "responses": [
                  "Contoh daur biogeokimia yang penting adalah daur air, daur karbon, daur nitrogen, dan daur fosfor."
                ],
                "intent": "contoh_daur_biogeokimia"
              }
            ]
          },
          "Bioteknologi": {
            "QnA": [
              {
                "patterns": [
                  "apa itu bioteknologi?",
                  "definisi bioteknologi"
                ],
                "keywords": [
                  "pengertian",
                  "bioteknologi",
                  "organisme",
                  "aplikasi"
                ],
                "responses": [
                  "Bioteknologi adalah cabang ilmu biologi yang memanfaatkan organisme hidup atau bagiannya untuk menghasilkan produk atau jasa yang bermanfaat."
                ],
                "intent": "pengertian_bioteknologi"
              },
              {
                "patterns": [
                  "contoh aplikasi bioteknologi?",
                  "penerapan bioteknologi"
                ],
                "keywords": [
                  "contoh",
                  "aplikasi",
                  "bioteknologi",
                  "fermentasi",
                  "rekayasa genetika"
                ],
                "responses": [
                  "Contoh aplikasi bioteknologi adalah pembuatan tempe dan yogurt melalui fermentasi, serta rekayasa genetika pada tanaman."
                ],
                "intent": "contoh_bioteknologi"
              }
            ]
          },
          "Virus": {
            "QnA": [
              {
                "patterns": [
                  "apa itu virus?",
                  "ciri-ciri virus"
                ],
                "keywords": [
                  "pengertian",
                  "virus",
                  "mikroorganisme",
                  "parasit"
                ],
                "responses": [
                  "Virus adalah mikroorganisme aseluler yang bersifat parasit obligat dan hanya dapat bereplikasi di dalam sel hidup."
                ],
                "intent": "pengertian_virus"
              },
              {
                "patterns": [
                  "bagaimana virus berkembang biak?",
                  "replikasi virus"
                ],
                "keywords": [
                  "cara",
                  "berkembang biak",
                  "replikasi",
                  "virus",
                  "sel inang"
                ],
                "responses": [
                  "Virus berkembang biak dengan cara menginfeksi sel inang dan menggunakan mesin sel tersebut untuk mereplikasi materi genetik dan proteinnya."
                ],
                "intent": "reproduksi_virus"
              }
            ]
          },
          "Bakteri": {
            "QnA": [
              {
                "patterns": [
                  "apa itu bakteri?",
                  "ciri-ciri bakteri"
                ],
                "keywords": [
                  "pengertian",
                  "bakteri",
                  "prokariotik",
                  "uniseluler"
                ],
                "responses": [
                  "Bakteri adalah mikroorganisme prokariotik uniseluler yang tidak memiliki membran inti dan organel bermembran."
                ],
                "intent": "pengertian_bakteri"
              },
              {
                "patterns": [
                  "apa peran bakteri?",
                  "fungsi bakteri"
                ],
                "keywords": [
                  "peran",
                  "fungsi",
                  "bakteri",
                  "dekomposer",
                  "nitrogen",
                  "penyakit"
                ],
                "responses": [
                  "Bakteri memiliki berbagai peran penting, seperti sebagai dekomposer, dalam siklus nitrogen, dan beberapa jenis dapat menyebabkan penyakit."
                ],
                "intent": "peran_bakteri"
              }
            ]
          },
          "Protista": {
            "QnA": [
              {
                "patterns": [
                  "apa itu protista?",
                  "ciri-ciri protista"
                ],
                "keywords": [
                  "pengertian",
                  "protista",
                  "eukariotik",
                  "uniseluler",
                  "multiseluler"
                ],
                "responses": [
                  "Protista adalah kelompok organisme eukariotik yang sebagian besar uniseluler, tetapi ada juga yang multiseluler sederhana."
                ],
                "intent": "pengertian_protista"
              },
              {
                "patterns": [
                  "sebutkan contoh protista?",
                  "jenis-jenis protista"
                ],
                "keywords": [
                  "contoh",
                  "protista",
                  "alga",
                  "protozoa"
                ],
                "responses": [
                  "Contoh protista adalah alga (mirip tumbuhan) dan protozoa (mirip hewan)."
                ],
                "intent": "contoh_protista"
              }
            ]
          },
          "Fungi (Jamur)": {
            "QnA": [
              {
                "patterns": [
                  "apa itu fungi?",
                  "ciri-ciri jamur"
                ],
                "keywords": [
                  "pengertian",
                  "fungi",
                  "jamur",
                  "eukariotik",
                  "heterotrof"
                ],
                "responses": [
                  "Fungi atau jamur adalah organisme eukariotik heterotrof yang memperoleh nutrisi dengan cara menyerap zat organik dari lingkungannya."
                ],
                "intent": "pengertian_fungi"
              },
              {
                "patterns": [
                  "sebutkan contoh fungi?",
                  "jenis-jenis jamur"
                ],
                "keywords": [
                  "contoh",
                  "fungi",
                  "ragi",
                  "kapang",
                  "jamur pangan"
                ],
                "responses": [
                  "Contoh fungi adalah ragi, kapang, dan jamur pangan seperti jamur merang dan jamur tiram."
                ],
                "intent": "contoh_fungi"
              }
            ]
          },
          "Tumbuhan (Plantae)": {
            "QnA": [
              {
                "patterns": [
                  "apa ciri-ciri tumbuhan?",
                  "karakteristik tumbuhan"
                ],
                "keywords": [
                  "ciri",
                  "tumbuhan",
                  "plantae",
                  "autotrof",
                  "fotosintesis"
                ],
                "responses": [
                  "Tumbuhan adalah organisme eukariotik multiseluler yang umumnya autotrof karena memiliki klorofil dan melakukan fotosintesis."
                ],
                "intent": "ciri_tumbuhan"
              },
              {
                "patterns": [
                  "sebutkan kelompok utama tumbuhan?",
                  "klasifikasi tumbuhan"
                ],
                "keywords": [
                  "kelompok",
                  "tumbuhan",
                  "lumut",
                  "paku",
                  "berbiji"
                ],
                "responses": [
                  "Kelompok utama tumbuhan meliputi lumut (Bryophyta), tumbuhan paku (Pteridophyta), dan tumbuhan berbiji (Spermatophyta)."
                ],
                "intent": "kelompok_tumbuhan"
              }
            ]
          },
          "Reproduksi pada Tumbuhan": {
            "QnA": [
              {
                "patterns": [
                  "apa itu penyerbukan?",
                  "pengertian polinasi"
                ],
                "keywords": [
                  "pengertian",
                  "penyerbukan",
                  "polinasi",
                  "serbuk sari",
                  "putik"
                ],
                "responses": [
                  "Penyerbukan atau polinasi adalah proses jatuhnya serbuk sari ke kepala putik."
                ],
                "intent": "pengertian_penyerbukan"
              },
              {
                "patterns": [
                  "apa saja jenis-jenis penyerbukan?",
                  "macam-macam polinasi"
                ],
                "keywords": [
                  "jenis",
                  "penyerbukan",
                  "sendiri",
                  "silang",
                  "tetangga",
                  "bastard"
                ],
                "responses": [
                  "Jenis-jenis penyerbukan meliputi penyerbukan sendiri (autogami), penyerbukan silang (alogami), penyerbukan tetangga (geitonogami), dan penyerbukan bastard (hibridisasi)."
                ],
                "intent": "jenis_penyerbukan"
              },
              {
                "patterns": [
                  "apa itu pembuahan pada tumbuhan?",
                  "fertilisasi tumbuhan"
                ],
                "keywords": [
                  "pengertian",
                  "pembuahan",
                  "fertilisasi",
                  "peleburan",
                  "gamet"
                ],
                "responses": [
                  "Pembuahan pada tumbuhan adalah proses peleburan antara gamet jantan (inti sperma dari serbuk sari) dengan gamet betina (sel telur di dalam bakal biji) membentuk zigot."
                ],
                "intent": "pengertian_pembuahan_tumbuhan"
              }
            ]
          },
          "Pertumbuhan dan Perkembangan Tumbuhan": {
            "QnA": [
              {
                "patterns": [
                  "apa perbedaan pertumbuhan dan perkembangan tumbuhan?",
                  "definisi pertumbuhan perkembangan"
                ],
                "keywords": [
                  "perbedaan",
                  "pertumbuhan",
                  "perkembangan",
                  "ukuran",
                  "fungsi"
                ],
                "responses": [
                  "Pertumbuhan adalah proses pertambahan ukuran (volume, tinggi, massa) yang bersifat kuantitatif dan irreversible. Perkembangan adalah proses pematangan fungsi organ dan diferensiasi sel yang bersifat kualitatif."
                ],
                "intent": "perbedaan_pertumbuhan_perkembangan_tumbuhan"
              },
              {
                "patterns": [
                  "apa saja faktor yang mempengaruhi pertumbuhan tumbuhan?",
                  "faktor pertumbuhan tanaman"
                ],
                "keywords": [
                  "faktor",
                  "pertumbuhan",
                  "cahaya",
                  "air",
                  "nutrisi",
                  "hormon"
                ],
                "responses": [
                  "Faktor-faktor yang mempengaruhi pertumbuhan tumbuhan antara lain cahaya, air, nutrisi (unsur hara), suhu, dan hormon tumbuhan (auksin, giberelin, sitokinin, dll)."
                ],
                "intent": "faktor_pertumbuhan_tumbuhan"
              },
              {
                "patterns": [
                  "apa itu hormon auksin?",
                  "fungsi hormon auksin"
                ],
                "keywords": [
                  "pengertian",
                  "fungsi",
                  "hormon",
                  "auksin",
                  "pemanjangan",
                  "dominansi apikal"
                ],
                "responses": [
                  "Hormon auksin adalah salah satu hormon tumbuhan yang berperan dalam pemanjangan sel, pertumbuhan akar, dominansi apikal (penghambatan pertumbuhan tunas lateral), dan pembentukan buah."
                ],
                "intent": "fungsi_hormon_auksin"
              }
            ]
          },
          "Sistem Gerak pada Hewan": {
            "QnA": [
              {
                "patterns": [
                  "apa saja alat gerak hewan?",
                  "organ gerak hewan"
                ],
                "keywords": [
                  "alat gerak",
                  "organ",
                  "hewan",
                  "kaki",
                  "sayap",
                  "sirip",
                  "otot"
                ],
                "responses": [
                  "Alat gerak pada hewan bervariasi tergantung jenis dan habitatnya, meliputi kaki, sayap, sirip, otot perut, dan lain-lain."
                ],
                "intent": "alat_gerak_hewan"
              },
              {
                "patterns": [
                  "apa perbedaan rangka dalam dan rangka luar?",
                  "jenis rangka hewan"
                ],
                "keywords": [
                  "perbedaan",
                  "rangka",
                  "dalam",
                  "luar",
                  "endoskeleton",
                  "eksoskeleton"
                ],
                "responses": [
                  "Rangka dalam (endoskeleton) terletak di dalam tubuh, contohnya pada vertebrata. Rangka luar (eksoskeleton) terletak di luar tubuh, contohnya pada serangga dan krustasea."
                ],
                "intent": "perbedaan_rangka_hewan"
              },
              {
                "patterns": [
                  "bagaimana otot bekerja dalam pergerakan?",
                  "mekanisme gerak otot"
                ],
                "keywords": [
                  "otot",
                  "kontraksi",
                  "relaksasi",
                  "sinergis",
                  "antagonis"
                ],
                "responses": [
                  "Otot bekerja dalam pergerakan melalui kontraksi (memendek) dan relaksasi (memanjang). Gerak seringkali melibatkan kerja sama antara otot yang sinergis (bekerja sama) dan antagonis (bekerja berlawanan)."
                ],
                "intent": "mekanisme_gerak_otot"
              }
            ]
          },
          "Sistem Koordinasi pada Hewan": {
            "QnA": [
              {
                "patterns": [
                  "apa itu sistem koordinasi?",
                  "pengertian koordinasi"
                ],
                "keywords": [
                  "pengertian",
                  "sistem koordinasi",
                  "saraf",
                  "hormon",
                  "respon"
                ],
                "responses": [
                  "Sistem koordinasi adalah sistem yang mengatur dan mengintegrasikan berbagai fungsi tubuh agar dapat merespon rangsangan dari lingkungan secara tepat."
                ],
                "intent": "pengertian_sistem_koordinasi"
              },
              {
                "patterns": [
                  "apa saja komponen sistem saraf?",
                  "bagian sistem saraf"
                ],
                "keywords": [
                  "komponen",
                  "sistem saraf",
                  "neuron",
                  "otak",
                  "sumsum tulang belakang"
                ],
                "responses": [
                  "Komponen utama sistem saraf adalah neuron (sel saraf), otak, dan sumsum tulang belakang."
                ],
                "intent": "komponen_sistem_saraf"
              },
              {
                "patterns": [
                  "apa fungsi hormon pada hewan?",
                  "peran hormon hewan"
                ],
                "keywords": [
                  "fungsi",
                  "hormon",
                  "hewan",
                  "regulasi",
                  "pertumbuhan",
                  "reproduksi"
                ],
                "responses": [
                  "Hormon adalah senyawa kimia yang dihasilkan oleh kelenjar endokrin dan berfungsi mengatur berbagai proses dalam tubuh hewan, seperti pertumbuhan, metabolisme, dan reproduksi."
                ],
                "intent": "fungsi_hormon_hewan"
              }
            ]
          },
          "Pola Hereditas (Pewarisan Sifat)": {
            "QnA": [
              {
                "patterns": [
                  "apa itu gen?",
                  "peran gen dalam pewarisan"
                ],
                "keywords": [
                  "pengertian",
                  "gen",
                  "DNA",
                  "kromosom",
                  "sifat",
                  "warisan"
                ],
                "responses": [
                  "Gen adalah unit informasi genetik yang terdapat dalam DNA di dalam kromosom dan menentukan sifat-sifat yang diwariskan."
                ],
                "intent": "pengertian_gen"
              },
              {
                "patterns": [
                  "apa perbedaan genotip dan fenotip?",
                  "istilah dalam pewarisan sifat"
                ],
                "keywords": [
                  "perbedaan",
                  "genotip",
                  "fenotip",
                  "alel",
                  "ekspresi"
                ],
                "responses": [
                  "Genotip adalah susunan genetik (alel) yang dimiliki individu. Fenotip adalah karakteristik atau sifat yang tampak pada individu sebagai hasil ekspresi genotip dan pengaruh lingkungan."
                ],
                "intent": "perbedaan_genotip_fenotip"
              },
              {
                "patterns": [
                  "apa itu hukum mendel?",
                  "prinsip pewarisan sifat"
                ],
                "keywords": [
                  "hukum mendel",
                  "segregasi",
                  "berpasangan bebas",
                  "pewarisan"
                ],
                "responses": [
                  "Hukum Mendel adalah dua prinsip dasar pewarisan sifat, yaitu Hukum Segregasi (pemisahan alel saat pembentukan gamet) dan Hukum Berpasangan Bebas (alel dari gen yang berbeda berpisah secara bebas saat pembentukan gamet)."
                ],
                "intent": "hukum_mendel"
              }
            ]
          },
          "Evolusi": {
            "QnA": [
              {
                "patterns": [
                  "apa itu evolusi?",
                  "pengertian teori evolusi"
                ],
                "keywords": [
                  "pengertian",
                  "evolusi",
                  "perubahan",
                  "makhluk hidup",
                  "waktu"
                ],
                "responses": [
                  "Evolusi adalah proses perubahan karakteristik suatu populasi makhluk hidup dari generasi ke generasi dalam kurun waktu yang lama."
                ],
                "intent": "pengertian_evolusi"
              },
              {
                "patterns": [
                  "apa saja bukti-bukti evolusi?",
                  "petunjuk evolusi"
                ],
                "keywords": [
                  "bukti",
                  "evolusi",
                  "fosil",
                  "anatomi perbandingan",
                  "embriologi",
                  "biokimia"
                ],
                "responses": [
                  "Bukti-bukti evolusi antara lain fosil, anatomi perbandingan (homologi dan analogi), embriologi perbandingan, dan perbandingan biokimia."
                ],
                "intent": "bukti_evolusi"
              },
              {
                "patterns": [
                  "apa itu seleksi alam?",
                  "mekanisme evolusi"
                ],
                "keywords": [
                  "seleksi alam",
                  "adaptasi",
                  "survival",
                  "reproduksi",
                  "darwin"
                ],
                "responses": [
                  "Seleksi alam adalah proses di mana individu dengan sifat-sifat yang lebih sesuai dengan lingkungannya memiliki tingkat kelangsungan hidup (survival) dan reproduksi yang lebih tinggi, sehingga sifat-sifat unggul tersebut lebih mungkin diwariskan."
                ],
                "intent": "seleksi_alam"
              }
            ]
          },
          "Reproduksi pada Tanaman": {
            "QnA": [
              {
                "patterns": [
                  "apa itu penyerbukan?",
                  "pengertian polinasi"
                ],
                "keywords": [
                  "pengertian",
                  "penyerbukan",
                  "polinasi",
                  "serbuk sari",
                  "putik"
                ],
                "responses": [
                  "Penyerbukan atau polinasi adalah proses jatuhnya serbuk sari ke kepala putik."
                ],
                "intent": "pengertian_penyerbukan"
              },
              {
                "patterns": [
                  "apa saja jenis-jenis penyerbukan?",
                  "macam-macam polinasi"
                ],
                "keywords": [
                  "jenis",
                  "penyerbukan",
                  "sendiri",
                  "silang",
                  "tetangga",
                  "bastard"
                ],
                "responses": [
                  "Jenis-jenis penyerbukan meliputi penyerbukan sendiri (autogami), penyerbukan silang (alogami), penyerbukan tetangga (geitonogami), dan penyerbukan bastard (hibridisasi)."
                ],
                "intent": "jenis_penyerbukan"
              },
              {
                "patterns": [
                  "apa itu pembuahan pada tumbuhan?",
                  "fertilisasi tumbuhan"
                ],
                "keywords": [
                  "pengertian",
                  "pembuahan",
                  "fertilisasi",
                  "peleburan",
                  "gamet"
                ],
                "responses": [
                  "Pembuahan pada tumbuhan adalah proses peleburan antara gamet jantan (inti sperma dari serbuk sari) dengan gamet betina (sel telur di dalam bakal biji) membentuk zigot."
                ],
                "intent": "pengertian_pembuahan_tumbuhan"
              }
            ]
          },
          "Bioteknologi dan Aplikasinya": {
            "QnA": [
              {
                "patterns": [
                  "sebutkan contoh bioteknologi konvensional?",
                  "bioteknologi tradisional"
                ],
                "keywords": [
                  "contoh",
                  "bioteknologi",
                  "konvensional",
                  "tradisional",
                  "fermentasi",
                  "tempe",
                  "yogurt"
                ],
                "responses": [
                  "Contoh bioteknologi konvensional atau tradisional adalah pembuatan tempe, tape, yogurt, dan keju yang memanfaatkan proses fermentasi mikroorganisme."
                ],
                "intent": "contoh_bioteknologi_konvensional"
              },
              {
                "patterns": [
                  "apa itu rekayasa genetika?",
                  "bioteknologi modern"
                ],
                "keywords": [
                  "pengertian",
                  "rekayasa genetika",
                  "DNA",
                  "gen",
                  "modifikasi"
                ],
                "responses": [
                  "Rekayasa genetika adalah manipulasi materi genetik (DNA) suatu organisme untuk menghasilkan organisme dengan sifat-sifat yang diinginkan."
                ],
                "intent": "pengertian_rekayasa_genetika"
              },
              {
                "patterns": [
                  "apa saja aplikasi bioteknologi dalam pertanian?",
                  "bioteknologi pertanian"
                ],
                "keywords": [
                  "aplikasi",
                  "bioteknologi",
                  "pertanian",
                  "tanaman transgenik",
                  "pestisida",
                  "pupuk"
                ],
                "responses": [
                  "Aplikasi bioteknologi dalam pertanian meliputi pembuatan tanaman transgenik yang tahan hama atau herbisida, produksi biopestisida, dan pembuatan pupuk hayati."
                ],
                "intent": "aplikasi_bioteknologi_pertanian"
              }
            ]
          },
          "Kesehatan dan Penyakit": {
            "QnA": [
              {
                "patterns": [
                  "apa itu penyakit menular?",
                  "infeksi"
                ],
                "keywords": [
                  "pengertian",
                  "penyakit menular",
                  "infeksi",
                  "mikroorganisme",
                  "penularan"
                ],
                "responses": [
                  "Penyakit menular adalah penyakit yang dapat ditularkan dari satu orang ke orang lain melalui berbagai cara, disebabkan oleh mikroorganisme patogen seperti virus, bakteri, dan jamur."
                ],
                "intent": "pengertian_penyakit_menular"
              },
              {
                "patterns": [
                  "bagaimana cara mencegah penyakit menular?",
                  "pencegahan infeksi"
                ],
                "keywords": [
                  "cara",
                  "mencegah",
                  "penyakit menular",
                  "higiene",
                  "vaksinasi",
                  "isolasi"
                ],
                "responses": [
                  "Pencegahan penyakit menular dapat dilakukan dengan menjaga higiene diri dan lingkungan, vaksinasi, menghindari kontak dengan penderita, dan isolasi jika sakit."
                ],
                "intent": "pencegahan_penyakit_menular"
              },
              {
                "patterns": [
                  "apa perbedaan penyakit menular dan tidak menular?",
                  "jenis penyakit"
                ],
                "keywords": [
                  "perbedaan",
                  "penyakit menular",
                  "tidak menular",
                  "penyebab",
                  "penularan"
                ],
                "responses": [
                  "Penyakit menular disebabkan oleh infeksi mikroorganisme dan dapat ditularkan. Penyakit tidak menular disebabkan oleh faktor genetik, gaya hidup, atau lingkungan dan tidak dapat ditularkan."
                ],
                "intent": "perbedaan_penyakit_menular_tidak_menular"
              }
            ]
          },
          "Peran Manusia dalam Ekosistem": {
            "QnA": [
              {
                "patterns": [
                  "apa dampak positif manusia terhadap ekosistem?",
                  "peran baik manusia"
                ],
                "keywords": [
                  "dampak positif",
                  "manusia",
                  "ekosistem",
                  "konservasi",
                  "reboisasi"
                ],
                "responses": [
                  "Dampak positif manusia terhadap ekosistem antara lain upaya konservasi keanekaragaman hayati, reboisasi hutan, dan pengelolaan sumber daya alam yang berkelanjutan."
                ],
                "intent": "dampak_positif_manusia_ekosistem"
              },
              {
                "patterns": [
                  "apa dampak negatif manusia terhadap ekosistem?",
                  "peran buruk manusia"
                ],
                "keywords": [
                  "dampak negatif",
                  "manusia",
                  "ekosistem",
                  "pencemaran",
                  "deforestasi",
                  "eksploitasi"
                ],
                "responses": [
                  "Dampak negatif manusia terhadap ekosistem meliputi pencemaran lingkungan, deforestasi (penebangan hutan), eksploitasi sumber daya alam berlebihan, dan introduksi spesies invasif."
                ],
                "intent": "dampak_negatif_manusia_ekosistem"
              },
              {
                "patterns": [
                  "bagaimana cara menjaga keseimbangan ekosistem?",
                  "pelestarian lingkungan"
                ],
                "keywords": [
                  "cara",
                  "menjaga",
                  "keseimbangan",
                  "ekosistem",
                  "pelestarian",
                  "sustainability"
                ],
                "responses": [
                  "Keseimbangan ekosistem dapat dijaga dengan mengurangi pencemaran, melakukan reboisasi, menghemat penggunaan sumber daya alam, dan mendukung praktik-praktik berkelanjutan."
                ],
                "intent": "menjaga_keseimbangan_ekosistem"
              }
            ]
          }
        }
      },
      "Fisika": {
        "subtopics": {
          "Momentum dan Impuls": {
            "QnA": [
              {
                "patterns": [
                  "apa itu momentum?",
                  "definisi momentum"
                ],
                "keywords": [
                  "pengertian",
                  "momentum",
                  "massa",
                  "kecepatan",
                  "kg m/s"
                ],
                "responses": [
                  "Momentum adalah besaran vektor yang didefinisikan sebagai hasil kali antara massa suatu benda dengan kecepatannya. Satuan SI untuk momentum adalah kilogram meter per sekon (kg m/s)."
                ],
                "intent": "pengertian_momentum"
              },
              {
                "patterns": [
                  "apa itu impuls?",
                  "definisi impuls"
                ],
                "keywords": [
                  "pengertian",
                  "impuls",
                  "gaya",
                  "selang waktu",
                  "Ns"
                ],
                "responses": [
                  "Impuls adalah besaran vektor yang didefinisikan sebagai hasil kali antara gaya yang bekerja pada suatu benda dengan selang waktu gaya tersebut bekerja. Satuan SI untuk impuls adalah Newton sekon (Ns)."
                ],
                "intent": "pengertian_impuls"
              },
              {
                "patterns": [
                  "apa hubungan antara impuls dan perubahan momentum?",
                  "teorema impuls-momentum"
                ],
                "keywords": [
                  "hubungan",
                  "impuls",
                  "perubahan momentum",
                  "teorema"
                ],
                "responses": [
                  "Teorema impuls-momentum menyatakan bahwa impuls yang bekerja pada suatu benda sama dengan perubahan momentum benda tersebut."
                ],
                "intent": "hubungan_impuls_perubahan_momentum"
              }
            ]
          },
          "Fluida Statis": {
            "QnA": [
              {
                "patterns": [
                  "apa itu tekanan hidrostatis?",
                  "tekanan dalam zat cair"
                ],
                "keywords": [
                  "pengertian",
                  "tekanan hidrostatis",
                  "kedalaman",
                  "massa jenis",
                  "gravitasi"
                ],
                "responses": [
                  "Tekanan hidrostatis adalah tekanan yang disebabkan oleh berat fluida (zat cair atau gas) pada suatu kedalaman tertentu. Besarnya tekanan hidrostatis bergantung pada kedalaman, massa jenis fluida, dan percepatan gravitasi."
                ],
                "intent": "pengertian_tekanan_hidrostatis"
              },
              {
                "patterns": [
                  "jelaskan Hukum Archimedes?",
                  "gaya apung"
                ],
                "keywords": [
                  "hukum archimedes",
                  "gaya apung",
                  "berat fluida dipindahkan",
                  "mengapung",
                  "melayang",
                  "tenggelam"
                ],
                "responses": [
                  "Hukum Archimedes menyatakan bahwa gaya apung yang bekerja pada suatu benda yang tercelup sebagian atau seluruhnya dalam fluida sama dengan berat fluida yang dipindahkan oleh benda tersebut."
                ],
                "intent": "hukum_archimedes"
              },
              {
                "patterns": [
                  "apa itu tegangan permukaan?",
                  "fenomena tegangan permukaan"
                ],
                "keywords": [
                  "pengertian",
                  "tegangan permukaan",
                  "permukaan zat cair",
                  "seperti membran",
                  "kohesi"
                ],
                "responses": [
                  "Tegangan permukaan adalah kecenderungan permukaan zat cair untuk mengerut sehingga permukaannya tampak seperti selaput elastis yang tegang. Fenomena ini disebabkan oleh gaya kohesi antar molekul zat cair."
                ],
                "intent": "pengertian_tegangan_permukaan"
              }
            ]
          },
          "Fluida Dinamis": {
            "QnA": [
              {
                "patterns": [
                  "apa itu viskositas?",
                  "kekentalan fluida"
                ],
                "keywords": [
                  "pengertian",
                  "viskositas",
                  "kekentalan",
                  "hambatan aliran",
                  "koefisien viskositas"
                ],
                "responses": [
                  "Viskositas adalah ukuran ketahanan suatu fluida terhadap aliran akibat adanya gesekan internal antar lapisan fluida yang bergerak relatif satu sama lain."
                ],
                "intent": "pengertian_viskositas"
              },
              {
                "patterns": [
                  "apa itu debit aliran fluida?",
                  "laju aliran volume"
                ],
                "keywords": [
                  "pengertian",
                  "debit",
                  "aliran fluida",
                  "volume per waktu",
                  "m³/s"
                ],
                "responses": [
                  "Debit aliran fluida adalah volume fluida yang mengalir melalui suatu penampang dalam satuan waktu. Satuan SI untuk debit adalah meter kubik per sekon (m³/s)."
                ],
                "intent": "pengertian_debit_aliran_fluida"
              },
              {
                "patterns": [
                  "jelaskan asas Bernoulli?",
                  "prinsip bernoulli"
                ],
                "keywords": [
                  "asas bernoulli",
                  "tekanan",
                  "kecepatan fluida",
                  "energi",
                  "aliran"
                ],
                "responses": [
                  "Asas Bernoulli menyatakan bahwa pada aliran fluida yang ideal (tidak viskos dan inkompresibel), peningkatan kecepatan fluida akan menyebabkan penurunan tekanan fluida atau penurunan energi potensial fluida."
                ],
                "intent": "asas_bernoulli"
              }
            ]
          },
          "Termodinamika Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu hukum termodinamika pertama?",
                  "kekekalan energi termal"
                ],
                "keywords": [
                  "hukum termodinamika 1",
                  "energi internal",
                  "kalor",
                  "usaha",
                  "kekekalan energi"
                ],
                "responses": [
                  "Hukum termodinamika pertama menyatakan bahwa perubahan energi internal suatu sistem sama dengan jumlah kalor yang ditambahkan ke sistem dikurangi usaha yang dilakukan oleh sistem pada lingkungannya."
                ],
                "intent": "hukum_termodinamika_1"
              },
              {
                "patterns": [
                  "apa itu hukum termodinamika kedua?",
                  "entropi"
                ],
                "keywords": [
                  "hukum termodinamika 2",
                  "entropi",
                  "ketidakaturan",
                  "arah proses"
                ],
                "responses": [
                  "Hukum termodinamika kedua menyatakan bahwa total entropi (ukuran ketidakaturan atau ketidaktersediaan energi untuk melakukan usaha) dari suatu sistem terisolasi cenderung meningkat seiring berjalannya waktu atau tetap konstan untuk proses reversibel."
                ],
                "intent": "hukum_termodinamika_2"
              },
              {
                "patterns": [
                  "apa itu mesin kalor?",
                  "contoh mesin kalor"
                ],
                "keywords": [
                  "pengertian",
                  "mesin kalor",
                  "kalor jadi usaha",
                  "efisiensi",
                  "mesin uap",
                  "mesin pembakaran"
                ],
                "responses": [
                  "Mesin kalor adalah alat yang mengubah energi panas (kalor) menjadi energi mekanik (usaha). Contoh mesin kalor adalah mesin uap dan mesin pembakaran internal."
                ],
                "intent": "pengertian_mesin_kalor"
              }
            ]
          },
          "Gelombang Elektromagnetik (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "sebutkan spektrum gelombang elektromagnetik?",
                  "urutan gelombang EM"
                ],
                "keywords": [
                  "spektrum",
                  "gelombang elektromagnetik",
                  "radio",
                  "mikro",
                  "infra merah",
                  "cahaya tampak",
                  "ultraviolet",
                  "sinar x",
                  "sinar gamma"
                ],
                "responses": [
                  "Spektrum gelombang elektromagnetik, dari panjang gelombang terpanjang hingga terpendek (atau frekuensi terendah hingga tertinggi), meliputi gelombang radio, gelombang mikro, sinar infra merah, cahaya tampak, sinar ultraviolet, sinar-X, dan sinar gamma."
                ],
                "intent": "spektrum_gelombang_elektromagnetik"
              },
              {
                "patterns": [
                  "apa kegunaan gelombang elektromagnetik dalam kehidupan sehari-hari?",
                  "aplikasi gelombang EM"
                ],
                "keywords": [
                  "kegunaan",
                  "gelombang elektromagnetik",
                  "komunikasi",
                  "pemanasan",
                  "pencitraan",
                  "medis"
                ],
                "responses": [
                  "Gelombang elektromagnetik memiliki banyak kegunaan, antara lain dalam komunikasi (radio, televisi, telepon seluler), pemanasan (microwave), pencitraan (sinar-X), dan aplikasi medis (terapi radiasi)."
                ],
                "intent": "kegunaan_gelombang_elektromagnetik"
              },
              {
                "patterns": [
                  "apa bahaya radiasi elektromagnetik?",
                  "dampak negatif gelombang EM"
                ],
                "keywords": [
                  "bahaya",
                  "radiasi elektromagnetik",
                  "kesehatan",
                  "ionisasi",
                  "non-ionisasi"
                ],
                "responses": [
                  "Beberapa jenis radiasi elektromagnetik, terutama yang berenergi tinggi seperti sinar ultraviolet, sinar-X, dan sinar gamma, dapat berbahaya bagi kesehatan karena bersifat ionisasi. Radiasi non-ionisasi seperti gelombang radio dan mikro juga memiliki potensi bahaya jika intensitasnya terlalu tinggi."
                ],
                "intent": "bahaya_radiasi_elektromagnetik"
              }
            ]
          },
          "Bunyi dan Pendengaran (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "apa itu intensitas bunyi?",
                  "kuat bunyi"
                ],
                "keywords": [
                  "pengertian",
                  "intensitas bunyi",
                  "daya per luas",
                  "watt/m²",
                  "keras lemah"
                ],
                "responses": [
                  "Intensitas bunyi adalah daya bunyi yang dipancarkan oleh sumber bunyi per satuan luas permukaan yang tegak lurus terhadap arah rambat bunyi. Satuan SI untuk intensitas bunyi adalah watt per meter persegi (W/m²). Intensitas bunyi menentukan keras lemahnya bunyi yang didengar."
                ],
                "intent": "pengertian_intensitas_bunyi"
              },
              {
                "patterns": [
                  "apa itu taraf intensitas bunyi?",
                  "tingkat kebisingan"
                ],
                "keywords": [
                  "pengertian",
                  "taraf intensitas bunyi",
                  "desibel",
                  "logaritma",
                  "ambang pendengaran"
                ],
                "responses": [
                  "Taraf intensitas bunyi (atau tingkat kebisingan) adalah ukuran intensitas bunyi relatif terhadap ambang pendengaran manusia, dinyatakan dalam desibel (dB) menggunakan skala logaritmik."
                ],
                "intent": "pengertian_taraf_intensitas_bunyi"
              },
              {
                "patterns": [
                  "apa itu resonansi bunyi?",
                  "contoh resonansi"
                ],
                "keywords": [
                  "pengertian",
                  "resonansi bunyi",
                  "frekuensi alami",
                  "ikut bergetar",
                  "contoh"
                ],
                "responses": [
                  "Resonansi bunyi adalah fenomena ikut bergetarnya suatu benda akibat adanya gelombang bunyi dengan frekuensi yang sama atau mendekati frekuensi alami benda tersebut. Contohnya adalah senar gitar yang bergetar ketika nada yang sama dimainkan di dekatnya."
                ],
                "intent": "pengertian_resonansi_bunyi"
              }
            ]
          },
          "Tekanan dalam Kehidupan Sehari-hari": {
            "QnA": [
              {
                "patterns": [
                  "bagaimana prinsip kerja alat pengukur tekanan darah?",
                  "tensimeter"
                ],
                "keywords": [
                  "prinsip kerja",
                  "alat pengukur tekanan darah",
                  "tensimeter",
                  "manset",
                  "air raksa",
                  "angka sistolik diastolik"
                ],
                "responses": [
                  "Alat pengukur tekanan darah (tensimeter) bekerja dengan memberikan tekanan eksternal pada arteri lengan menggunakan manset, kemudian mengukur tekanan darah sistolik (saat jantung memompa) dan diastolik (saat jantung beristirahat) berdasarkan bunyi aliran darah yang terdeteksi."
                ],
                "intent": "prinsip_kerja_tensimeter"
              },
              {
                "patterns": [
                  "mengapa pesawat terbang dapat terbang?",
                  "gaya angkat pesawat"
                ],
                "keywords": [
                  "pesawat terbang",
                  "terbang",
                  "sayap",
                  "asas bernoulli",
                  "gaya angkat"
                ],
                "responses": [
                  "Pesawat terbang dapat terbang karena bentuk sayapnya yang aerofoil menyebabkan kecepatan udara di atas sayap lebih tinggi daripada di bawahnya. Berdasarkan asas Bernoulli, kecepatan udara yang lebih tinggi menghasilkan tekanan yang lebih rendah di atas sayap, sehingga timbul gaya angkat yang melawan berat pesawat."
                ],
                "intent": "prinsip_pesawat_terbang"
              },
              {
                "patterns": [
                  "mengapa kapal selam dapat menyelam dan mengapung?",
                  "prinsip kapal selam"
                ],
                "keywords": [
                  "kapal selam",
                  "menyelam",
                  "mengapung",
                  "tangki pemberat",
                  "hukum archimedes",
                  "massa jenis efektif"
                ],
                "responses": [
                  "Kapal selam dapat menyelam dengan mengisi tangki pemberatnya dengan air, sehingga massa jenis efektif kapal selam menjadi lebih besar dari air. Untuk mengapung, air dikeluarkan dari tangki pemberat, mengurangi massa jenis efektif kapal selam sehingga lebih kecil dari air (sesuai Hukum Archimedes)."
                ],
                "intent": "prinsip_kapal_selam"
              }
            ]
          },
          "Fisika Lingkungan": {
            "QnA": [
              {
                "patterns": [
                  "apa itu efek rumah kaca?",
                  "penyebab pemanasan global"
                ],
                "keywords": [
                  "pengertian",
                  "efek rumah kaca",
                  "gas rumah kaca",
                  "atmosfer",
                  "panas bumi"
                ],
                "responses": [
                  "Efek rumah kaca adalah proses pemanasan permukaan Bumi akibat atmosfer yang memerangkap sebagian radiasi panas matahari yang dipantulkan oleh permukaan Bumi. Gas-gas rumah kaca seperti karbon dioksida dan metana berperan dalam proses ini."
                ],
                "intent": "pengertian_efek_rumah_kaca"
              },
              {
                "patterns": [
                  "apa itu energi surya?",
                  "pemanfaatan energi matahari"
                ],
                "keywords": [
                  "pengertian",
                  "energi surya",
                  "matahari",
                  "panel surya",
                  "pemanas air"
                ],
                "responses": [
                  "Energi surya adalah energi yang berasal dari radiasi matahari. Energi ini dapat dimanfaatkan secara langsung untuk pemanas air atau diubah menjadi energi listrik menggunakan panel surya (sel fotovoltaik)."
                ],
                "intent": "pengertian_energi_surya"
              },
              {
                "patterns": [
                  "bagaimana cara mengurangi dampak pemanasan global?",
                  "solusi pemanasan global"
                ],
                "keywords": [
                  "cara mengurangi",
                  "pemanasan global",
                  "hemat energi",
                  "energi terbarukan",
                  "reboisasi"
                ],
                "responses": [
                  "Beberapa cara untuk mengurangi dampak pemanasan global adalah dengan menghemat penggunaan energi, beralih ke sumber energi terbarukan, melakukan reboisasi, dan mengurangi emisi gas rumah kaca."
                ],
                "intent": "solusi_pemanasan_global"
              }
            ]
          },
          "Gaya dan Gerak": {
            "QnA": [
              {
                "patterns": [
                  "apa itu gaya?",
                  "definisi gaya dalam fisika"
                ],
                "keywords": [
                  "pengertian",
                  "definisi",
                  "gaya",
                  "tarikan",
                  "dorongan",
                  "newton"
                ],
                "responses": [
                  "Gaya adalah interaksi yang, ketika tidak diimbangi, akan mengubah gerak suatu benda. Gaya dapat berupa tarikan atau dorongan, dan satuan SI untuk gaya adalah Newton (N)."
                ],
                "intent": "pengertian_gaya"
              },
              {
                "patterns": [
                  "sebutkan jenis-jenis gaya yang umum?",
                  "macam-macam gaya"
                ],
                "keywords": [
                  "jenis",
                  "gaya",
                  "gravitasi",
                  "gesek",
                  "pegas",
                  "normal",
                  "magnet"
                ],
                "responses": [
                  "Beberapa jenis gaya yang umum meliputi gaya gravitasi (tarikan antar massa), gaya gesek (hambatan antara permukaan yang bergerak relatif), gaya pegas (gaya elastis dari pegas yang diregangkan atau dimampatkan), gaya normal (gaya tegak lurus permukaan), dan gaya magnet (tarikan atau tolakan oleh magnet)."
                ],
                "intent": "jenis_gaya"
              },
              {
                "patterns": [
                  "jelaskan Hukum Newton I tentang gerak?",
                  "bunyi hukum kelembaman"
                ],
                "keywords": [
                  "hukum newton 1",
                  "gerak",
                  "kelembaman",
                  "inersia",
                  "resultan gaya nol"
                ],
                "responses": [
                  "Hukum Newton I (Hukum Kelembaman atau Inersia) menyatakan bahwa setiap benda akan tetap berada dalam keadaan diam atau bergerak lurus beraturan kecuali jika dipaksa oleh gaya resultan yang tidak nol untuk mengubah keadaannya."
                ],
                "intent": "hukum_newton_1"
              }
            ]
          },
          "Usaha dan Energi": {
            "QnA": [
              {
                "patterns": [
                  "apa itu usaha dalam fisika?",
                  "definisi kerja"
                ],
                "keywords": [
                  "pengertian",
                  "usaha",
                  "kerja",
                  "gaya",
                  "perpindahan",
                  "joule"
                ],
                "responses": [
                  "Usaha (atau kerja) dalam fisika didefinisikan sebagai hasil kali antara gaya yang bekerja pada suatu benda dengan perpindahan benda tersebut dalam arah gaya. Satuan SI untuk usaha adalah Joule (J)."
                ],
                "intent": "pengertian_usaha"
              },
              {
                "patterns": [
                  "apa itu energi?",
                  "definisi energi"
                ],
                "keywords": [
                  "pengertian",
                  "energi",
                  "kemampuan",
                  "usaha",
                  "joule",
                  "bentuk energi"
                ],
                "responses": [
                  "Energi adalah kemampuan untuk melakukan usaha atau menghasilkan perubahan. Energi juga diukur dalam satuan Joule (J) dan memiliki berbagai bentuk, seperti energi kinetik, energi potensial, energi panas, dan energi listrik."
                ],
                "intent": "pengertian_energi"
              },
              {
                "patterns": [
                  "jelaskan perbedaan energi kinetik dan potensial?",
                  "jenis energi mekanik"
                ],
                "keywords": [
                  "perbedaan",
                  "energi kinetik",
                  "potensial",
                  "gerak",
                  "posisi",
                  "ketinggian"
                ],
                "responses": [
                  "Energi kinetik adalah energi yang dimiliki benda karena geraknya, sedangkan energi potensial adalah energi yang dimiliki benda karena posisinya atau konfigurasinya (misalnya ketinggian pada energi potensial gravitasi atau regangan pada energi potensial pegas)."
                ],
                "intent": "perbedaan_energi_kinetik_potensial"
              }
            ]
          },
          "Pesawat Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu pesawat sederhana?",
                  "tujuan penggunaan pesawat sederhana"
                ],
                "keywords": [
                  "pengertian",
                  "pesawat sederhana",
                  "mempermudah",
                  "gaya",
                  "usaha"
                ],
                "responses": [
                  "Pesawat sederhana adalah alat mekanik dasar yang mengubah arah atau besarnya gaya untuk mempermudah melakukan pekerjaan (usaha)."
                ],
                "intent": "pengertian_pesawat_sederhana"
              },
              {
                "patterns": [
                  "sebutkan contoh pesawat sederhana?",
                  "jenis-jenis pesawat sederhana"
                ],
                "keywords": [
                  "contoh",
                  "jenis",
                  "pesawat sederhana",
                  "tuas",
                  "bidang miring",
                  "katrol",
                  "roda berporos"
                ],
                "responses": [
                  "Contoh-contoh pesawat sederhana meliputi tuas (pengungkit), bidang miring, katrol, roda berporos, baji, dan sekrup."
                ],
                "intent": "jenis_pesawat_sederhana"
              },
              {
                "patterns": [
                  "apa keuntungan mekanis tuas?",
                  "rumus keuntungan mekanis tuas"
                ],
                "keywords": [
                  "keuntungan mekanis",
                  "tuas",
                  "gaya beban",
                  "gaya kuasa",
                  "lengan"
                ],
                "responses": [
                  "Keuntungan mekanis tuas adalah perbandingan antara gaya beban dengan gaya kuasa, atau perbandingan antara lengan kuasa dengan lengan beban. Rumusnya adalah KM = Beban / Kuasa = Lengan Kuasa / Lengan Beban."
                ],
                "intent": "keuntungan_mekanis_tuas"
              }
            ]
          },
          "Kalor dan Perpindahan Kalor": {
            "QnA": [
              {
                "patterns": [
                  "apa itu kalor?",
                  "definisi panas"
                ],
                "keywords": [
                  "pengertian",
                  "kalor",
                  "energi panas",
                  "suhu",
                  "joule",
                  "kalori"
                ],
                "responses": [
                  "Kalor adalah bentuk energi yang berpindah dari benda yang suhunya lebih tinggi ke benda yang suhunya lebih rendah akibat perbedaan suhu. Satuan SI untuk kalor adalah Joule (J), tetapi sering juga digunakan kalori (kal)."
                ],
                "intent": "pengertian_kalor"
              },
              {
                "patterns": [
                  "bagaimana kalor dapat berpindah?",
                  "cara-cara perpindahan panas"
                ],
                "keywords": [
                  "cara",
                  "perpindahan kalor",
                  "konduksi",
                  "konveksi",
                  "radiasi",
                  "medium"
                ],
                "responses": [
                  "Kalor dapat berpindah melalui tiga cara: konduksi (melalui zat padat tanpa perpindahan partikel), konveksi (melalui aliran fluida, yaitu zat cair atau gas), dan radiasi (melalui gelombang elektromagnetik tanpa memerlukan medium)."
                ],
                "intent": "cara_perpindahan_kalor"
              },
              {
                "patterns": [
                  "apa perbedaan suhu dan kalor?",
                  "konsep suhu dan panas"
                ],
                "keywords": [
                  "perbedaan",
                  "suhu",
                  "kalor",
                  "derajat",
                  "energi",
                  "intensitas",
                  "jumlah"
                ],
                "responses": [
                  "Suhu adalah ukuran derajat panas atau dingin suatu benda, yang menunjukkan energi kinetik rata-rata partikel penyusunnya. Kalor adalah energi panas yang berpindah akibat perbedaan suhu. Suhu adalah intensitas, sedangkan kalor adalah jumlah energi."
                ],
                "intent": "perbedaan_suhu_kalor"
              }
            ]
          },
          "Cahaya dan Optik": {
            "QnA": [
              {
                "patterns": [
                  "apa itu cahaya?",
                  "sifat-sifat cahaya"
                ],
                "keywords": [
                  "pengertian",
                  "cahaya",
                  "gelombang elektromagnetik",
                  "kecepatan",
                  "lurus"
                ],
                "responses": [
                  "Cahaya adalah radiasi elektromagnetik yang dapat dilihat oleh mata manusia. Cahaya memiliki sifat sebagai gelombang dan partikel (foton), bergerak dengan kecepatan tinggi di ruang hampa, dan merambat lurus."
                ],
                "intent": "pengertian_cahaya"
              },
              {
                "patterns": [
                  "jelaskan hukum pemantulan cahaya?",
                  "refleksi cahaya"
                ],
                "keywords": [
                  "hukum pemantulan",
                  "cahaya",
                  "datang",
                  "pantul",
                  "normal",
                  "sudut"
                ],
                "responses": [
                  "Hukum pemantulan cahaya menyatakan bahwa sudut datang cahaya sama dengan sudut pantul, dan sinar datang, sinar pantul, serta garis normal terletak pada bidang yang sama."
                ],
                "intent": "hukum_pemantulan_cahaya"
              },
              {
                "patterns": [
                  "apa itu pembiasan cahaya?",
                  "refraksi cahaya"
                ],
                "keywords": [
                  "pengertian",
                  "pembiasan",
                  "cahaya",
                  "medium",
                  "indeks bias",
                  "belok"
                ],
                "responses": [
                  "Pembiasan cahaya adalah pembelokan arah rambat cahaya ketika melewati batas antara dua medium yang memiliki indeks bias yang berbeda."
                ],
                "intent": "pengertian_pembiasan_cahaya"
              }
            ]
          },
          "Listrik Statis": {
            "QnA": [
              {
                "patterns": [
                  "apa itu listrik statis?",
                  "fenomena listrik statis"
                ],
                "keywords": [
                  "pengertian",
                  "listrik statis",
                  "muatan",
                  "diam",
                  "interaksi"
                ],
                "responses": [
                  "Listrik statis adalah kumpulan muatan listrik pada suatu benda yang tidak bergerak atau bergerak dalam jumlah yang terbatas. Fenomena ini terjadi karena adanya transfer elektron antar benda."
                ],
                "intent": "pengertian_listrik_statis"
              },
              {
                "patterns": [
                  "bagaimana cara menghasilkan listrik statis?",
                  "proses pemuatan listrik"
                ],
                "keywords": [
                  "cara",
                  "menghasilkan",
                  "listrik statis",
                  "gosokan",
                  "induksi",
                  "konduksi"
                ],
                "responses": [
                  "Listrik statis dapat dihasilkan melalui beberapa cara, di antaranya adalah penggosokan dua benda yang berbeda, induksi (mendekatkan benda bermuatan), dan konduksi (kontak langsung dengan benda bermuatan)."
                ],
                "intent": "cara_menghasilkan_listrik_statis"
              },
              {
                "patterns": [
                  "apa bahaya listrik statis?",
                  "dampak negatif listrik statis"
                ],
                "keywords": [
                  "bahaya",
                  "listrik statis",
                  "percikan",
                  "kebakaran",
                  "kerusakan elektronik"
                ],
                "responses": [
                  "Bahaya listrik statis meliputi terjadinya percikan listrik yang dapat menyebabkan kebakaran pada lingkungan yang mudah terbakar atau merusak komponen elektronik yang sensitif."
                ],
                "intent": "bahaya_listrik_statis"
              }
            ]
          },
          "Listrik Dinamis": {
            "QnA": [
              {
                "patterns": [
                  "apa itu listrik dinamis?",
                  "arus listrik"
                ],
                "keywords": [
                  "pengertian",
                  "listrik dinamis",
                  "arus",
                  "muatan",
                  "bergerak",
                  "ampere"
                ],
                "responses": [
                  "Listrik dinamis adalah aliran muatan listrik (biasanya elektron) melalui suatu penghantar. Besarnya arus listrik diukur dalam satuan Ampere (A)."
                ],
                "intent": "pengertian_listrik_dinamis"
              },
              {
                "patterns": [
                  "apa itu tegangan listrik?",
                  "beda potensial"
                ],
                "keywords": [
                  "pengertian",
                  "tegangan",
                  "beda potensial",
                  "energi",
                  "muatan",
                  "volt"
                ],
                "responses": [
                  "Tegangan listrik (atau beda potensial) adalah energi potensial listrik per satuan muatan antara dua titik dalam rangkaian listrik. Satuan SI untuk tegangan adalah Volt (V)."
                ],
                "intent": "pengertian_tegangan_listrik"
              },
              {
                "patterns": [
                  "jelaskan Hukum Ohm?",
                  "hubungan V, I, dan R"
                ],
                "keywords": [
                  "hukum ohm",
                  "tegangan",
                  "arus",
                  "hambatan",
                  "V = IR",
                  "ohm"
                ],
                "responses": [
                  "Hukum Ohm menyatakan bahwa besarnya arus listrik (I) yang mengalir melalui suatu penghantar berbanding lurus dengan tegangan (V) yang melintasi penghantar tersebut dan berbanding terbalik dengan hambatan (R) penghantar. Secara matematis, dirumuskan sebagai V = I x R."
                ],
                "intent": "hukum_ohm"
              }
            ]
          },
          "Magnet dan Elektromagnet": {
            "QnA": [
              {
                "patterns": [
                  "apa itu magnet?",
                  "sifat-sifat magnet"
                ],
                "keywords": [
                  "pengertian",
                  "magnet",
                  "kutub",
                  "tarik",
                  "tolak",
                  "medan magnet"
                ],
                "responses": [
                  "Magnet adalah benda yang memiliki kemampuan menarik benda-benda feromagnetik (seperti besi dan baja) dan memiliki dua kutub, yaitu kutub utara dan kutub selatan. Kutub yang sejenis akan tolak-menolak, sedangkan kutub yang berbeda jenis akan tarik-menarik, dan di sekitar magnet terdapat medan magnet."
                ],
                "intent": "pengertian_magnet"
              },
              {
                "patterns": [
                  "apa itu elektromagnet?",
                  "cara membuat elektromagnet"
                ],
                "keywords": [
                  "pengertian",
                  "elektromagnet",
                  "arus listrik",
                  "kumparan",
                  "inti besi",
                  "medan magnet"
                ],
                "responses": [
                  "Elektromagnet adalah magnet yang dihasilkan oleh aliran arus listrik melalui kumparan kawat. Kekuatan elektromagnet dapat ditingkatkan dengan menambah jumlah lilitan kumparan, memperbesar arus listrik, atau menggunakan inti besi di dalam kumparan."
                ],
                "intent": "pengertian_elektromagnet"
              },
              {
                "patterns": [
                  "sebutkan contoh penerapan elektromagnet?",
                  "penggunaan elektromagnet"
                ],
                "keywords": [
                  "contoh",
                  "penerapan",
                  "elektromagnet",
                  "bel listrik",
                  "motor listrik",
                  "relay"
                ],
                "responses": [
                  "Beberapa contoh penerapan elektromagnet adalah pada bel listrik, motor listrik, relay (saklar elektromagnetik), dan pengangkat besi tua."
                ],
                "intent": "penerapan_elektromagnet"
              }
            ]
          },
          "Gelombang dan Bunyi": {
            "QnA": [
              {
                "patterns": [
                  "apa itu gelombang?",
                  "jenis-jenis gelombang"
                ],
                "keywords": [
                  "pengertian",
                  "gelombang",
                  "getaran",
                  "transversal",
                  "longitudinal",
                  "mekanik",
                  "elektromagnetik"
                ],
                "responses": [
                  "Gelombang adalah getaran yang merambat melalui medium (gelombang mekanik) atau tanpa medium (gelombang elektromagnetik). Berdasarkan arah getarannya, gelombang dibedakan menjadi gelombang transversal (getaran tegak lurus arah rambat) dan gelombang longitudinal (getaran sejajar arah rambat)."
                ],
                "intent": "pengertian_gelombang"
              },
              {
                "patterns": [
                  "apa itu bunyi?",
                  "sifat-sifat bunyi"
                ],
                "keywords": [
                  "pengertian",
                  "bunyi",
                  "gelombang longitudinal",
                  "medium",
                  "cepat rambat",
                  "frekuensi"
                ],
                "responses": [
                  "Bunyi adalah gelombang mekanik longitudinal yang merambat melalui medium (seperti udara, air, atau zat padat) akibat adanya getaran sumber bunyi. Bunyi memiliki cepat rambat yang berbeda di berbagai medium dan memiliki frekuensi yang menentukan tinggi rendahnya nada."
                ],
                "intent": "pengertian_bunyi"
              },
              {
                "patterns": [
                  "apa perbedaan infrasonik, audiosonik, dan ultrasonik?",
                  "rentang frekuensi bunyi"
                ],
                "keywords": [
                  "perbedaan",
                  "infrasonik",
                  "audiosonik",
                  "ultrasonik",
                  "frekuensi",
                  "pendengaran"
                ],
                "responses": [
                  "Infrasonik adalah bunyi dengan frekuensi di bawah 20 Hz (tidak dapat didengar manusia). Audiosonik adalah bunyi dengan frekuensi antara 20 Hz hingga 20.000 Hz (rentang pendengaran manusia). Ultrasonik adalah bunyi dengan frekuensi di atas 20.000 Hz (di atas batas pendengaran manusia)."
                ],
                "intent": "perbedaan_jenis_bunyi"
              }
            ]
          },
          "Suhu dan Pemuaian": {
            "QnA": [
              {
                "patterns": [
                  "apa itu suhu?",
                  "skala suhu"
                ],
                "keywords": [
                  "pengertian",
                  "suhu",
                  "derajat",
                  "celcius",
                  "fahrenheit",
                  "kelvin"
                ],
                "responses": [
                  "Suhu adalah ukuran derajat panas atau dingin suatu benda. Skala suhu yang umum digunakan adalah Celsius (°C), Fahrenheit (°F), dan Kelvin (K)."
                ],
                "intent": "pengertian_suhu"
              },
              {
                "patterns": [
                  "apa itu pemuaian?",
                  "jenis-jenis pemuaian"
                ],
                "keywords": [
                  "pengertian",
                  "pemuaian",
                  "zat padat",
                  "cair",
                  "gas",
                  "panjang",
                  "luas",
                  "volume"
                ],
                "responses": [
                  "Pemuaian adalah perubahan ukuran suatu benda (panjang, luas, atau volume) akibat perubahan suhu. Pemuaian terjadi pada zat padat, zat cair, dan gas."
                ],
                "intent": "pengertian_pemuaian"
              },
              {
                "patterns": [
                  "apa manfaat pemuaian dalam kehidupan sehari-hari?",
                  "penerapan pemuaian"
                ],
                "keywords": [
                  "manfaat",
                  "pemuaian",
                  "bimetal",
                  "jembatan",
                  "rel kereta",
                  "termometer"
                ],
                "responses": [
                  "Pemanfaatan pemuaian dalam kehidupan sehari-hari contohnya adalah pada bimetal dalam termostat, celah pada jembatan dan rel kereta api untuk memberi ruang pemuaian, serta prinsip kerja termometer cairan."
                ],
                "intent": "manfaat_pemuaian"
              }
            ]
          },
          "Tekanan": {
            "QnA": [
              {
                "patterns": [
                  "apa itu tekanan?",
                  "definisi tekanan"
                ],
                "keywords": [
                  "pengertian",
                  "tekanan",
                  "gaya",
                  "luas permukaan",
                  "pascal"
                ],
                "responses": [
                  "Tekanan didefinisikan sebagai besarnya gaya yang bekerja tegak lurus pada suatu permukaan per satuan luas permukaan tersebut. Satuan SI untuk tekanan adalah Pascal (Pa) atau Newton per meter persegi (N/m²)."
                ],
                "intent": "pengertian_tekanan"
              },
              {
                "patterns": [
                  "apa perbedaan tekanan zat padat, cair, dan gas?",
                  "jenis tekanan"
                ],
                "keywords": [
                  "perbedaan",
                  "tekanan",
                  "padat",
                  "cair",
                  "gas",
                  "hukum pascal",
                  "hukum archimedes"
                ],
                "responses": [
                  "Tekanan pada zat padat bergantung pada gaya dan luas permukaan kontak. Tekanan pada zat cair bergantung pada kedalaman, massa jenis, dan gravitasi (hukum Pascal). Tekanan pada gas bekerja ke segala arah dan dipengaruhi oleh volume dan suhu (hukum Boyle-Gay Lussac)."
                ],
                "intent": "perbedaan_tekanan_zat"
              },
              {
                "patterns": [
                  "sebutkan contoh penerapan tekanan dalam kehidupan sehari-hari?",
                  "aplikasi tekanan"
                ],
                "keywords": [
                  "contoh",
                  "penerapan",
                  "tekanan",
                  "ban",
                  "jarum suntik",
                  "dongkrak hidrolik"
                ],
                "responses": [
                  "Contoh penerapan tekanan adalah pada ban kendaraan (tekanan udara), jarum suntik (tekanan untuk memasukkan obat), dan dongkrak hidrolik (memanfaatkan hukum Pascal)."
                ],
                "intent": "penerapan_tekanan"
              }
            ]
          },
          "Massa Jenis": {
            "QnA": [
              {
                "patterns": [
                  "apa itu massa jenis?",
                  "definisi kerapatan"
                ],
                "keywords": [
                  "pengertian",
                  "massa jenis",
                  "kerapatan",
                  "massa",
                  "volume",
                  "kg/m3"
                ],
                "responses": [
                  "Massa jenis (atau kerapatan) adalah ukuran massa suatu zat per satuan volume. Satuan SI untuk massa jenis adalah kilogram per meter kubik (kg/m³)."
                ],
                "intent": "pengertian_massa_jenis"
              },
              {
                "patterns": [
                  "bagaimana cara menghitung massa jenis?",
                  "rumus massa jenis"
                ],
                "keywords": [
                  "cara menghitung",
                  "rumus",
                  "massa jenis",
                  "massa",
                  "volume"
                ],
                "responses": [
                  "Massa jenis dapat dihitung dengan membagi massa (m) suatu benda dengan volumenya (V)"
                ],
                "intent": "rumus_massa_jenis"
              },
              {
                "patterns": [
                  "apa kegunaan konsep massa jenis?",
                  "aplikasi massa jenis"
                ],
                "keywords": [
                  "kegunaan",
                  "aplikasi",
                  "massa jenis",
                  "mengapung",
                  "tenggelam",
                  "identifikasi zat"
                ],
                "responses": [
                  "Konsep massa jenis digunakan untuk menentukan apakah suatu benda akan mengapung atau tenggelam dalam fluida, serta untuk mengidentifikasi jenis suatu zat karena setiap zat memiliki massa jenis yang khas."
                ],
                "intent": "aplikasi_massa_jenis"
              }
            ]
          },
          "Energi dan Perubahannya": {
            "QnA": [
              {
                "patterns": [
                  "apa itu hukum kekekalan energi?",
                  "konservasi energi"
                ],
                "keywords": [
                  "pengertian",
                  "hukum kekekalan energi",
                  "tidak dapat diciptakan",
                  "dimusnahkan",
                  "berubah bentuk"
                ],
                "responses": [
                  "Hukum kekekalan energi menyatakan bahwa energi total dalam sistem tertutup tidak dapat diciptakan atau dimusnahkan, tetapi dapat berubah dari satu bentuk ke bentuk energi lainnya."
                ],
                "intent": "hukum_kekekalan_energi"
              },
              {
                "patterns": [
                  "sebutkan contoh perubahan energi?",
                  "konversi energi"
                ],
                "keywords": [
                  "contoh",
                  "perubahan energi",
                  "listrik ke cahaya",
                  "kimia ke gerak",
                  "matahari ke listrik"
                ],
                "responses": [
                  "Contoh perubahan energi adalah lampu mengubah energi listrik menjadi energi cahaya dan panas, mobil mengubah energi kimia bahan bakar menjadi energi gerak, dan panel surya mengubah energi matahari menjadi energi listrik."
                ],
                "intent": "contoh_perubahan_energi"
              },
              {
                "patterns": [
                  "apa itu efisiensi energi?",
                  "daya guna energi"
                ],
                "keywords": [
                  "pengertian",
                  "efisiensi energi",
                  "energi masuk",
                  "energi keluar",
                  "persentase"
                ],
                "responses": [
                  "Efisiensi energi adalah perbandingan antara energi keluaran yang bermanfaat dengan energi masukan total, biasanya dinyatakan dalam persentase. Semakin tinggi efisiensinya, semakin sedikit energi yang terbuang."
                ],
                "intent": "pengertian_efisiensi_energi"
              }
            ]
          },
          "Sumber Energi": {
            "QnA": [
              {
                "patterns": [
                  "apa saja jenis-jenis sumber energi?",
                  "klasifikasi sumber energi"
                ],
                "keywords": [
                  "jenis",
                  "sumber energi",
                  "terbarukan",
                  "tak terbarukan",
                  "contoh"
                ],
                "responses": [
                  "Sumber energi dapat diklasifikasikan menjadi dua jenis utama: sumber energi terbarukan (dapat diperbaharui secara alami, contohnya matahari, angin, air) dan sumber energi tak terbarukan (jumlahnya terbatas dan tidak dapat diperbaharui dalam waktu singkat, contohnya minyak bumi, batu bara, gas alam)."
                ],
                "intent": "jenis_sumber_energi"
              },
              {
                "patterns": [
                  "berikan contoh sumber energi terbarukan?",
                  "energi alternatif"
                ],
                "keywords": [
                  "contoh",
                  "sumber energi terbarukan",
                  "matahari",
                  "angin",
                  "air",
                  "biomassa",
                  "geotermal"
                ],
                "responses": [
                  "Contoh sumber energi terbarukan meliputi energi matahari (surya), energi angin, energi air (hidro), energi biomassa (dari bahan organik), dan energi geotermal (panas bumi)."
                ],
                "intent": "contoh_energi_terbarukan"
              },
              {
                "patterns": [
                  "apa dampak penggunaan sumber energi tak terbarukan?",
                  "kerugian energi fosil"
                ],
                "keywords": [
                  "dampak",
                  "sumber energi tak terbarukan",
                  "lingkungan",
                  "polusi",
                  "terbatas"
                ],
                "responses": [
                  "Penggunaan sumber energi tak terbarukan dapat menyebabkan dampak negatif terhadap lingkungan, seperti polusi udara dan air, serta sumbernya yang terbatas akan habis pada suatu saat."
                ],
                "intent": "dampak_energi_tak_terbarukan"
              }
            ]
          },
          "Getaran dan Gelombang (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "apa itu frekuensi gelombang?",
                  "pengertian frekuensi"
                ],
                "keywords": [
                  "pengertian",
                  "frekuensi",
                  "gelombang",
                  "jumlah getaran",
                  "waktu",
                  "hertz"
                ],
                "responses": [
                  "Frekuensi gelombang adalah jumlah getaran atau siklus lengkap yang terjadi dalam satu satuan waktu. Satuan SI untuk frekuensi adalah Hertz (Hz)."
                ],
                "intent": "pengertian_frekuensi_gelombang"
              },
              {
                "patterns": [
                  "apa itu periode gelombang?",
                  "pengertian periode"
                ],
                "keywords": [
                  "pengertian",
                  "periode",
                  "gelombang",
                  "waktu satu getaran",
                  "sekon"
                ],
                "responses": [
                  "Periode gelombang adalah waktu yang dibutuhkan untuk satu getaran atau satu siklus lengkap. Satuan SI untuk periode adalah sekon (s). Periode adalah kebalikan dari frekuensi (T = 1/f)."
                ],
                "intent": "pengertian_periode_gelombang"
              },
              {
                "patterns": [
                  "apa hubungan antara cepat rambat, frekuensi, dan panjang gelombang?",
                  "rumus cepat rambat gelombang"
                ],
                "keywords": [
                  "hubungan",
                  "cepat rambat",
                  "frekuensi",
                  "panjang gelombang"
                ],
                "responses": [
                  "Cepat rambat gelombang (v) adalah hasil kali antara frekuensi (f) dan panjang gelombang "
                ],
                "intent": "hubungan_cepat_rambat_frekuensi_panjang_gelombang"
              }
            ]
          },
          "Optik Geometris": {
            "QnA": [
              {
                "patterns": [
                  "apa itu lensa cembung?",
                  "sifat lensa positif"
                ],
                "keywords": [
                  "pengertian",
                  "lensa cembung",
                  "konveks",
                  "mengumpulkan cahaya",
                  "positif"
                ],
                "responses": [
                  "Lensa cembung (atau lensa konveks) adalah lensa yang bagian tengahnya lebih tebal daripada bagian tepinya dan berfungsi mengumpulkan atau memfokuskan cahaya yang melewatinya. Lensa cembung memiliki fokus positif."
                ],
                "intent": "pengertian_lensa_cembung"
              },
              {
                "patterns": [
                  "apa itu lensa cekung?",
                  "sifat lensa negatif"
                ],
                "keywords": [
                  "pengertian",
                  "lensa cekung",
                  "konkaf",
                  "menyebarkan cahaya",
                  "negatif"
                ],
                "responses": [
                  "Lensa cekung (atau lensa konkaf) adalah lensa yang bagian tengahnya lebih tipis daripada bagian tepinya dan berfungsi menyebarkan cahaya yang melewatinya. Lensa cekung memiliki fokus negatif."
                ],
                "intent": "pengertian_lensa_cekung"
              },
              {
                "patterns": [
                  "sebutkan contoh alat optik?",
                  "aplikasi lensa"
                ],
                "keywords": [
                  "contoh",
                  "alat optik",
                  "kaca pembesar",
                  "mikroskop",
                  "teleskop",
                  "kamera"
                ],
                "responses": [
                  "Contoh alat optik yang menggunakan lensa adalah kaca pembesar, mikroskop, teleskop, dan kamera."
                ],
                "intent": "contoh_alat_optik"
              }
            ]
          },
          "Teknologi Listrik": {
            "QnA": [
              {
                "patterns": [
                  "apa itu rangkaian seri?",
                  "ciri rangkaian seri"
                ],
                "keywords": [
                  "pengertian",
                  "rangkaian seri",
                  "satu jalur",
                  "arus sama",
                  "tegangan dibagi"
                ],
                "responses": [
                  "Rangkaian seri adalah rangkaian listrik di mana komponen-komponennya (seperti lampu atau resistor) dihubungkan secara berurutan dalam satu jalur aliran listrik. Arus listrik yang mengalir melalui setiap komponen dalam rangkaian seri adalah sama, sedangkan tegangan total dibagi di antara komponen-komponen tersebut."
                ],
                "intent": "pengertian_rangkaian_seri"
              },
              {
                "patterns": [
                  "apa itu rangkaian paralel?",
                  "ciri rangkaian paralel"
                ],
                "keywords": [
                  "pengertian",
                  "rangkaian paralel",
                  "banyak jalur",
                  "tegangan sama",
                  "arus dibagi"
                ],
                "responses": [
                  "Rangkaian paralel adalah rangkaian listrik di mana komponen-komponennya dihubungkan dalam beberapa jalur aliran listrik yang berbeda. Tegangan listrik yang melintasi setiap komponen dalam rangkaian paralel adalah sama, sedangkan arus total dibagi di antara jalur-jalur tersebut."
                ],
                "intent": "pengertian_rangkaian_paralel"
              },
              {
                "patterns": [
                  "apa fungsi sekring dalam rangkaian listrik?",
                  "pengaman listrik"
                ],
                "keywords": [
                  "fungsi",
                  "sekring",
                  "pengaman",
                  "arus lebih",
                  "putus",
                  "mencegah kerusakan"
                ],
                "responses": [
                  "Sekring adalah komponen pengaman dalam rangkaian listrik yang berfungsi untuk memutuskan aliran listrik secara otomatis jika terjadi arus yang berlebihan (overcurrent), sehingga mencegah terjadinya kerusakan pada komponen lain atau kebakaran."
                ],
                "intent": "fungsi_sekring"
              }
            ]
          },
          "Induksi Elektromagnetik": {
            "QnA": [
              {
                "patterns": [
                  "apa itu induksi elektromagnetik?",
                  "hukum faraday"
                ],
                "keywords": [
                  "pengertian",
                  "induksi elektromagnetik",
                  "medan magnet",
                  "arus listrik",
                  "gerak relatif",
                  "hukum Faraday"
                ],
                "responses": [
                  "Induksi elektromagnetik adalah fenomena di mana perubahan medan magnet di sekitar konduktor listrik menghasilkan gaya gerak listrik (GGL) atau tegangan induksi pada konduktor tersebut (Hukum Faraday). Jika rangkaian tertutup, GGL induksi ini dapat menyebabkan timbulnya arus listrik induksi."
                ],
                "intent": "pengertian_induksi_elektromagnetik"
              },
              {
                "patterns": [
                  "sebutkan contoh penerapan induksi elektromagnetik?",
                  "aplikasi induksi"
                ],
                "keywords": [
                  "contoh",
                  "penerapan",
                  "induksi elektromagnetik",
                  "generator",
                  "transformator",
                  "dinamo"
                ],
                "responses": [
                  "Beberapa contoh penerapan induksi elektromagnetik adalah pada generator listrik (mengubah energi mekanik menjadi energi listrik), transformator (mengubah tegangan listrik AC), dan dinamo sepeda."
                ],
                "intent": "penerapan_induksi_elektromagnetik"
              },
              {
                "patterns": [
                  "apa perbedaan generator AC dan DC?",
                  "jenis generator"
                ],
                "keywords": [
                  "perbedaan",
                  "generator AC",
                  "DC",
                  "arus bolak-balik",
                  "arus searah",
                  "komutator"
                ],
                "responses": [
                  "Generator AC (Alternating Current) menghasilkan arus listrik bolak-balik yang arahnya berubah-ubah secara periodik. Generator DC (Direct Current) menghasilkan arus listrik searah yang arahnya tetap. Perbedaan utama pada konstruksinya adalah adanya komutator pada generator DC yang berfungsi untuk menyearahkan arus yang dihasilkan."
                ],
                "intent": "perbedaan_generator_ac_dc"
              }
            ]
          },
          "Fisika Atom dan Inti": {
            "QnA": [
              {
                "patterns": [
                  "apa itu atom?",
                  "struktur atom"
                ],
                "keywords": [
                  "pengertian",
                  "atom",
                  "inti atom",
                  "proton",
                  "neutron",
                  "elektron"
                ],
                "responses": [
                  "Atom adalah unit dasar materi yang terdiri dari inti atom (nukleus) yang mengandung proton (bermuatan positif) dan neutron (tidak bermuatan), serta elektron (bermuatan negatif) yang mengorbit di sekitar inti."
                ],
                "intent": "pengertian_atom"
              },
              {
                "patterns": [
                  "apa itu isotop?",
                  "jenis atom"
                ],
                "keywords": [
                  "pengertian",
                  "isotop",
                  "jumlah neutron",
                  "sama",
                  "berbeda",
                  "unsur"
                ],
                "responses": [
                  "Isotop adalah atom-atom dari suatu unsur kimia yang memiliki jumlah proton yang sama (sehingga merupakan unsur yang sama) tetapi memiliki jumlah neutron yang berbeda dalam intinya, sehingga memiliki nomor massa yang berbeda."
                ],
                "intent": "pengertian_isotop"
              },
              {
                "patterns": [
                  "apa itu radioaktivitas?",
                  "peluruhan radioaktif"
                ],
                "keywords": [
                  "pengertian",
                  "radioaktivitas",
                  "inti tidak stabil",
                  "peluruhan",
                  "radiasi",
                  "alfa",
                  "beta",
                  "gamma"
                ],
                "responses": [
                  "Radioaktivitas adalah fenomena peluruhan spontan inti atom yang tidak stabil, disertai dengan pemancaran partikel (alfa atau beta) atau radiasi elektromagnetik (gamma)."
                ],
                "intent": "pengertian_radioaktivitas"
              }
            ]
          },
          "Tata Surya (Fisika)": {
            "QnA": [
              {
                "patterns": [
                  "apa saja planet dalam tata surya?",
                  "urutan planet dari matahari"
                ],
                "keywords": [
                  "planet",
                  "tata surya",
                  "merkurius",
                  "venus",
                  "bumi",
                  "mars",
                  "jupiter",
                  "saturnus",
                  "uranus",
                  "neptunus"
                ],
                "responses": [
                  "Planet-planet dalam tata surya kita, diurutkan dari yang terdekat dengan Matahari adalah Merkurius, Venus, Bumi, Mars, Jupiter, Saturnus, Uranus, dan Neptunus."
                ],
                "intent": "planet_tata_surya"
              },
              {
                "patterns": [
                  "apa perbedaan planet kebumian dan jovian?",
                  "kelompok planet"
                ],
                "keywords": [
                  "perbedaan",
                  "planet kebumian",
                  "jovian",
                  "ukuran",
                  "komposisi",
                  "permukaan"
                ],
                "responses": [
                  "Planet kebumian (inner planets) seperti Merkurius, Venus, Bumi, dan Mars berukuran relatif kecil, berbatu, dan memiliki permukaan padat. Planet jovian (outer planets) seperti Jupiter, Saturnus, Uranus, dan Neptunus berukuran besar, sebagian besar terdiri dari gas dan es, serta tidak memiliki permukaan padat yang jelas."
                ],
                "intent": "perbedaan_planet_kebumian_jovian"
              },
              {
                "patterns": [
                  "apa itu gravitasi dalam tata surya?",
                  "peran gravitasi"
                ],
                "keywords": [
                  "pengertian",
                  "gravitasi",
                  "tata surya",
                  "matahari",
                  "planet",
                  "orbit"
                ],
                "responses": [
                  "Gravitasi adalah gaya tarik-menarik antara benda-benda bermassa. Dalam tata surya, gravitasi Matahari adalah gaya dominan yang menjaga planet-planet tetap bergerak dalam orbitnya mengelilingi Matahari."
                ],
                "intent": "gravitasi_tata_surya"
              }
            ]
          },
          "Massa dan Berat": {
            "QnA": [
              {
                "patterns": [
                  "apa perbedaan massa dan berat?",
                  "definisi massa dan berat"
                ],
                "keywords": [
                  "perbedaan",
                  "massa",
                  "berat",
                  "jumlah zat",
                  "gaya gravitasi",
                  "kg",
                  "newton"
                ],
                "responses": [
                  "Massa adalah ukuran jumlah materi atau zat yang terkandung dalam suatu benda dan diukur dalam kilogram (kg). Berat adalah gaya gravitasi yang bekerja pada suatu benda dan diukur dalam Newton (N)."
                ],
                "intent": "perbedaan_massa_berat"
              },
              {
                "patterns": [
                  "bagaimana cara menghitung berat?",
                  "rumus berat"
                ],
                "keywords": [
                  "cara menghitung",
                  "rumus",
                  "berat",
                  "massa",
                  "percepatan gravitasi"
                ],
                "responses": [
                  "Berat (W) dapat dihitung dengan mengalikan massa (m) suatu benda dengan percepatan gravitasi (g) di tempat tersebut."
                ],
                "intent": "rumus_berat"
              },
              {
                "patterns": [
                  "apakah massa benda berubah di tempat yang berbeda?",
                  "perubahan massa"
                ],
                "keywords": [
                  "perubahan",
                  "massa",
                  "tempat berbeda",
                  "konstan",
                  "jumlahzat"
                ],
                "responses": [
                  "Massa suatu benda adalah jumlah zat yang terkandung di dalamnya dan bersifat konstan, tidak berubah meskipun benda tersebut berada di tempat yang berbeda dengan percepatan gravitasi yang berbeda."
                ],
                "intent": "perubahan_massa"
              }
            ]
          },
          "Pengukuran": {
            "QnA": [
              {
                "patterns": [
                  "apa itu pengukuran?",
                  "definisi pengukuran"
                ],
                "keywords": [
                  "pengertian",
                  "pengukuran",
                  "membandingkan",
                  "satuan",
                  "alat ukur"
                ],
                "responses": [
                  "Pengukuran adalah proses membandingkan suatu besaran fisika yang diukur dengan besaran sejenis yang digunakan sebagai satuan."
                ],
                "intent": "pengertian_pengukuran"
              },
              {
                "patterns": [
                  "sebutkan contoh alat ukur panjang?",
                  "alat ukur panjang"
                ],
                "keywords": [
                  "contoh",
                  "alat ukur",
                  "panjang",
                  "mistar",
                  "jangka sorong",
                  "mikrometer sekrup"
                ],
                "responses": [
                  "Contoh alat ukur panjang adalah mistar, jangka sorong, dan mikrometer sekrup, yang memiliki ketelitian yang berbeda-beda."
                ],
                "intent": "alat_ukur_panjang"
              },
              {
                "patterns": [
                  "apa itu besaran pokok dan besaran turunan?",
                  "jenis besaran"
                ],
                "keywords": [
                  "perbedaan",
                  "besaran pokok",
                  "besaran turunan",
                  "satuan dasar",
                  "gabungan"
                ],
                "responses": [
                  "Besaran pokok adalah besaran yang satuannya telah ditetapkan secara internasional (SI), seperti panjang, massa, dan waktu. Besaran turunan adalah besaran yang satuannya diturunkan dari besaran pokok, seperti luas, volume, dan kecepatan."
                ],
                "intent": "jenis_besaran"
              }
            ]
          },
          "Zat dan Wujudnya": {
            "QnA": [
              {
                "patterns": [
                  "apa saja wujud zat?",
                  "keadaan materi"
                ],
                "keywords": [
                  "wujud zat",
                  "padat",
                  "cair",
                  "gas",
                  "plasma"
                ],
                "responses": [
                  "Wujud zat yang umum dikenal adalah padat, cair, dan gas. Selain itu, ada juga wujud plasma pada suhu yang sangat tinggi."
                ],
                "intent": "wujud_zat"
              },
              {
                "patterns": [
                  "jelaskan perbedaan sifat zat padat, cair, dan gas?",
                  "karakteristik wujud zat"
                ],
                "keywords": [
                  "perbedaan",
                  "sifat",
                  "zat padat",
                  "cair",
                  "gas",
                  "bentuk",
                  "volume",
                  "pergerakan partikel"
                ],
                "responses": [
                  "Zat padat memiliki bentuk dan volume tetap, serta partikel-partikelnya tersusun rapat dan teratur. Zat cair memiliki volume tetap tetapi bentuknya berubah sesuai wadahnya, dan partikel-partikelnya lebih bebas bergerak. Zat gas tidak memiliki bentuk dan volume tetap, serta partikel-partikelnya bergerak sangat bebas."
                ],
                "intent": "perbedaan_sifat_wujud_zat"
              },
              {
                "patterns": [
                  "apa itu perubahan wujud zat?",
                  "contoh perubahan wujud"
                ],
                "keywords": [
                  "perubahan wujud",
                  "mencair",
                  "membeku",
                  "menguap",
                  "mengembun",
                  "menyublim",
                  "mengkristal"
                ],
                "responses": [
                  "Perubahan wujud zat adalah perubahan dari satu bentuk fisik ke bentuk fisik lainnya akibat penyerapan atau pelepasan kalor. Contohnya adalah es mencair menjadi air (mencair) dan air berubah menjadi uap (menguap)."
                ],
                "intent": "perubahan_wujud_zat"
              }
            ]
          },
          "Kalor dan Perubahan Suhu": {
            "QnA": [
              {
                "patterns": [
                  "apa itu kapasitas kalor?",
                  "kemampuan menyerap panas"
                ],
                "keywords": [
                  "pengertian",
                  "kapasitas kalor",
                  "jumlah kalor",
                  "perubahan suhu"
                ],
                "responses": [
                  "Kapasitas kalor adalah jumlah kalor yang dibutuhkan oleh suatu benda untuk menaikkan suhunya sebesar satu derajat Celsius atau satu Kelvin."
                ],
                "intent": "pengertian_kapasitas_kalor"
              },
              {
                "patterns": [
                  "apa itu kalor jenis?",
                  "kemampuan zat menyerap panas"
                ],
                "keywords": [
                  "pengertian",
                  "kalor jenis",
                  "jumlah kalor",
                  "massa",
                  "perubahan suhu",
                  "J/kg°C"
                ],
                "responses": [
                  "Kalor jenis adalah jumlah kalor yang dibutuhkan oleh satu kilogram zat untuk menaikkan suhunya sebesar satu derajat Celsius atau satu Kelvin. Satuan SI untuk kalor jenis adalah Joule per kilogram derajat Celsius (J/kg°C)."
                ],
                "intent": "pengertian_kalor_jenis"
              },
              {
                "patterns": [
                  "bagaimana menghitung kalor yang diserap atau dilepas?",
                  "rumus kalor"
                ],
                "keywords": [
                  "cara menghitung",
                  "rumus",
                  "kalor",
                  "massa",
                  "kalor jenis",
                  "perubahan suhu",
                  "<span class=\"math-inline\">Q \\= mc</span>"
                ],
                "responses": [
                  "Jumlah kalor (Q) yang diserap atau dilepas oleh suatu benda dapat dihitung dengan rumus <span class=\\\"math-inline\\\">Q \\= mc</span>, di mana m adalah massa, c adalah kalor jenis, dan <span class=\\\"math-inline\\\">\\Delta T</span> adalah perubahan suhu."
                ],
                "intent": "rumus_kalor"
              }
            ]
          },
          "Gelombang Bunyi (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "apa itu cepat rambat bunyi?",
                  "kecepatan suara"
                ],
                "keywords": [
                  "pengertian",
                  "cepat rambat bunyi",
                  "medium",
                  "suhu",
                  "m/s"
                ],
                "responses": [
                  "Cepat rambat bunyi adalah kecepatan gelombang bunyi merambat melalui suatu medium. Cepat rambat bunyi bergantung pada jenis medium dan suhunya. Satuan SI untuk cepat rambat bunyi adalah meter per sekon (m/s)."
                ],
                "intent": "pengertian_cepat_rambat_bunyi"
              },
              {
                "patterns": [
                  "apa itu pemantulan bunyi?",
                  "echo"
                ],
                "keywords": [
                  "pengertian",
                  "pemantulan bunyi",
                  "echo",
                  "dinding",
                  "jarak"
                ],
                "responses": [
                  "Pemantulan bunyi adalah peristiwa kembalinya gelombang bunyi ketika mengenai suatu permukaan penghalang. Echo (gema) adalah bunyi pantul yang terdengar setelah bunyi asli."
                ],
                "intent": "pengertian_pemantulan_bunyi"
              },
              {
                "patterns": [
                  "apa itu pembiasan bunyi?",
                  "refraksi suara"
                ],
                "keywords": [
                  "pengertian",
                  "pembiasan bunyi",
                  "medium berbeda",
                  "suhu berbeda",
                  "belok"
                ],
                "responses": [
                  "Pembiasan bunyi adalah pembelokan arah rambat gelombang bunyi ketika melewati batas antara dua medium yang memiliki kerapatan atau suhu yang berbeda, yang menyebabkan perbedaan cepat rambat bunyi."
                ],
                "intent": "pengertian_pembiasan_bunyi"
              }
            ]
          },
          "Alat Optik (Lanjutan)": {
            "QnA": [
              {
                "patterns": [
                  "bagaimana cara kerja mata?",
                  "proses melihat"
                ],
                "keywords": [
                  "cara kerja",
                  "mata",
                  "cahaya",
                  "kornea",
                  "lensa",
                  "retina",
                  "otak"
                ],
                "responses": [
                  "Mata bekerja dengan menerima cahaya yang masuk melalui kornea, kemudian difokuskan oleh lensa ke retina. Sel-sel fotoreseptor di retina mengubah cahaya menjadi sinyal listrik yang dikirim ke otak untuk diinterpretasikan sebagai gambar."
                ],
                "intent": "cara_kerja_mata"
              },
              {
                "patterns": [
                  "bagaimana cara kerja kamera?",
                  "prinsip kerja kamera"
                ],
                "keywords": [
                  "cara kerja",
                  "kamera",
                  "lensa",
                  "diafragma",
                  "rana",
                  "sensor"
                ],
                "responses": [
                  "Kamera bekerja dengan menggunakan lensa untuk memfokuskan cahaya dari objek ke sensor (atau film). Diafragma mengatur jumlah cahaya yang masuk, dan rana mengatur durasi cahaya menyentuh sensor."
                ],
                "intent": "cara_kerja_kamera"
              },
              {
                "patterns": [
                  "apa fungsi kaca pembesar?",
                  "lensa pembesar"
                ],
                "keywords": [
                  "fungsi",
                  "kaca pembesar",
                  "lensa cembung",
                  "bayangan maya",
                  "diperbesar"
                ],
                "responses": [
                  "Kaca pembesar adalah lensa cembung yang digunakan untuk menghasilkan bayangan maya yang diperbesar dari objek yang diletakkan dekat dengan fokus lensa."
                ],
                "intent": "fungsi_kaca_pembesar"
              }
            ]
          },
          "Teknologi Telekomunikasi": {
            "QnA": [
              {
                "patterns": [
                  "bagaimana telepon dapat mengirim suara?",
                  "prinsip kerja telepon"
                ],
                "keywords": [
                  "cara kerja",
                  "telepon",
                  "suara",
                  "gelombang listrik",
                  "mikrofon",
                  "speaker"
                ],
                "responses": [
                  "Telepon bekerja dengan mengubah gelombang suara menjadi sinyal listrik melalui mikrofon, mengirimkan sinyal listrik tersebut melalui kabel atau gelombang radio, dan kemudian mengubah kembali sinyal listrik menjadi gelombang suara melalui speaker di telepon penerima."
                ],
                "intent": "cara_kerja_telepon"
              },
              {
                "patterns": [
                  "bagaimana radio dapat mengirim suara?",
                  "prinsip kerja radio"
                ],
                "keywords": [
                  "cara kerja",
                  "radio",
                  "gelombang elektromagnetik",
                  "modulasi",
                  "demodulasi",
                  "antena"
                ],
                "responses": [
                  "Radio bekerja dengan mengubah gelombang suara menjadi sinyal listrik, memodulasi sinyal listrik ke dalam gelombang elektromagnetik, memancarkan gelombang tersebut melalui antena, dan kemudian penerima radio akan mendemodulasi gelombang elektromagnetik untuk mendapatkan kembali sinyal suara dan mengubahnya menjadi bunyi melalui speaker."
                ],
                "intent": "cara_kerja_radio"
              },
              {
                "patterns": [
                  "bagaimana televisi dapat mengirim gambar dan suara?",
                  "prinsip kerja televisi"
                ],
                "keywords": [
                  "cara kerja",
                  "televisi",
                  "gambar",
                  "suara",
                  "gelombang elektromagnetik",
                  "pemancar",
                  "penerima"
                ],
                "responses": [
                  "Televisi bekerja dengan prinsip yang mirip dengan radio, tetapi juga mengirimkan informasi visual (gambar) melalui gelombang elektromagnetik. Pemancar televisi mengubah gambar dan suara menjadi sinyal listrik, memodulasinya ke dalam gelombang elektromagnetik, dan penerima televisi akan mendemodulasi sinyal tersebut untuk menampilkan gambar di layar dan menghasilkan suara melalui speaker."
                ],
                "intent": "cara_kerja_televisi"
              }
            ]
          },
          "Energi Nuklir": {
            "QnA": [
              {
                "patterns": [
                  "apa itu energi nuklir?",
                  "sumber energi nuklir"
                ],
                "keywords": [
                  "pengertian",
                  "energi nuklir",
                  "reaksi inti",
                  "fisi",
                  "fusi",
                  "uranium"
                ],
                "responses": [
                  "Energi nuklir adalah energi yang dihasilkan dari reaksi inti atom, seperti reaksi fisi (pembelahan inti berat) atau fusi (penggabungan inti ringan). Uranium adalah salah satu bahan bakar nuklir yang umum digunakan."
                ],
                "intent": "pengertian_energi_nuklir"
              },
              {
                "patterns": [
                  "bagaimana pembangkit listrik tenaga nuklir bekerja?",
                  "PLTN"
                ],
                "keywords": [
                  "cara kerja",
                  "PLTN",
                  "reaktor",
                  "uap",
                  "turbin",
                  "generator"
                ],
                "responses": [
                  "Pembangkit listrik tenaga nuklir (PLTN) bekerja dengan menggunakan reaktor nuklir untuk menghasilkan panas dari reaksi fisi. Panas ini digunakan untuk mendidihkan air menjadi uap bertekanan tinggi yang memutar turbin, dan turbin menggerakkan generator untuk menghasilkan listrik."
                ],
                "intent": "cara_kerja_pltn"
              },
              {
                "patterns": [
                  "apa keuntungan dan kerugian energi nuklir?",
                  "dampak energi nuklir"
                ],
                "keywords": [
                  "keuntungan",
                  "kerugian",
                  "energi nuklir",
                  "efisien",
                  "limbah radioaktif",
                  "kecelakaan"
                ],
                "responses": [
                  "Keuntungan energi nuklir adalah efisiensi tinggi dan tidak menghasilkan emisi gas rumah kaca secara langsung. Kerugiannya adalah menghasilkan limbah radioaktif yang berbahaya dan risiko kecelakaan reaktor yang dapat berdampak besar."
                ],
                "intent": "dampak_energi_nuklir"
              }
            ]
          },
          "Robotika Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu robot?",
                  "definisi robot"
                ],
                "keywords": [
                  "pengertian",
                  "robot",
                  "mesin",
                  "otomatis",
                  "tugas",
                  "sensor",
                  "aktuator"
                ],
                "responses": [
                  "Robot adalah mesin otomatis yang dapat diprogram untuk melakukan serangkaian tugas kompleks. Robot biasanya dilengkapi dengan sensor untuk berinteraksi dengan lingkungan dan aktuator untuk melakukan gerakan."
                ],
                "intent": "pengertian_robot"
              },
              {
                "patterns": [
                  "sebutkan komponen utama robot?",
                  "bagian-bagian robot"
                ],
                "keywords": [
                  "komponen",
                  "robot",
                  "sensor",
                  "aktuator",
                  "kontroler",
                  "sumber daya",
                  "struktur mekanik"
                ],
                "responses": [
                  "Komponen utama robot meliputi sensor (untuk menerima informasi dari lingkungan), aktuator (untuk menghasilkan gerakan), kontroler (otak robot yang memproses informasi dan memberikan perintah), sumber daya (biasanya baterai atau listrik), dan struktur mekanik (rangka dan bagian bergerak)."
                ],
                "intent": "komponen_robot"
              },
              {
                "patterns": [
                  "apa contoh penggunaan robot dalam kehidupan sehari-hari?",
                  "aplikasi robot"
                ],
                "keywords": [
                  "contoh",
                  "penggunaan",
                  "robot",
                  "industri",
                  "medis",
                  "rumah tangga",
                  "pendidikan"
                ],
                "responses": [
                  "Contoh penggunaan robot dalam kehidupan sehari-hari adalah di industri (perakitan mobil), bidang medis (operasi dengan bantuan robot), rumah tangga (robot penyedot debu), dan pendidikan (robot edukasi)."
                ],
                "intent": "aplikasi_robot"
              }
            ]
          },
          "Nanoteknologi Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu nanoteknologi?",
                  "ukuran nano"
                ],
                "keywords": [
                  "pengertian",
                  "nanoteknologi",
                  "skala nano",
                  "materi",
                  "manipulasi"
                ],
                "responses": [
                  "Nanoteknologi adalah manipulasi materi pada skala nanometer (sepermiliar meter) untuk menciptakan struktur, perangkat, dan sistem baru dengan sifat dan fungsi yang unik."
                ],
                "intent": "pengertian_nanoteknologi"
              },
              {
                "patterns": [
                  "apa contoh aplikasi nanoteknologi?",
                  "penerapan nanoteknologi"
                ],
                "keywords": [
                  "contoh",
                  "aplikasi",
                  "nanoteknologi",
                  "obat",
                  "material",
                  "elektronik"
                ],
                "responses": [
                  "Contoh aplikasi nanoteknologi adalah dalam bidang obat-obatan (pengiriman obat yang ditargetkan), material (bahan yang lebih kuat dan ringan), dan elektronik (komponen yang lebih kecil dan efisien)."
                ],
                "intent": "aplikasi_nanoteknologi"
              },
              {
                "patterns": [
                  "apa potensi dan risiko nanoteknologi?",
                  "dampak nanoteknologi"
                ],
                "keywords": [
                  "potensi",
                  "risiko",
                  "nanoteknologi",
                  "kemajuan",
                  "lingkungan",
                  "kesehatan"
                ],
                "responses": [
                  "Potensi nanoteknologi sangat besar dalam berbagai bidang, tetapi juga menimbulkan risiko terkait lingkungan dan kesehatan yang perlu diteliti dan diatasi."
                ],
                "intent": "dampak_nanoteknologi"
              }
            ]
          },
          "Astronomi Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu bintang?",
                  "definisi bintang"
                ],
                "keywords": [
                  "pengertian",
                  "bintang",
                  "bola gas",
                  "cahaya sendiri",
                  "nuklir"
                ],
                "responses": [
                  "Bintang adalah bola gas raksasa yang memancarkan cahaya dan panasnya sendiri melalui reaksi fusi nuklir di intinya."
                ],
                "intent": "pengertian_bintang"
              },
              {
                "patterns": [
                  "apa itu galaksi?",
                  "jenis-jenis galaksi"
                ],
                "keywords": [
                  "pengertian",
                  "galaksi",
                  "kumpulan bintang",
                  "spiral",
                  "elips",
                  "tak beraturan"
                ],
                "responses": [
                  "Galaksi adalah kumpulan besar bintang, gas, debu, dan materi gelap yang terikat oleh gravitasi. Jenis-jenis galaksi utama adalah spiral, elips, dan tak beraturan."
                ],
                "intent": "pengertian_galaksi"
              },
              {
                "patterns": [
                  "apa itu alam semesta?",
                  "pengertian universe"
                ],
                "keywords": [
                  "pengertian",
                  "alam semesta",
                  "universe",
                  "segala sesuatu",
                  "ruang",
                  "waktu"
                ],
                "responses": [
                  "Alam semesta (universe) adalah segala sesuatu yang ada, termasuk seluruh ruang, waktu, materi, dan energi."
                ],
                "intent": "pengertian_alam_semesta"
              }
            ]
          }
        }
      },
      "Kimia": {
        "subtopics": {
          "Larutan": {
            "QnA": [
              {
                "patterns": [
                  "apa itu larutan?",
                  "definisi larutan"
                ],
                "keywords": [
                  "pengertian",
                  "larutan",
                  "pelarut",
                  "zat terlarut",
                  "homogen"
                ],
                "responses": [
                  "Larutan adalah campuran homogen yang terdiri dari zat pelarut (biasanya jumlahnya lebih banyak) dan zat terlarut (jumlahnya lebih sedikit)."
                ],
                "intent": "pengertian_larutan"
              },
              {
                "patterns": [
                  "apa perbedaan larutan asam, basa, dan netral?",
                  "jenis larutan"
                ],
                "keywords": [
                  "perbedaan",
                  "larutan asam",
                  "basa",
                  "netral",
                  "pH",
                  "indikator"
                ],
                "responses": [
                  "Larutan asam memiliki pH kurang dari 7, larutan basa memiliki pH lebih dari 7, dan larutan netral memiliki pH sekitar 7. Perbedaan ini dapat diidentifikasi menggunakan indikator pH."
                ],
                "intent": "perbedaan_larutan_asam_basa_netral"
              },
              {
                "patterns": [
                  "apa itu konsentrasi larutan?",
                  "cara menyatakan konsentrasi"
                ],
                "keywords": [
                  "pengertian",
                  "konsentrasi larutan",
                  "jumlah zat terlarut",
                  "volume pelarut",
                  "molaritas"
                ],
                "responses": [
                  "Konsentrasi larutan adalah ukuran jumlah zat terlarut yang terdapat dalam sejumlah tertentu pelarut atau larutan. Salah satu cara menyatakan konsentrasi adalah molaritas (mol per liter)."
                ],
                "intent": "pengertian_konsentrasi_larutan"
              }
            ]
          },
          "Pembuatan dan Pemisahan Campuran": {
            "QnA": [
              {
                "patterns": [
                  "bagaimana cara membuat campuran?",
                  "proses pencampuran"
                ],
                "keywords": [
                  "cara membuat campuran",
                  "mencampurkan",
                  "mengaduk",
                  "melarutkan"
                ],
                "responses": [
                  "Campuran dapat dibuat dengan mencampurkan dua atau lebih zat secara fisik, misalnya dengan mengaduk atau melarutkan salah satu zat ke dalam zat lain."
                ],
                "intent": "cara_membuat_campuran"
              },
              {
                "patterns": [
                  "sebutkan metode pemisahan campuran?",
                  "cara memisahkan campuran"
                ],
                "keywords": [
                  "metode pemisahan campuran",
                  "filtrasi",
                  "destilasi",
                  "kromatografi",
                  "evaporasi",
                  "sublimasi"
                ],
                "responses": [
                  "Beberapa metode pemisahan campuran adalah filtrasi (penyaringan), destilasi (penyulingan), kromatografi, evaporasi (penguapan), dan sublimasi."
                ],
                "intent": "metode_pemisahan_campuran"
              },
              {
                "patterns": [
                  "jelaskan prinsip dasar destilasi?",
                  "cara kerja destilasi"
                ],
                "keywords": [
                  "prinsip destilasi",
                  "perbedaan titik didih",
                  "pemanasan",
                  "penguapan",
                  "pendinginan",
                  "kondensasi"
                ],
                "responses": [
                  "Destilasi adalah metode pemisahan campuran cair berdasarkan perbedaan titik didih komponen-komponennya. Campuran dipanaskan, komponen dengan titik didih lebih rendah akan menguap lebih dulu, kemudian uapnya didinginkan dan dikondensasikan kembali menjadi cairan yang terpisah."
                ],
                "intent": "prinsip_destilasi"
              }
            ]
          },
          "Logam dan Nonlogam": {
            "QnA": [
              {
                "patterns": [
                  "apa perbedaan logam dan nonlogam?",
                  "ciri-ciri logam dan nonlogam"
                ],
                "keywords": [
                  "perbedaan",
                  "logam",
                  "nonlogam",
                  "konduktor",
                  "mengkilap",
                  "lentur",
                  "rapuh"
                ],
                "responses": [
                  "Logam umumnya bersifat konduktor listrik dan panas yang baik, mengkilap, dapat ditempa dan diregangkan (ulet dan lentur). Nonlogam umumnya bersifat isolator atau konduktor yang buruk, tidak mengkilap, dan cenderung rapuh."
                ],
                "intent": "perbedaan_logam_nonlogam"
              },
              {
                "patterns": [
                  "sebutkan contoh unsur logam?",
                  "contoh logam"
                ],
                "keywords": [
                  "contoh unsur logam",
                  "besi",
                  "emas",
                  "perak",
                  "aluminium",
                  "tembaga"
                ],
                "responses": [
                  "Beberapa contoh unsur logam adalah besi (Fe), emas (Au), perak (Ag), aluminium (Al), dan tembaga (Cu)."
                ],
                "intent": "contoh_unsur_logam"
              },
              {
                "patterns": [
                  "sebutkan contoh unsur nonlogam?",
                  "contoh nonlogam"
                ],
                "keywords": [
                  "contoh unsur nonlogam",
                  "oksigen",
                  "nitrogen",
                  "karbon",
                  "belerang",
                  "fosfor"
                ],
                "responses": [
                  "Beberapa contoh unsur nonlogam adalah oksigen (O), nitrogen (N), karbon (C), belerang (S), dan fosfor (P)."
                ],
                "intent": "contoh_unsur_nonlogam"
              }
            ]
          },
          "Campuran dan Senyawa": {
            "QnA": [
              {
                "patterns": [
                  "apa perbedaan campuran dan senyawa",
                  "jelaskan campuran dan senyawa"
                ],
                "keywords": [
                  "campuran",
                  "senyawa",
                  "unsur",
                  "ikatan kimia",
                  "pemisahan"
                ],
                "responses": [
                  "Campuran adalah gabungan dua atau lebih zat tanpa melalui reaksi kimia dan komponennya masih mempertahankan sifat aslinya serta dapat dipisahkan secara fisik. Senyawa terbentuk melalui reaksi kimia antara unsur-unsur dengan perbandingan tetap dan memiliki sifat yang berbeda dari unsur penyusunnya serta hanya dapat dipisahkan melalui reaksi kimia."
                ],
                "intent": "perbedaan campuran senyawa"
              },
              {
                "patterns": [
                  "contoh campuran homogen dan heterogen",
                  "jenis-jenis campuran"
                ],
                "keywords": [
                  "homogen",
                  "heterogen",
                  "larutan",
                  "suspensi",
                  "koloid"
                ],
                "responses": [
                  "Contoh campuran homogen (serba sama) adalah larutan gula dalam air. Contoh campuran heterogen (tidak serba sama) adalah campuran air dan minyak atau pasir dan air. Selain itu, ada juga suspensi dan koloid."
                ],
                "intent": "jenis campuran"
              }
            ]
          },
          "Perubahan Zat": {
            "QnA": [
              {
                "patterns": [
                  "apa perbedaan perubahan fisika dan kimia",
                  "jenis-jenis perubahan zat"
                ],
                "keywords": [
                  "perubahan fisika",
                  "perubahan kimia",
                  "sifat",
                  "komposisi",
                  "reversible"
                ],
                "responses": [
                  "Perubahan fisika adalah perubahan zat yang tidak menghasilkan zat baru dan hanya mengubah bentuk atau wujudnya (reversible). Contohnya adalah es mencair menjadi air. Perubahan kimia adalah perubahan zat yang menghasilkan zat baru dengan komposisi dan sifat yang berbeda (irreversible). Contohnya adalah pembakaran kayu."
                ],
                "intent": "perbedaan perubahan fisika kimia"
              },
              {
                "patterns": [
                  "contoh perubahan fisika",
                  "contoh perubahan kimia"
                ],
                "keywords": [
                  "mencair",
                  "membeku",
                  "menguap",
                  "menyublim",
                  "berkarat",
                  "membusuk"
                ],
                "responses": [
                  "Contoh perubahan fisika meliputi mencair, membeku, menguap, menyublim, dan melarut. Contoh perubahan kimia meliputi pembakaran, perkaratan, pembusukan, dan fermentasi."
                ],
                "intent": "contoh perubahan zat"
              }
            ]
          },
          "Sifat Kimia": {
            "QnA": [
              {
                "patterns": [
                  "apa itu sifat kimia",
                  "pengertian sifat kimia"
                ],
                "keywords": [
                  "sifat kimia",
                  "reaksi",
                  "mudah terbakar",
                  "korosif",
                  "beracun"
                ],
                "responses": [
                  "Sifat kimia adalah karakteristik suatu zat yang menunjukkan kemampuannya untuk mengalami perubahan kimia atau bereaksi dengan zat lain membentuk zat baru."
                ],
                "intent": "pengertian sifat kimia"
              },
              {
                "patterns": [
                  "contoh sifat kimia",
                  "apa saja sifat kimia zat"
                ],
                "keywords": [
                  "mudah terbakar",
                  "mudah berkarat",
                  "asam",
                  "basa",
                  "oksidator",
                  "reduktor"
                ],
                "responses": [
                  "Contoh sifat kimia suatu zat antara lain mudah terbakar (flammability), mudah berkarat (corrosiveness), keasaman (acidity), kebasaan (basicity), kemampuan mengoksidasi (oxidizing agent), dan kemampuan mereduksi (reducing agent)."
                ],
                "intent": "contoh sifat kimia"
              }
            ]
          },
          "Kimia dalam Kehidupan Sehari-hari": {
            "QnA": [
              {
                "patterns": [
                  "apa saja bahan kimia dalam rumah tangga?",
                  "contoh kimia sehari-hari"
                ],
                "keywords": [
                  "bahan kimia rumah tangga",
                  "sabun",
                  "deterjen",
                  "pemutih",
                  "cuka",
                  "baking soda"
                ],
                "responses": [
                  "Beberapa contoh bahan kimia yang umum digunakan dalam rumah tangga adalah sabun, deterjen, pemutih, cuka, dan baking soda."
                ],
                "intent": "bahan_kimia_rumah_tangga"
              },
              {
                "patterns": [
                  "apa fungsi sabun dan deterjen?",
                  "cara kerja sabun deterjen"
                ],
                "keywords": [
                  "fungsi sabun",
                  "fungsi deterjen",
                  "kotoran",
                  "air",
                  "emulsifikasi"
                ],
                "responses": [
                  "Sabun dan deterjen berfungsi untuk membersihkan kotoran dari permukaan dengan cara menurunkan tegangan permukaan air dan mengemulsifikasi minyak atau lemak sehingga dapat terlarut dalam air."
                ],
                "intent": "fungsi_sabun_deterjen"
              },
              {
                "patterns": [
                  "apa manfaat cuka dan baking soda?",
                  "kegunaan cuka baking soda"
                ],
                "keywords": [
                  "manfaat cuka",
                  "manfaat baking soda",
                  "asam asetat",
                  "natrium bikarbonat",
                  "reaksi"
                ],
                "responses": [
                  "Cuka (asam asetat) bermanfaat sebagai bahan makanan, pembersih, dan penghilang bau. Baking soda (natrium bikarbonat) bermanfaat sebagai bahan pengembang kue, pembersih, dan penetral asam."
                ],
                "intent": "manfaat_cuka_baking_soda"
              }
            ]
          },
          "Polimer": {
            "QnA": [
              {
                "patterns": [
                  "apa itu polimer?",
                  "definisi polimer"
                ],
                "keywords": [
                  "pengertian",
                  "polimer",
                  "rantai panjang",
                  "monomer",
                  "makromolekul"
                ],
                "responses": [
                  "Polimer adalah molekul besar (makromolekul) yang terbentuk dari pengulangan unit-unit kecil yang disebut monomer yang saling berikatan membentuk rantai panjang."
                ],
                "intent": "pengertian_polimer"
              },
              {
                "patterns": [
                  "sebutkan jenis-jenis polimer?",
                  "klasifikasi polimer"
                ],
                "keywords": [
                  "jenis polimer",
                  "alam",
                  "sintetis",
                  "plastik",
                  "karet",
                  "protein"
                ],
                "responses": [
                  "Polimer dapat diklasifikasikan menjadi polimer alam (contoh: protein, selulosa, karet alam) dan polimer sintetis (buatan, contoh: plastik, nilon, teflon)."
                ],
                "intent": "jenis_polimer"
              },
              {
                "patterns": [
                  "apa dampak penggunaan plastik terhadap lingkungan?",
                  "masalah sampah plastik"
                ],
                "keywords": [
                  "dampak plastik",
                  "lingkungan",
                  "sampah",
                  "sulit terurai",
                  "polusi"
                ],
                "responses": [
                  "Penggunaan plastik yang berlebihan dapat menyebabkan masalah lingkungan karena plastik sulit terurai secara alami, sehingga menumpuk sebagai sampah dan menyebabkan polusi tanah dan air."
                ],
                "intent": "dampak_plastik_lingkungan"
              }
            ]
          },
          "Kimia Hijau": {
            "QnA": [
              {
                "patterns": [
                  "apa itu kimia hijau?",
                  "prinsip kimia hijau"
                ],
                "keywords": [
                  "pengertian",
                  "kimia hijau",
                  "ramah lingkungan",
                  "berkelanjutan",
                  "mencegah limbah"
                ],
                "responses": [
                  "Kimia hijau adalah pendekatan dalam kimia yang berfokus pada perancangan produk dan proses kimia yang mengurangi atau menghilangkan penggunaan dan pembentukan zat berbahaya."
                ],
                "intent": "pengertian_kimia_hijau"
              },
              {
                "patterns": [
                  "sebutkan prinsip-prinsip kimia hijau?",
                  "asas kimia hijau"
                ],
                "keywords": [
                  "prinsip kimia hijau",
                  "pencegahan limbah",
                  "atom ekonomi",
                  "pelarut aman",
                  "rancang untuk degradasi"
                ],
                "responses": [
                  "Beberapa prinsip kimia hijau antara lain pencegahan limbah, atom ekonomi (memaksimalkan atom reaktan menjadi produk), penggunaan pelarut dan bahan kimia yang lebih aman, dan perancangan produk agar dapat terdegradasi setelah digunakan."
                ],
                "intent": "prinsip_kimia_hijau"
              },
              {
                "patterns": [
                  "apa contoh penerapan kimia hijau?",
                  "aplikasi kimia hijau"
                ],
                "keywords": [
                  "contoh kimia hijau",
                  "pelarut superkritis",
                  "biokatalis",
                  "bahan bakar alternatif"
                ],
                "responses": [
                  "Contoh penerapan kimia hijau adalah penggunaan pelarut superkritis yang lebih aman, penggunaan biokatalis (enzim) dalam industri, dan pengembangan bahan bakar alternatif yang lebih ramah lingkungan."
                ],
                "intent": "aplikasi_kimia_hijau"
              }
            ]
          },
          "Tata Nama Senyawa Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "bagaimana cara memberi nama senyawa ionik biner?",
                  "tata nama senyawa ion"
                ],
                "keywords": [
                  "tata nama",
                  "senyawa ionik",
                  "logam",
                  "nonlogam",
                  "akhiran -ida"
                ],
                "responses": [
                  "Nama senyawa ionik biner (terdiri dari dua jenis unsur, satu logam dan satu nonlogam) umumnya dibentuk dengan menyebutkan nama logam diikuti nama nonlogam dengan akhiran -ida. Contoh: NaCl adalah natrium klorida."
                ],
                "intent": "tata_nama_senyawa_ionik_biner"
              },
              {
                "patterns": [
                  "bagaimana cara memberi nama senyawa kovalen biner?",
                  "tata nama senyawa molekuler"
                ],
                "keywords": [
                  "tata nama",
                  "senyawa kovalen",
                  "nonlogam",
                  "awalan di-, tri-, tetra-"
                ],
                "responses": [
                  "Nama senyawa kovalen biner (terdiri dari dua jenis unsur nonlogam) dibentuk dengan menggunakan awalan Yunani (mono-, di-, tri-, tetra-, dll.) untuk menunjukkan jumlah atom setiap unsur. Contoh: CO₂ adalah karbon dioksida."
                ],
                "intent": "tata_nama_senyawa_kovalen_biner"
              },
              {
                "patterns": [
                  "apa itu ion poliatomik?",
                  "contoh ion poliatomik"
                ],
                "keywords": [
                  "pengertian",
                  "ion poliatomik",
                  "lebih dari satu atom",
                  "muatan",
                  "sulfat",
                  "nitrat",
                  "hidroksida"
                ],
                "responses": [
                  "Ion poliatomik adalah ion yang terdiri dari lebih dari satu atom yang terikat bersama dan memiliki muatan listrik keseluruhan. Contohnya adalah ion sulfat (SO₄²⁻), ion nitrat (NO₃⁻), dan ion hidroksida (OH⁻)."
                ],
                "intent": "pengertian_ion_poliatomik"
              }
            ]
          },
          "Stoikiometri Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu stoikiometri?",
                  "perhitungan kimia"
                ],
                "keywords": [
                  "pengertian",
                  "stoikiometri",
                  "perbandingan mol",
                  "koefisien reaksi",
                  "perhitungan kimia"
                ],
                "responses": [
                  "Stoikiometri adalah cabang kimia yang mempelajari hubungan kuantitatif (perbandingan jumlah) antara reaktan dan produk dalam reaksi kimia."
                ],
                "intent": "pengertian_stoikiometri"
              },
              {
                "patterns": [
                  "apa itu mol?",
                  "konsep mol"
                ],
                "keywords": [
                  "pengertian",
                  "mol",
                  "jumlah zat",
                  "6.02 x 10^23",
                  "bilangan avogadro"
                ],
                "responses": [
                  "Mol adalah satuan jumlah zat dalam kimia, yang didefinisikan sebagai jumlah entitas (atom, molekul, ion, dll.) yang sama dengan jumlah atom dalam 12 gram karbon-12. Satu mol mengandung sekitar $6.02 \times 10^{23}$ entitas (Bilangan Avogadro)."
                ],
                "intent": "pengertian_mol"
              },
              {
                "patterns": [
                  "bagaimana cara menghitung massa molar?",
                  "berat molekul"
                ],
                "keywords": [
                  "cara menghitung",
                  "massa molar",
                  "berat molekul",
                  "massa atom relatif",
                  "jumlah atom"
                ],
                "responses": [
                  "Massa molar suatu zat adalah massa satu mol zat tersebut dan dihitung dengan menjumlahkan massa atom relatif (Ar) dari semua atom yang terdapat dalam rumus kimia zat tersebut."
                ],
                "intent": "cara_menghitung_massa_molar"
              }
            ]
          },
          "Laju Reaksi": {
            "QnA": [
              {
                "patterns": [
                  "apa itu laju reaksi?",
                  "kecepatan reaksi kimia"
                ],
                "keywords": [
                  "pengertian",
                  "laju reaksi",
                  "perubahan konsentrasi",
                  "waktu"
                ],
                "responses": [
                  "Laju reaksi adalah ukuran seberapa cepat reaktan diubah menjadi produk dalam suatu reaksi kimia, biasanya dinyatakan sebagai perubahan konsentrasi reaktan atau produk per satuan waktu."
                ],
                "intent": "pengertian_laju_reaksi"
              },
              {
                "patterns": [
                  "apa saja faktor yang mempengaruhi laju reaksi?",
                  "faktor kecepatan reaksi"
                ],
                "keywords": [
                  "faktor laju reaksi",
                  "konsentrasi",
                  "suhu",
                  "luas permukaan",
                  "katalis"
                ],
                "responses": [
                  "Faktor-faktor yang mempengaruhi laju reaksi antara lain konsentrasi reaktan, suhu, luas permukaan sentuh (untuk reaksi heterogen), dan keberadaan katalis."
                ],
                "intent": "faktor_laju_reaksi"
              },
              {
                "patterns": [
                  "apa fungsi katalis dalam reaksi kimia?",
                  "peran katalis"
                ],
                "keywords": [
                  "fungsi katalis",
                  "mempercepat reaksi",
                  "energi aktivasi",
                  "tidak ikut bereaksi"
                ],
                "responses": [
                  "Katalis adalah zat yang dapat mempercepat laju reaksi kimia tanpa dikonsumsi dalam reaksi tersebut. Katalis bekerja dengan menurunkan energi aktivasi yang dibutuhkan untuk terjadinya reaksi."
                ],
                "intent": "fungsi_katalis"
              }
            ]
          },
          "Kesetimbangan Kimia Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu kesetimbangan kimia?",
                  "reaksi bolak-balik"
                ],
                "keywords": [
                  "pengertian",
                  "kesetimbangan kimia",
                  "reaksi bolak-balik",
                  "laju maju = laju balik"
                ],
                "responses": [
                  "Kesetimbangan kimia adalah keadaan di mana laju reaksi maju sama dengan laju reaksi balik dalam suatu reaksi kimia bolak-balik, sehingga konsentrasi reaktan dan produk tidak lagi berubah seiring waktu."
                ],
                "intent": "pengertian_kesetimbangan_kimia"
              },
              {
                "patterns": [
                  "apa itu tetapan kesetimbangan (Kc)?",
                  "nilai Kc"
                ],
                "keywords": [
                  "pengertian",
                  "tetapan kesetimbangan",
                  "Kc",
                  "perbandingan konsentrasi produk dan reaktan"
                ],
                "responses": [
                  "Tetapan kesetimbangan (Kc) adalah nilai yang menunjukkan perbandingan konsentrasi produk dengan konsentrasi reaktan pada keadaan setimbang pada suhu tertentu. Nilai Kc memberikan informasi tentang sejauh mana reaksi berlangsung."
                ],
                "intent": "pengertian_tetapan_kesetimbangan"
              },
              {
                "patterns": [
                  "apa itu asas Le Chatelier?",
                  "faktor pergeseran kesetimbangan"
                ],
                "keywords": [
                  "asas le chatelier",
                  "pergeseran kesetimbangan",
                  "perubahan konsentrasi",
                  "suhu",
                  "tekanan"
                ],
                "responses": [
                  "Asas Le Chatelier menyatakan bahwa jika suatu perubahan kondisi (seperti perubahan konsentrasi, suhu, atau tekanan) diterapkan pada sistem kesetimbangan, sistem akan bergeser ke arah yang cenderung mengurangi tekanan akibat perubahan tersebut."
                ],
                "intent": "asas_le_chatelier"
              }
            ]
          },
          "Redoks Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu reaksi redoks?",
                  "pengertian oksidasi reduksi"
                ],
                "keywords": [
                  "pengertian",
                  "reaksi redoks",
                  "oksidasi",
                  "reduksi",
                  "transfer elektron"
                ],
                "responses": [
                  "Reaksi redoks (reduksi-oksidasi) adalah reaksi kimia yang melibatkan perubahan bilangan oksidasi atom-atom yang bereaksi, yang disebabkan oleh transfer elektron antara reaktan."
                ],
                "intent": "pengertian_reaksi_redoks"
              },
              {
                "patterns": [
                  "apa itu oksidasi?",
                  "definisi oksidasi"
                ],
                "keywords": [
                  "pengertian",
                  "oksidasi",
                  "kehilangan elektron",
                  "kenaikan bilangan oksidasi",
                  "reaksi dengan oksigen"
                ],
                "responses": [
                  "Oksidasi adalah proses kehilangan elektron oleh suatu atom, ion, atau molekul, yang mengakibatkan kenaikan bilangan oksidasi. Dahulu, oksidasi juga diartikan sebagai reaksi suatu zat dengan oksigen."
                ],
                "intent": "pengertian_oksidasi"
              },
              {
                "patterns": [
                  "apa itu reduksi?",
                  "definisi reduksi"
                ],
                "keywords": [
                  "pengertian",
                  "reduksi",
                  "mendapatkan elektron",
                  "penurunan bilangan oksidasi",
                  "pelepasan oksigen"
                ],
                "responses": [
                  "Reduksi adalah proses mendapatkan elektron oleh suatu atom, ion, atau molekul, yang mengakibatkan penurunan bilangan oksidasi. Dahulu, reduksi juga diartikan sebagai pelepasan oksigen dari suatu zat."
                ],
                "intent": "pengertian_reduksi"
              }
            ]
          },
          "Elektrokimia Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu sel elektrokimia?",
                  "sel volta dan sel elektrolisis"
                ],
                "keywords": [
                  "pengertian",
                  "sel elektrokimia",
                  "energi listrik",
                  "reaksi kimia",
                  "sel volta",
                  "sel elektrolisis"
                ],
                "responses": [
                  "Sel elektrokimia adalah perangkat yang mengubah energi kimia menjadi energi listrik (sel volta atau sel galvani) atau sebaliknya, mengubah energi listrik menjadi energi kimia (sel elektrolisis) melalui reaksi redoks."
                ],
                "intent": "pengertian_sel_elektrokimia"
              },
              {
                "patterns": [
                  "bagaimana cara kerja sel volta?",
                  "prinsip sel galvani"
                ],
                "keywords": [
                  "cara kerja",
                  "sel volta",
                  "anoda",
                  "katoda",
                  "elektrolit",
                  "arus listrik"
                ],
                "responses": [
                  "Sel volta bekerja berdasarkan reaksi redoks spontan yang menghasilkan arus listrik. Terdiri dari anoda (tempat terjadinya oksidasi), katoda (tempat terjadinya reduksi), elektrolit (larutan ionik), dan jembatan garam (menjaga kenetralan listrik)."
                ],
                "intent": "cara_kerja_sel_volta"
              },
              {
                "patterns": [
                  "apa itu elektrolisis?",
                  "prinsip elektrolisis"
                ],
                "keywords": [
                  "pengertian",
                  "elektrolisis",
                  "arus listrik",
                  "reaksi non-spontan",
                  "elektroda"
                ],
                "responses": [
                  "Elektrolisis adalah proses penguraian suatu elektrolit (senyawa ionik dalam bentuk lelehan atau larutan) menjadi unsur-unsurnya dengan menggunakan arus listrik melalui elektroda."
                ],
                "intent": "pengertian_elektrolisis"
              }
            ]
          },
          "Kimia Organik Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu senyawa organik?",
                  "ciri-ciri senyawa organik"
                ],
                "keywords": [
                  "pengertian",
                  "senyawa organik",
                  "karbon",
                  "hidrogen",
                  "ikatan kovalen"
                ],
                "responses": [
                  "Senyawa organik adalah senyawa kimia yang sebagian besar mengandung atom karbon (C) yang berikatan kovalen dengan atom lain, terutama hidrogen (H), oksigen (O), nitrogen (N), dan halogen."
                ],
                "intent": "pengertian_senyawa_organik"
              },
              {
                "patterns": [
                  "sebutkan contoh senyawa organik sederhana?",
                  "alkana, alkena, alkuna"
                ],
                "keywords": [
                  "contoh senyawa organik",
                  "metana",
                  "etana",
                  "etena",
                  "etuna"
                ],
                "responses": [
                  "Beberapa contoh senyawa organik sederhana adalah metana (CH₄), etana (C₂H₆), etena (C₂H₄), dan etuna (C₂H₂)."
                ],
                "intent": "contoh_senyawa_organik_sederhana"
              },
              {
                "patterns": [
                  "apa itu hidrokarbon?",
                  "jenis hidrokarbon"
                ],
                "keywords": [
                  "pengertian",
                  "hidrokarbon",
                  "karbon dan hidrogen",
                  "alkana",
                  "alkena",
                  "alkuna"
                ],
                "responses": [
                  "Hidrokarbon adalah senyawa organik yang hanya terdiri dari atom karbon (C) dan hidrogen (H). Hidrokarbon dibagi menjadi alkana (ikatan tunggal), alkena (ikatan rangkap dua), dan alkuna (ikatan rangkap tiga)."
                ],
                "intent": "pengertian_hidrokarbon"
              }
            ]
          },
          "Biokimia Sederhana": {
            "QnA": [
              {
                "patterns": [
                  "apa itu biokimia?",
                  "kimia makhluk hidup"
                ],
                "keywords": [
                  "pengertian",
                  "biokimia",
                  "molekul biologis",
                  "proses kehidupan"
                ],
                "responses": [
                  "Biokimia adalah cabang ilmu kimia yang mempelajari struktur, fungsi, dan interaksi molekul-molekul biologis yang berperan dalam proses kehidupan."
                ],
                "intent": "pengertian_biokimia"
              },
              {
                "patterns": [
                  "sebutkan contoh molekul biologi penting?",
                  "karbohidrat, protein, lemak"
                ],
                "keywords": [
                  "molekul biologi",
                  "karbohidrat",
                  "protein",
                  "lemak",
                  "asam nukleat"
                ],
                "responses": [
                  "Beberapa contoh molekul biologi penting adalah karbohidrat (sumber energi), protein (pembangun tubuh), lemak (penyimpanan energi), dan asam nukleat (pembawa informasi genetik)."
                ],
                "intent": "contoh_molekul_biologi"
              },
              {
                "patterns": [
                  "apa fungsi enzim dalam tubuh?",
                  "peran enzim"
                ],
                "keywords": [
                  "fungsi enzim",
                  "biokatalis",
                  "mempercepat reaksi biokimia",
                  "spesifik"
                ],
                "responses": [
                  "Enzim adalah protein yang berfungsi sebagai biokatalis dalam tubuh makhluk hidup, mempercepat reaksi-reaksi biokimia yang penting untuk kehidupan. Enzim bersifat sangat spesifik terhadap substratnya."
                ],
                "intent": "fungsi_enzim"
              }
            ]
          },
          "Kimia Lingkungan": {
            "QnA": [
              {
                "patterns": [
                  "apa itu polusi air?",
                  "penyebab pencemaran air"
                ],
                "keywords": [
                  "pengertian",
                  "polusi air",
                  "pencemaran air",
                  "limbah industri",
                  "pertanian",
                  "rumah tangga"
                ],
                "responses": [
                  "Polusi air adalah kontaminasi badan air (seperti danau, sungai, lautan, dan air tanah) oleh zat-zat berbahaya yang berasal dari limbah industri, pertanian, dan rumah tangga."
                ],
                "intent": "pengertian_polusi_air"
              },
              {
                "patterns": [
                  "apa itu polusi udara?",
                  "penyebab pencemaran udara"
                ],
                "keywords": [
                  "pengertian",
                  "polusi udara",
                  "pencemaran udara",
                  "emisi kendaraan",
                  "industri",
                  "pembakaran"
                ],
                "responses": [
                  "Polusi udara adalah kontaminasi atmosfer oleh zat-zat berbahaya seperti partikulat, gas-gas beracun, dan materi biologis yang berasal dari emisi kendaraan, aktivitas industri, dan pembakaran."
                ],
                "intent": "pengertian_polusi_udara"
              },
              {
                "patterns": [
                  "apa dampak hujan asam?",
                  "akibat hujan asam"
                ],
                "keywords": [
                  "dampak hujan asam",
                  "pH rendah",
                  "merusak bangunan",
                  "ekosistem air",
                  "tanah"
                ],
                "responses": [
                  "Hujan asam adalah hujan dengan pH yang lebih rendah dari normal akibat adanya polutan asam di udara (seperti sulfur dioksida dan nitrogen oksida). Dampaknya antara lain merusak bangunan, ekosistem air, dan kesuburan tanah."
                ],
                "intent": "dampak_hujan_asam"
              }
            ]
          },
          "Kimia Pangan": {
            "QnA": [
              {
                "patterns": [
                  "apa saja kandungan kimia dalam makanan?",
                  "komponen kimia makanan"
                ],
                "keywords": [
                  "kandungan kimia makanan",
                  "karbohidrat",
                  "protein",
                  "lemak",
                  "vitamin",
                  "mineral"
                ],
                "responses": [
                  "Kandungan kimia utama dalam makanan meliputi karbohidrat, protein, lemak, vitamin, mineral, dan air."
                ],
                "intent": "kandungan_kimia_makanan"
              },
              {
                "patterns": [
                  "apa fungsi karbohidrat, protein, dan lemak bagi tubuh?",
                  "peran nutrisi"
                ],
                "keywords": [
                  "fungsi karbohidrat",
                  "fungsi protein",
                  "fungsi lemak",
                  "energi",
                  "pembangun",
                  "penyimpanan"
                ],
                "responses": [
                  "Karbohidrat merupakan sumber energi utama bagi tubuh. Protein berperan sebagai pembangun dan perbaikan jaringan. Lemak berfungsi sebagai sumber energi cadangan dan pelarut vitamin tertentu."
                ],
                "intent": "fungsi_karbohidrat_protein_lemak"
              },
              {
                "patterns": [
                  "apa itu zat aditif makanan?",
                  "contoh aditif makanan"
                ],
                "keywords": [
                  "zat aditif makanan",
                  "pengawet",
                  "pewarna",
                  "perasa",
                  "penyedap"
                ],
                "responses": [
                  "Zat aditif makanan adalah bahan kimia yang ditambahkan ke dalam makanan untuk berbagai tujuan, seperti pengawetan, pewarnaan, penambah rasa, dan penyedap. Contohnya adalah natrium benzoat (pengawet) dan tartrazin (pewarna kuning)."
                ],
                "intent": "pengertian_zat_aditif_makanan"
              }
            ]
          },
          "Materi dan Perubahannya": {
            "QnA": [
              {
                "patterns": [
                  "apa itu materi?",
                  "definisi zat"
                ],
                "keywords": [
                  "pengertian",
                  "materi",
                  "zat",
                  "massa",
                  "volume",
                  "menempati ruang"
                ],
                "responses": [
                  "Materi adalah segala sesuatu yang memiliki massa dan menempati ruang (memiliki volume)."
                ],
                "intent": "pengertian_materi"
              },
              {
                "patterns": [
                  "sebutkan wujud materi?",
                  "keadaan zat"
                ],
                "keywords": [
                  "wujud materi",
                  "padat",
                  "cair",
                  "gas",
                  "contoh"
                ],
                "responses": [
                  "Wujud materi yang umum adalah padat (contoh: es), cair (contoh: air), dan gas (contoh: uap air)."
                ],
                "intent": "wujud_materi"
              },
              {
                "patterns": [
                  "apa itu perubahan fisika?",
                  "contoh perubahan fisika"
                ],
                "keywords": [
                  "pengertian",
                  "perubahan fisika",
                  "tidak membentuk zat baru",
                  "wujud",
                  "bentuk",
                  "ukuran"
                ],
                "responses": [
                  "Perubahan fisika adalah perubahan pada materi yang tidak menghasilkan zat baru. Contohnya adalah perubahan wujud (mencair, membeku, menguap, mengembun), perubahan bentuk (memotong kayu), dan perubahan ukuran (melarutkan gula dalam air)."
                ],
                "intent": "perubahan_fisika"
              }
            ]
          },
          "Unsur, Senyawa, dan Campuran": {
            "QnA": [
              {
                "patterns": [
                  "apa itu unsur?",
                  "definisi unsur kimia"
                ],
                "keywords": [
                  "pengertian",
                  "unsur",
                  "zat tunggal",
                  "tidak dapat diuraikan",
                  "atom"
                ],
                "responses": [
                  "Unsur adalah zat tunggal yang tidak dapat diuraikan lagi menjadi zat yang lebih sederhana melalui reaksi kimia biasa. Unsur terdiri dari atom-atom yang memiliki jumlah proton yang sama dalam intinya."
                ],
                "intent": "pengertian_unsur"
              },
              {
                "patterns": [
                  "apa itu senyawa?",
                  "definisi senyawa kimia"
                ],
                "keywords": [
                  "pengertian",
                  "senyawa",
                  "zat tunggal",
                  "terdiri dari unsur",
                  "perbandingan tetap",
                  "reaksi kimia"
                ],
                "responses": [
                  "Senyawa adalah zat tunggal yang terbentuk dari dua atau lebih jenis unsur yang berbeda yang terikat secara kimia dengan perbandingan massa yang tetap dan dapat diuraikan menjadi unsur-unsurnya melalui reaksi kimia."
                ],
                "intent": "pengertian_senyawa"
              },
              {
                "patterns": [
                  "apa itu campuran?",
                  "definisi campuran kimia"
                ],
                "keywords": [
                  "pengertian",
                  "campuran",
                  "dua zat atau lebih",
                  "tidak terikat kimia",
                  "perbandingan tidak tetap",
                  "pemisahan fisika"
                ],
                "responses": [
                  "Campuran adalah gabungan dari dua atau lebih zat yang berbeda tanpa melalui reaksi kimia. Komponen-komponen dalam campuran tidak terikat secara kimia dan dapat dipisahkan melalui metode pemisahan fisika."
                ],
                "intent": "pengertian_campuran"
              }
            ]
          },
          "Asam, Basa, dan Garam": {
            "QnA": [
              {
                "patterns": [
                  "apa itu asam?",
                  "ciri-ciri asam"
                ],
                "keywords": [
                  "pengertian",
                  "asam",
                  "rasa masam",
                  "pH kurang dari 7",
                  "lakmus merah"
                ],
                "responses": [
                  "Asam adalah zat kimia yang memiliki rasa masam, dapat memerahkan kertas lakmus biru, dan memiliki pH kurang dari 7."
                ],
                "intent": "pengertian_asam"
              },
              {
                "patterns": [
                  "apa itu basa?",
                  "ciri-ciri basa"
                ],
                "keywords": [
                  "pengertian",
                  "basa",
                  "rasa pahit",
                  "pH lebih dari 7",
                  "lakmus biru"
                ],
                "responses": [
                  "Basa adalah zat kimia yang memiliki rasa pahit, terasa licin di kulit, dapat membirukan kertas lakmus merah, dan memiliki pH lebih dari 7."
                ],
                "intent": "pengertian_basa"
              },
              {
                "patterns": [
                  "apa itu garam?",
                  "pembentukan garam"
                ],
                "keywords": [
                  "pengertian",
                  "garam",
                  "reaksi asam basa",
                  "netralisasi",
                  "contoh"
                ],
                "responses": [
                  "Garam adalah senyawa ionik yang terbentuk dari reaksi antara asam dan basa (reaksi netralisasi). Contoh garam adalah natrium klorida (garam dapur)."
                ],
                "intent": "pengertian_garam"
              }
            ]
          },
          "Reaksi Kimia": {
            "QnA": [
              {
                "patterns": [
                  "apa itu reaksi kimia?",
                  "definisi reaksi kimia"
                ],
                "keywords": [
                  "pengertian",
                  "reaksi kimia",
                  "zat baru",
                  "pemutusan ikatan",
                  "pembentukan ikatan"
                ],
                "responses": [
                  "Reaksi kimia adalah proses di mana satu atau lebih zat (reaktan) diubah menjadi satu atau lebih zat yang berbeda (produk) melalui pemutusan dan pembentukan ikatan kimia antar atom."
                ],
                "intent": "pengertian_reaksi_kimia"
              },
              {
                "patterns": [
                  "sebutkan ciri-ciri terjadinya reaksi kimia?",
                  "tanda-tanda reaksi kimia"
                ],
                "keywords": [
                  "ciri reaksi kimia",
                  "perubahan warna",
                  "endapan",
                  "gas",
                  "suhu",
                  "cahaya"
                ],
                "responses": [
                  "Ciri-ciri terjadinya reaksi kimia antara lain perubahan warna, pembentukan endapan, pembentukan gas, perubahan suhu, dan timbulnya cahaya atau bunyi."
                ],
                "intent": "ciri_reaksi_kimia"
              },
              {
                "patterns": [
                  "apa itu persamaan reaksi kimia?",
                  "penulisan reaksi kimia"
                ],
                "keywords": [
                  "pengertian",
                  "persamaan reaksi",
                  "reaktan",
                  "produk",
                  "koefisien",
                  "simbol kimia"
                ],
                "responses": [
                  "Persamaan reaksi kimia adalah representasi simbolik dari suatu reaksi kimia yang menunjukkan reaktan (zat pereaksi) di sisi kiri dan produk (zat hasil reaksi) di sisi kanan, dipisahkan oleh anak panah. Persamaan ini seringkali dilengkapi dengan koefisien untuk menyetarakan jumlah atom setiap unsur."
                ],
                "intent": "pengertian_persamaan_reaksi_kimia"
              }
            ]
          }
        }
      }
    },
    "metadata": {
      "version": "2.2",
      "last_updated": "2025-05-05",
      "total_questions": {
        "Biologi": 120,
        "Fisika": 117,
        "Kimia": 66
      },
      "recommended_images": [
        "sel.png",
        "pencernaan.png",
        "fotosintesis.png",
        "ph-scale.png"
      ]
    }
  }
}
